{
  "contributor_author": "Cordero Alonso, Roberto J",
  "contributor_committeechair": "Kuhar, Thomas P.",
  "contributor_committeemember": [
    "Kok, Loke T.",
    "Bloomquist, Jeffrey R.",
    "Bratsch, Anthony D.",
    "Youngman, Roger R.",
    "Sterrett, Susan B."
  ],
  "contributor_department": "Entomology",
  "date_accessioned": "2014-03-14T20:17:44Z",
  "date_adate": "2005-11-01",
  "date_available": "2014-03-14T20:17:44Z",
  "date_issued": "2005-10-19",
  "date_rdate": "2005-11-01",
  "date_sdate": "2005-10-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Diamondback moth, Plutella xylostella (L.) (Lepidoptera: Plutellidae) is a serious pest of crucifer vegetables (Brassica sp.) worldwide because of a lack of effective natural enemies in certain regions and because of insecticide resistance.  In 2003, laboratory and field studies were initiated in Virginia to better understand P. xylostella, its primary natural enemies, and their susceptibilities to insecticides in order to develop an economically and environmentally sound integrated pest management program for collards in the state.  Ecological life table studies of P. xylostella immature stages on collards located on the Eastern Shore and on Kentland Farm, near Blacksburg at the New River Valley, VA revealed that most (98 to 99%) of P. xylostella died from natural causes.  Mortality factors varied between the two regions.  Neonates, small larvae, and large larvae disappearing were major mortality factors.  Rainfall, predation, and dispersal probably contributed the most to this mortality.  Egg mortality played a bigger role at the New River Valley compared with the Eastern Shore.  Three parasitoid species were found that contributed to the mortality of P. xylostella: Diadegma insulare (Cresson) (Hymenoptera: Ichneumonidae); Oomyzus sokolowskii (Kurdjumov) (Hymenoptera: Eulophidae); and Microplitis plutellae (Muesebeck) (Hymenoptera: Braconidae).  Additional studies conducted in the laboratory using leaf-dip bioassays revealed that P. xylostella collected from the Eastern Shore of Virginia, showed significant tolerance levels to esfenvalerate, acetamiprid, methomyl, methoxyfenozide, indoxacarb, and acephate compared with a susceptible strain of P. xylostella.  The highest tolerance ratio (1,876 fold) was to esfenvalerate, a commonly-used pyrethroid.  All of the insecticides tested in this study were quite toxic to the adult stage of the parasitoids, D. insulare and O. sokolowskii.  The insect growth regulator, methoxyfenozide was considerably less toxic than other insecticides such as esfenvalerate, methomyl, acephate, spinosad, indoxacarb, and emamectin benzoate at field-rate and 1% of field-rate concentrations.  The aforementioned insecticides as well as some other insecticides were evaluated several times in the field for efficacy against P. xylostella as well as other pests of collards.  The most efficacious insecticides over five field experiments included acephate, emamectin benzoate, esfenvalerate, methomyl, methoxyfenozide, novaluron, indoxacarb, and spinosad.  These insecticides were followed in relative efficacy by Bt kurstaki, acetamiprid, and azadirachtin, which provided relatively inconsistent control of lepidopteran larvae over the experiments.  Effective insecticide options in collards that are less toxic to natural enemies and that can fit well into integrated pest management programs include indoxacarb, spinosad, novaluron, emamectin benzoate, methoxyfenozide, and Bacillus thuringiensis subsp. kurstaki.",
  "description_provenance": [
    "Author Email: rcordero@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:44Z (GMT). No. of bitstreams: 2 Codero_Dissertation-title.pdf: 50157 bytes, checksum: 8c04bfd94005b68d0ec349dd3bc051c6 (MD5) Dissertation_RCordero.pdf: 852780 bytes, checksum: 38d09de0d54521c699c965164d324b7f (MD5)   Previous issue date: 2005-10-19"
  ],
  "handle": "29391",
  "identifier_other": "etd-10282005-195510",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10282005-195510/",
  "identifier_uri": "http://hdl.handle.net/10919/29391",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Codero_Dissertation-title.pdf",
    "Dissertation_RCordero.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "insecticide efficacy",
    "parasitoids",
    "Brassica oleracea",
    "Collards",
    "Plutella xylostella",
    "insecticide resistance",
    "Diadegma insulare",
    "Oomyzus sokolowskii",
    "life tables"
  ],
  "title": "Contributions toward the integrated pest management of diamondback moth, Plutella xylostella (L.), on collards in Virginia.",
  "type": "Dissertation"
}