{
  "contributor_author": "Weisenmiller, Eric Michael",
  "contributor_committeechair": "Sanders, Mark E.",
  "contributor_committeemember": [
    "Bame, E. Allen",
    "LaPorte, James E.",
    "Fortune, Jimmie C.",
    "McMillan, Gail"
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:17:46Z",
  "date_adate": "1999-11-02",
  "date_available": "2014-03-14T20:17:46Z",
  "date_issued": "1999-07-29",
  "date_rdate": "2000-11-02",
  "date_sdate": "1999-10-29",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study examined the readability of fonts. More specifically, it investigated how four different fonts effected both reading rate and reading comprehension. The typefaces Georgia, Verdana, (which, according to their designers, optimize onscreen readability) Times, and Arial (both designed for digital output to hard copy) were displayed as treatments both on a computer screen and on paper. The purpose of the study was to determine whether sans serif and serif typefaces optimized for on-screen viewing significantly improve reading rate and reading comprehension. Comparisons were made among the typefaces using a categorical independent variable postmeasure-only research design to determine the level of dependent variables (rate, comprehension). The group means of each of twelve treatment groups (N=264) were analyzed using analyses of variance to determine if either of the variables (presentation mode or font) had a statistically significant effect upon reading rate and/or reading comprehension of a sample taken from a population of subjects attending a midwestern state university. No significant difference was found among reading speed or reading comprehension scores of subjects tested who read text which was typeset in any of the four typefaces. However, significant difference was found between the presentation modes used in the experiment.  Since it was found that 8-bit on-screen text was not significanly more readable than 600dpi text on paper, and 1-bit onscreen text was found to be significantly less readable than onscreen text and 600dpi text on paper, this research concludes that for purposes of ease of readability, onscreen text is better suited to be rendered as 8-bit onscreen text than 1-bit on-screen text. Also, the findings indicate that 8-bit on-screen text was not found to be significantly less readable than 600dpi text on paper. Also, due to the various typefaces currently being used in digital typography and the differing presentation media, further exploration of the readability of on-screen text should examine more fonts and screen display variables.",
  "description_provenance": [
    "Author Email: weisenmil@indtech.it.ilstu.edu",
    "Advisor Email: abame@vt.edu",
    "Advisor Email: msanders@vt.edu",
    "Advisor Email: laporte@vt.edu",
    "Advisor Email: fortunjc@vt.edu",
    "Advisor Email: gailmac@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:46Z (GMT). No. of bitstreams: 1 WeisenmillerDissertation.pdf: 1033765 bytes, checksum: 137a25055f3afe68215e4fce13c20a87 (MD5)   Previous issue date: 1999-07-29"
  ],
  "handle": "29400",
  "identifier_other": "etd-102999-110544",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-102999-110544/",
  "identifier_uri": "http://hdl.handle.net/10919/29400",
  "publisher": "Virginia Tech",
  "relation_haspart": "WeisenmillerDissertation.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "typography",
    "readability"
  ],
  "title": "A Study of the Readability of On-Screen Type",
  "type": "Dissertation"
}