{
  "contributor_author": "Bai, Guofeng",
  "contributor_committeechair": "Lu, Guo-Quan",
  "contributor_committeemember": [
    "Corcoran, Sean Gerald",
    "van Wyk, Jacobus Daniel",
    "Reynolds, William T. Jr.",
    "Boroyevich, Dushan"
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-03-14T20:17:48Z",
  "date_adate": "2005-11-14",
  "date_available": "2014-03-14T20:17:48Z",
  "date_issued": "2005-10-21",
  "date_rdate": "2006-11-14",
  "date_sdate": "2005-10-31",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This research has developed a lead-free semiconductor device interconnect technology by studying the processing-microstructure-property relationships of low-temperature sintering of nanoscale silver pastes. The nanoscale silver pastes have been formulated by adding organic components (dispersant, binder and thinner) into nano-silver particles. The selected organic components have the nano-particle polymeric stabilization, paste processing quality adjustment, and non-densifying diffusion retarding functions and thus help the pastes sinter to ~80% bulk density at temperatures no more than 300°C. It has been found that the low-temperature sintered silver has better electrical, thermal and overall thermomechanical properties compared with the existing semiconductor device interconnecting materials such as solder alloys and conductive epoxies. After solving the organic burnout problems associated with the covered sintering, a lead-free semiconductor device interconnect technology has been designed to be compatible with the existing surface-mounting techniques with potentially low-cost. It has been found that the low-temperature sintered silver joints have high electrical, thermal, and mechanical performance. The reliability of the silver joints has also been studied by the 50-250°C thermal cycling experiment. Finally, the bonging strength drop of the silver joints has been suggested to be ductile fracture in the silver joints as micro-voids nucleated at microscale grain boundaries during the temperature cycling. The low-temperature silver sintering technology has enabled some benchmark packaging concepts and substantial advantages in future applications.",
  "description_provenance": [
    "Author Email: gbai@vt.edu",
    "Advisor Email: sgc@vt.edu",
    "Advisor Email: daan@vt.edu",
    "Advisor Email: reynolds@vt.edu",
    "Advisor Email: dushan@vt.edu",
    "Advisor Email: gqlu@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:48Z (GMT). No. of bitstreams: 1 Dissertation-GBai05.pdf: 12097291 bytes, checksum: aa0cd23a19a71281818436f50236633f (MD5)   Previous issue date: 2005-10-21"
  ],
  "handle": "29409",
  "identifier_other": "etd-10312005-163634",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10312005-163634/",
  "identifier_uri": "http://hdl.handle.net/10919/29409",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation-GBai05.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Silver joint",
    "Reliability",
    "Lead-free solution",
    "Semiconductor device interconnection",
    "Low-temperature sintering",
    "Electronic packaging",
    "Nanoscale silver paste"
  ],
  "title": "Low-Temperature Sintering of Nanoscale Silver Paste for Semiconductor Device Interconnection",
  "type": "Dissertation"
}