{
  "contributor_author": "Griffin, Ervin  Verome",
  "contributor_committeechair": "Andrew, Loyd D.",
  "contributor_committeemember": [
    "Fortune, Jimmie C.",
    "Underwood, Kenneth E.",
    "Bashore, Robert",
    "Conley, Houston",
    "Martin, Edwin P."
  ],
  "contributor_department": "Community College Education",
  "date_accessioned": "2014-03-14T20:17:47Z",
  "date_adate": "2008-10-30",
  "date_available": "2014-03-14T20:17:47Z",
  "date_issued": "1980-05-02",
  "date_rdate": "2008-10-30",
  "date_sdate": "2008-10-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "</p> <p>The purpose of this study was to investigate the amount of information that potential adult male students had on financial aid and other aspects of college programs and to develop insights concerning the effects of an information gap (if any) on enrollment decisions and the degree to which colleges in a selected area are marketing information. To obtain the data necessary to answer the research questions posed in this study, a sample of 143 respondents between the ages of 25 and 60 was selected from the city of Richmond, Virginia. The basic process utilized was area sampling techniques. In addition, stratified random sampling techniques were used to select the specific locations where the sample was to be drawn and the Hill Directory was used to gain access to that population.</p> <p> The results of discriminant analysis and stepwise regression revealed the following nine variables were significant predictors of whether or not adult males would want to go to college.</p> <p> 1. Age--More younger males (25 to 35) expressed an interest in attending college than older males (ages 40 to 60).</p> <p> 2. Level of Education--More males with previous college experience wanted to go to college than males with no college experience.</p> <p> 3. Marital Status--More single males wanted to go to college than married males.</p> <p> 4. Cost--Males interested in attending college viewed cost of education as the major obstacle more often than males not interested in attending college.</p> <p> 5. Time--More males not interested in attending college mentioned time as a problem than males interested in attending college.</p> <p> 6. Annual Income--More males with incomes above $25,000 expressed no interest in attending college than males with incomes in the $6,000-12,000 range.</p> <p> 7. Home Responsibility--More males not interested in attending college viewed home responsibility as an obstacle than males interested in attending college.</p> <p> 8. Job Responsibility--More males not interested in attending college mentioned job responsibility as a deterrent to enrollment than males interested in attending college.</p> <p> 9. Knowledge of Academic Requirements--Males not interested in attending college had more information on academic requirements than males interested in attending college.</p> <p> It was concluded that the lack of information was a problem related to the adult males' participation in higher education. Even many of those who wanted to go to college had not been motivated to the point where they had (1) enrolled or (2) even acquired information.</p> <p> This study did not attempt to determine the effect of promotion (better information) on enrollment behavior. It would be useful to conduct such a study. It is recommended that further research be conducted to test the effects of various marketing and promotional techniques. Practice in the marketing of higher education would also profit from studies on \"what were the factors that cause adults to make enrollment decisions\" and \"appropriate strategies for preparing an institution to pursue a new market.\" </p> <p>",
  "description_provenance": "Made available in DSpace on 2014-03-14T20:17:47Z (GMT). No. of bitstreams: 1 LD5655.V856_1980.G753.pdf: 4665891 bytes, checksum: cd0152a61d2dfad75dd63792331adc87 (MD5)   Previous issue date: 1980-05-02",
  "format_medium": "BTD",
  "handle": "29405",
  "identifier_other": "etd-10302008-120432",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10302008-120432/",
  "identifier_uri": "http://hdl.handle.net/10919/29405",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.V856_1980.G753.pdf",
  "subject": "Student loans",
  "subject_lcc": "LD5655.V856 1980.G753",
  "title": "The effect of price on the higher education aspirations of adult males :is there an information gap?",
  "type": "Dissertation"
}