{
  "contributor_author": "Whitt, Gary L.",
  "contributor_committeechair": "Burton, John K.",
  "contributor_committeemember": [
    "Holmes, Glen A.",
    "Teates, Thomas G.",
    "Moore, David Michael",
    "Sherman, Gregory P."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:17:47Z",
  "date_adate": "2000-10-30",
  "date_available": "2014-03-14T20:17:47Z",
  "date_issued": "2000-10-24",
  "date_rdate": "2001-10-30",
  "date_sdate": "2000-10-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The Effects of Speech Cues on Long-term Memory Gary Whitt (ABSTRACT)  This research examines a possible relationship between intentional memory and possible phonologic cues in the human voice. Specifically, if someone has told us something in the past, does hearing that same voice at the time of recall affect our ability to remember what was said?  Also, if voice cues do affect memory, is the effect voice-specific?  Since most standardized assessments of student learning and tests of human memory rest their conclusions about human learning solely on non-aural tests, it is necessary to determine if student performance changes with test modality.  Via a computer program, ninety-five adults each listened to a male voice read a one-minute story and were then randomly assigned to take one of three different tests consisting of multiple-choice and fill-in-the-blank items. In the first test, the male voice from the story read all questions and possible answers. The second test used a different male voice to read while the third test was text-only. All tests contained identical content and gave single-modality cues only, text or speech.  Results show no significant difference in long-term recall or recognition with respect to test-modality. Further research in this area is encouraged to determine if conclusions are generalizable to wider populations and hold for longer memory intervals.",
  "description_provenance": [
    "Author Email: gwhitt@vt.edu",
    "Advisor Email: gholmes@vt.edu",
    "Advisor Email: teates@vt.edu",
    "Advisor Email: jburton@vt.edu",
    "Advisor Email: moorem@vt.edu",
    "Advisor Email: shermang@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:47Z (GMT). No. of bitstreams: 2 Vitae.pdf: 14002 bytes, checksum: 32eb9e1a9e5e5dee51a8ab4953fd38d6 (MD5) Whitt.pdf: 261565 bytes, checksum: 2101cda924c16e7faa6f209b3d46866e (MD5)   Previous issue date: 2000-10-24"
  ],
  "handle": "29401",
  "identifier_other": "etd-10302000-14070023",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10302000-14070023/",
  "identifier_uri": "http://hdl.handle.net/10919/29401",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Vitae.pdf",
    "Whitt.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "multi-modal assessment",
    "speech cues",
    "speech",
    "context dependent memory"
  ],
  "title": "The Effects of Speech Cues on Long-term Memory",
  "type": "Dissertation"
}