{
  "contributor_author": "Boggess, Kendra  Stahle Jr.",
  "contributor_committeechair": "Schmidt, B. June",
  "contributor_committeemember": [
    "Stewart, Daisy L.",
    "Schnitzer, Martin C.",
    "Asselin, Susan B.",
    "Finch, Curtis R."
  ],
  "contributor_department": "Vocational and Technical Education",
  "date_accessioned": "2014-03-14T20:17:48Z",
  "date_adate": "1997-12-12",
  "date_available": "2014-03-14T20:17:48Z",
  "date_issued": "1997-10-13",
  "date_rdate": "2012-05-14",
  "date_sdate": "1997-10-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study compared Japanese and US students' intended beliefs and behaviors relating   to ethical business decisions.  The study assessed the extent to which three of Hofstede's   (1984) cultural indexes related to three ethical classifications of Vitell, Nwachukwu,   and Barnes (1993).  Participants were 79 US and 33 Japanese students attending West   Virginia colleges and universities, representing a response rate of 30.7%.  <p> A set of six vignettes were written to portray subtly unethical business situations.   The vignettes were reviewed by two expert panels, and pilot tested on students similar   to those participating in the study. Quantitative techniques were used to analyze survey   results.  Some moderate correlations were found when determining the nature and degree   of relationships among Belief and Behavior scores.  A chi square analysis was used to   determine significant differences between US and Japanese students' demographic   characteristics.  Means and standards deviations revealed higher scores for Japanese   students on all measures for Belief and Behavior questions.  These scores indicated   that they believed each vignette portrayed a more ethical situation, and that they would   more likely engage in such behavior than would US students.  ANOVAs were used to examine   differences between Japanese and US students' responses to the vignettes, revealing   significant differences between groups, but not as Hofstede's dimensions   predicted. <p>  Findings on Hofstede's (1984) Individualism versus Collectivism dimension indicate that   the theory that members of Japanese cultures will be more willing to work for   organizational than personal gain, may not be true, particularly for students.    Hofstede's Uncertainty Avoidance dimension, suggesting that members of the Japanese   culture will be less comfortable with uncertainty than will members of the US culture,   was not supported either.  Finally, Hofstede's Masculinity/Femininity dimension,   theorizing that members of the Japanese culture are more comfortable with traditional   masculine values, was supported.   <p>  The major finding of this study is that present-day students did not react to Hofstede's   assumptions as expected.  Use of different subject groups than Hofstede's and the span of   thirty years between his study and this one may have impacted the outcomes.  Educators   and members of the business community involved with training may find the results of   this study helpful.  The findings encourage educators and trainers to avoid stereotyping   learners' abilities based upon culture or the specifications of cultural typology models.",
  "description_provenance": [
    "Author Email: cna00035@wvnvm.wvnet.edu",
    "Advisor Email: schmidtj@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:48Z (GMT). No. of bitstreams: 8 BACK122.PDF: 181015 bytes, checksum: 0d90a8780fc6f3f38d8eac63f842a957 (MD5) CH1122.PDF: 57872 bytes, checksum: 38d4557cfc23642155a08ac1e5716fd6 (MD5) CH2122.PDF: 66142 bytes, checksum: 93fbc4c7493611fc12a37cb875c066bd (MD5) CH3122.PDF: 95413 bytes, checksum: 4a940c4362b42be1a59ffdb21e134fb2 (MD5) CH4122.PDF: 140884 bytes, checksum: 3e261989be77d98abbff7c063743396b (MD5) CH5122.PDF: 34425 bytes, checksum: 128b6fa523e97cef51fbfd0eacd0111d (MD5) ETD122.PDF: 36321 bytes, checksum: d06a0e217ceee4af7505c54d4faf44ef (MD5) vita122.pdf: 11710 bytes, checksum: 4bf16aee4d476e12dee45b8266ee5c17 (MD5)   Previous issue date: 1997-10-13"
  ],
  "handle": "29408",
  "identifier_other": "etd-103097-203418",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-103097-203418/",
  "identifier_uri": "http://hdl.handle.net/10919/29408",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "BACK122.PDF",
    "CH1122.PDF",
    "CH2122.PDF",
    "CH3122.PDF",
    "CH4122.PDF",
    "CH5122.PDF",
    "ETD122.PDF",
    "vita122.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Business Ethics",
    "Cultural typology models",
    "Cultural Beliefs",
    "Cultural Behaviors",
    "Vignettes"
  ],
  "title": "Ethical Issues in Business Communication: A Comparative Study of the Perceptions of Japanese and US Students",
  "type": "Dissertation"
}