{
  "contributor_author": "Scott, David Andrew",
  "contributor_committeechair": "Burger, James A.",
  "contributor_committeemember": [
    "Alley, Marcus M.",
    "Wolfe, Mary Leigh",
    "Kaczmarek, Donald J.",
    "Aust, Wallace Michael",
    "Pu, Mou"
  ],
  "contributor_department": "Forestry",
  "date_accessioned": "2014-03-14T20:17:47Z",
  "date_adate": "2002-10-30",
  "date_available": "2014-03-14T20:17:47Z",
  "date_issued": "2002-10-25",
  "date_rdate": "2003-10-30",
  "date_sdate": "2002-10-30",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Short-rotation woody crops are becoming important supplies of hardwood fiber, but little is known about the early nutritional needs of these systems, especially on different site types. The study objectives were, on two young (ages 3-6) sweetgum plantations with contrasting soil types, to 1) determine the plant growth and foliar nutrition response to repeated nitrogen (N) fertilizer applications, 2) determine soil N supply, plant N demand, foliar N resorption, and soil and fertilizer uptake efficiencies, and 3) test a simple N supply model. In order to expand the findings to the range of sweetgum site types, the study objectives were also to 4) evaluate rapid methods for determining N mineralization potential, 5) characterize the soils of 14 sweetgum site types in the Atlantic coastal plain, and 6) review current N fertilizer prescriptions in forestry and recommend strategies for improvement. Two young sweetgum (Liquidambar styraciflua L.) plantations on a converted agricultural field and a pine cutover site in South Carolina were fertilized biannually with three rates of N fertilizer (0, 56, 112 kg N per ha). Fertilization doubled foliar biomass and leaf area on the cutover pine site in the years fertilizer was applied, and stem biomass increased 60%. Critical values, the N concentration required for 90% of optimum growth, is approximately 1.75%. Foliar N uptake increased at both sites when fertilizer was applied. Modeled annual soil N supply was within 20% of that measured on the two plantations even though monthly N supply was not accurately estimated. Potential N mineralization was accurately estimated with a 3-day incubation of rewetted soils that were previously dried, but not by hot salt extraction or anaerobic incubation. Across a spectrum of 14 sweetgum sites, the agricultural fields had lower mineralizable nitrogen (126 kg per ha) than the cutover sites (363 kg per ha). Current N fertilizer prescriptions are not sufficient for repeated fertilizer applications to fast-growing hardwood plantations, but simple models of soil N supply and an N-balance approach may improve prescriptions.",
  "description_provenance": [
    "Author Email: andyscott@fs.fed.us",
    "Advisor Email: malley@vt.edu",
    "Advisor Email: jaburger@vt.edu",
    "Advisor Email: mlwolfe@vt.edu",
    "Advisor Email: waust@vt.edu",
    "Advisor Email: ppmou@uncg.edu",
    "Made available in DSpace on 2014-03-14T20:17:47Z (GMT). No. of bitstreams: 1 Scott_Dissertation.pdf: 799887 bytes, checksum: 1c75ae42c2bae1128dab0c1a6a0e96a6 (MD5)   Previous issue date: 2002-10-25"
  ],
  "handle": "29402",
  "identifier_other": "etd-10302002-115845",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10302002-115845/",
  "identifier_uri": "http://hdl.handle.net/10919/29402",
  "publisher": "Virginia Tech",
  "relation_haspart": "Scott_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "sweetgum",
    "nitrogen fertilization",
    "hardwood plantations",
    "nitrogen balance"
  ],
  "title": "Estimating Soil Nitrogen Supply and Fertilizer Needs for Short-Rotation Woody Crops",
  "type": "Dissertation"
}