{
  "contributor_author": "Khan, Memuna Zareen",
  "contributor_committeechair": "Walters, Jeffrey R.",
  "contributor_committeemember": [
    "McNabb, F. M. Anne",
    "Jenssen, Thomas A.",
    "Andrews, Robin M.",
    "Schoech, Stephan J."
  ],
  "contributor_department": "Biology",
  "date_accessioned": "2014-03-14T20:17:48Z",
  "date_adate": "1999-11-18",
  "date_available": "2014-03-14T20:17:48Z",
  "date_issued": "1999-08-20",
  "date_rdate": "2000-11-18",
  "date_sdate": "1999-10-31",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "One unresolved issue in the study of cooperative breeding is why individuals that delay their own reproduction assist others in raising young.  Red-cockaded woodpecker helpers may again future indirect fitness benefits by increasing survival of breeders, who produce offspring related to the helper in the future.  Breeder survival may be enhanced because of general benefits of group living, either because of the helper's own presence or because helping increases the production of fledglings.  I demonstrate that breeder survival increases in the presence of helpers and additional young.  Helpers may also reduce the workload of the breeder, and this may increase breeder survival as well.  I show that breeders spend less time incubating and provisioning young when a helper is present.   Helpers may also gain fitness benefits if once they become breeders, they are assisted by young they previously helped raise.  Expected frequencies of reciprocal exchange of helping are low (2%).  Slightly higher observed frequencies may be accounted for by preferential helping of kin and effects of territory quality.  Reciprocity occurs no more often than expected among helpers unrelated to the young they help raise suggesting that young males do not preferentially helper former care-givers.  i conclude that helpers do not gain fitness benefits from reciprocity.  \tI examined the proximate causes of delayed breeding and helping behavior by measuring plasma testosterone (T) and prolactin (PRL) concentrations in female breeders, male breeders, and male helpers during different stages of the reproductive cycle.  Among male breeders and helpers, T is low during the nonbreeding stage, peaks during copulation and declines during the incubation and nestling-provisioning stages.  Helpers appear physiologically capable of reproducing:  their T concentrations are equal those of breeders.  Helpers unrelated to the breeding female have higher T than helper related to her.  Sexual inactivity by male helpers is best explained by behavioral suppression.  Female breeder, male breeder, and male helper PRL was  equal and increased from the nonbreeding stage through the copulation and incubation stages.  During the nestling provisioning stage, male breeder and male helper PRL declined, while female PRL continued to increase.  I conclude that the physiological bases of helping behavior and parental behavior are the same.",
  "description_provenance": [
    "Author Email: mkhan@princeton.edu",
    "Advisor Email: happy@vt.edu",
    "Advisor Email: tjenssen@vt.edu",
    "Advisor Email: randrews@vt.edu",
    "Advisor Email: jrwalt@vt.edu",
    "Advisor Email: sschoech@indiana.edu",
    "Made available in DSpace on 2014-03-14T20:17:48Z (GMT). No. of bitstreams: 1 mzkhandiss.pdf: 564923 bytes, checksum: 0e53837d081f4e9a2d497073e5dcccca (MD5)   Previous issue date: 1999-08-20"
  ],
  "handle": "29413",
  "identifier_other": "etd-103199-194729",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-103199-194729/",
  "identifier_uri": "http://hdl.handle.net/10919/29413",
  "publisher": "Virginia Tech",
  "relation_haspart": "mzkhandiss.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "cooperative breeding",
    "Picoides borealis",
    "prolactin",
    "red-cockaded woodpecker",
    "testosterone",
    "helping behavior"
  ],
  "title": "Ultimate and Proximate Explanations of Helping Behavior in the Red-cockaded Woodpecker (Picoides borealis)",
  "type": "Dissertation"
}