{
  "contributor_author": "Thongsamak, Sasima",
  "contributor_committeechair": "Kleiner, Brian M.",
  "contributor_committeemember": [
    "Koelling, Charles Patrick",
    "Scales, Glenda Rose",
    "Smith-Jackson, Tonya L.",
    "Van Aken, Eileen M.",
    "Wakefield, Ronald R."
  ],
  "contributor_department": "Industrial and Systems Engineering",
  "date_accessioned": "2014-03-14T20:17:48Z",
  "date_adate": "2007-11-07",
  "date_available": "2014-03-14T20:17:48Z",
  "date_issued": "2007-09-04",
  "date_rdate": "2007-11-07",
  "date_sdate": "2007-10-31",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The overall research objective was to identify the effects of reward systems (rewards and a penalty) on risk-taking behavior and performance (quality and time) of construction workers from different cultures (American, Asian, and Latin American cultures).  This research used the sociotechnical system as the underlying, guiding scientific framework.  The research found that Americans and Latin Americans had higher risk-taking behavior than Asians (p<0.01).  No difference in risk-taking behavior was found between Americans and Latin Americans (p<0.05).  Although culture may influence individualsâ   risk-taking behavior, the results from this study showed that risk-taking behavior could be altered and suppressed by providing individuals with the proper safety training, education, and safety equipment.  Customized safety training for people from different cultures would be useful because the culture elements that contribute to high risk-taking behavior could be addressed.  The results also showed that the effects of reward systems on risk-taking behavior were not statistically significant (p>0.1).  One possibility that no difference was found may be because the tasks used in this study did not contain enough possibility for participants to take more risk.   The effects of reward systems on risk-taking behavior may have been reduced by the low possibility of risky behavior.  It is suspected that if the tasks contained more opportunities for participants to take risk, differences in risk-taking behavior would have been significant. \tThe researcher concluded that risk perception is situation-specific and has an influence on the individualâ  s risk-taking behavior on that particular situation but cannot be used to predict risk-taking behavior.  Also, general locus of control and general self-efficacy cannot be used to predict risk-taking behaviors.  These findings are consistent with many studies that explore locus of control (Iversen & Rundmo, 2002; Rolison & Scherman 2002; Crisp & Barber, 1995), and many researchers that suggested self-efficacy is situation specific (Murdock et al., 2005; Martin et al., 1995; Perraud, 2000; Slanger & Rudestam, 1997).  This study also found no relationship between risk-taking behavior and productivity, for both time and quality.",
  "description_provenance": [
    "Author Email: sasima@vt.edu",
    "Advisor Email: bkleiner@vt.edu",
    "Advisor Email: koelling@vt.edu",
    "Advisor Email: gscales@vt.edu",
    "Advisor Email: smithjac@vt.edu",
    "Advisor Email: evanaken@vt.edu",
    "Advisor Email: ron.wakefield@rmit.edu.au",
    "Made available in DSpace on 2014-03-14T20:17:48Z (GMT). No. of bitstreams: 1 SasimaDissertation.pdf: 1251043 bytes, checksum: 7e106b3923d354df4cf21a640e88a020 (MD5)   Previous issue date: 2007-09-04"
  ],
  "handle": "29410",
  "identifier_other": "etd-10312007-234714",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10312007-234714/",
  "identifier_uri": "http://hdl.handle.net/10919/29410",
  "publisher": "Virginia Tech",
  "relation_haspart": "SasimaDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Latin American",
    "Culture",
    "American",
    "Asian",
    "Construction Risk-Taking Behavior",
    "Cross-Cultural",
    "Reward System",
    "Risk"
  ],
  "title": "A Cross-Cultural Examination: Effects of Reward Systems and Cultures on Low Severity Risk-Taking Behavior in Construction",
  "type": "Dissertation"
}