{
  "contributor_author": "Reio, Thomas G. Jr.",
  "contributor_committeechair": "Wiswell, Albert K.",
  "contributor_committeemember": [
    "Belli, Gabriella M.",
    "Eliot, John",
    "McKeen, Ronald L.",
    "Stubblefield, Harold W."
  ],
  "contributor_department": "Adult and Continuing Education",
  "date_accessioned": "2014-03-14T20:17:49Z",
  "date_adate": "1997-04-02",
  "date_available": "2014-03-14T20:17:49Z",
  "date_issued": "1997-04-02",
  "date_rdate": "1997-04-02",
  "date_sdate": "1998-07-21",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Although the significance of curiosity in motivating and directing learning has received substantial scholarly support, little information exists about curiosity's importance in adult learning. The purpose of this study was to investigate curiosity's possible relevance in an adult learning context, the workplace. Specifically, this study was an examination of adult curiosity's relationship to socialization-related learning, and ultimately job performance.   Four curiosity instruments (the Novelty Experiencing Scale; State-Trait Personality Inventory; Melbourne Curiosity Inventory; and the Sensation Seeking Scale), one socialization-related learning questionnaire (Workplace Adaptation Questionnaire), and one job performance instrument (developed to assess technical and interpersonal job performance) were administered in four service-industry organizations. Demographic data were also collected and the final sample included 233 employees.   Two-, three-, and four-factor curiosity models were examined to clarify the nature of the curiosity construct. Curiosity factor scores were subsequently used as independent  variables in multiple regression equations to assess their research utility. Three a priori determined, recursive path models suggesting a causal influence of curiosity on socialization-related learning and job performance were tested as well. Standardized partial regression coefficients were calculated from a combination of the correlational matrix containing the three main study variables (curiosity, socialization-related      learning, and job performance), and their standard deviations, using the EQS for Windows 5.4 routine.   Multiple loadings of several of the curiosity subscales on the curiosity factors indicate a conceptual overlap between the Sensation Seeking and Venturesomeness curiosity factors;   thus, the nature of curiosity may be best represented by a Cognitive Curiosity and Sensation Seeking factor interpretation. The findings also suggest that the two-factor curiosity model may have had the best research utility for the purposes of this study. The three- and four-factor curiosity solutions did not explain a significant amount of      additional variance in the multiple regression models predicting socialization-related learning and job performance.   Results suggest, too, that curiosity has both a direct and an indirect causal influence on job performance. This research indicates that curiosity or the desire for information has a weak but significant direct effect on total job performance, and its effect on total job performance can also be mediated by the learning associated with the socialization process. When examining curiosity's effect on the two separate job performance dimensions, i.e., technical and interpersonal, curiosity's only significant effect on both job performance dimensions was mediated through the socialization-related learning variable.   Overall, this study's findings suggest support for adult curiosity as being relevant in the socialization process and in job performance as well.",
  "description_provenance": "Made available in DSpace on 2014-03-14T20:17:49Z (GMT). No. of bitstreams: 1  diss.pdf: 352534 bytes, checksum: 51f3ab02c1101d6a9dc4449caff3da66 (MD5)    Previous issue date: 1997-04-02",
  "handle": "29416",
  "identifier_other": "etd-109161439711031",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-109161439711031/",
  "identifier_uri": "http://hdl.handle.net/10919/29416",
  "publisher": "Virginia Tech",
  "relation_haspart": "diss.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "intrinsic motivation",
    "job performance",
    "socialization",
    "adult learning",
    "curiosity"
  ],
  "subject_lcc": "LD5655.V856 1997.R456",
  "title": "Effects Of Curiosity On Socialization-Related Learning And Job Performance In Adults",
  "type": "Dissertation"
}