{
  "contributor_author": "Bonita, John Anthony",
  "contributor_committeecochair": [
    "Mitchell, James K.",
    "Brandon, Thomas L."
  ],
  "contributor_committeemember": [
    "Mayne, Paul W.",
    "Haycocks, Christopher",
    "Martin, James R. II"
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:17:49Z",
  "date_adate": "2000-11-07",
  "date_available": "2014-03-14T20:17:49Z",
  "date_issued": "2000-07-28",
  "date_rdate": "2001-11-07",
  "date_sdate": "2000-11-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The current approach for using cone penetration test data to estimate soil behavior during seismic loading involves the comparison of the seismic stresses imparted into a soil mass during an earthquake to the penetration resistance measured during an in-situ test.  The approach involves an indirect empirical correlation of soil density and other soil related parameters to the behavior of the soil during the loading and does not involve a direct measurement of the dynamic behavior of the soil in-situ.  The objective of this research was to develop an approach for evaluating the in-situ behavior of soil during dynamic loading directly through the use of a vibrating piezocone penetrometer.    Cone penetration tests were performed in a large calibration chamber in saturated sand samples prepared at different densities and stress levels.  A total of 118 tests were performed as part of the study.  The piezocone penetrometer used in the investigation was subjected to a vibratory load during the penetration test.  The vibratory units used in the investigations were mounted on top of a 1m section of drill rod that was attached at the lower end to the cone penetrometer.  Pneumatic impact, rotary turbine, and counter rotating mass vibrators were used in the investigation.  The vibration properties generated by the vibratory unit and imparted into the soil were measured during the penetration test by a series of load cells and accelerometers mounted below the vibrator and above the cone penetrometer, respectively.  The tip resistance, sleeve friction and pore water pressure were also measured during the test by load cells and transducers in the cone itself.    The vibration and cone data were compiled and compared to evaluate the effect of the vibration on the penetration resistance and pore water pressure in the soil mass. The results of the testing revealed that the influence of the vibration on the penetration resistance value decreased as the density and the mean effective stress in the soil increased, mainly because the pore water pressure was not significantly elevated throughout the entire zone of influence of the cone penetometer at the elevated stress and density conditions.  An analysis of the soil response during the testing resulted in the generation of a family of curves that relates the soil response during the vibratory and static penetration to the vertical effective stress and density of the soil.  The data used to generate the curves seem to agree with the proposed values estimated through the empirical relationship.  An evaluation of the effects of the frequency of vibration was also performed as part of the study.  The largest reduction in penetration resistance occurred when the input vibration approximated the natural frequency of the soil deposit, suggesting that resonance conditions existed between the input motion and the soil.  An energy-based approach was developed to compare the energy imparted into the soil by the vibrator to the energy capacity of the soil.  The input energy introduced into the soil mass prior to the reduction in penetration resistance agrees well with the energy capacity of the soil, especially in tests at the low effective stress level where a high excess pore water pressure was observed.",
  "description_provenance": [
    "Author Email: jbonita@schnabel-eng.com",
    "Advisor Email: jkm@vt.edu",
    "Advisor Email: paul.mayne@ce.gatech.edu",
    "Advisor Email: tbrandon@vt.edu",
    "Advisor Email: algy@vt.edu",
    "Advisor Email: jrm@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:49Z (GMT). No. of bitstreams: 21 01Introduction.pdf: 44202 bytes, checksum: c334ed97c05c7b13c37f6bccbca5bf16 (MD5) 19Appendix_B.pdf: 21352 bytes, checksum: a53a2de50d4283c72ac903587c7d16f5 (MD5) 05Chapter_2_Figures.pdf: 236538 bytes, checksum: 7124f19718f92c9fde6ac1d9ce6fb172 (MD5) 04Chapter_2.pdf: 141898 bytes, checksum: ea97edaf8bf93dc46a7bfceac1dbf0d0 (MD5) 13Chapter_5_Tables.pdf: 76171 bytes, checksum: f18124b849e9bb886067c4d533ce7227 (MD5) 09Chapter_4.pdf: 37501 bytes, checksum: 38e1fd4e051230014e3aa7fc5b7e5688 (MD5) 16Chapter_7.pdf: 27077 bytes, checksum: 899aca271b80f21239182c9b281ca25a (MD5) 14Chapter_6.pdf: 78295 bytes, checksum: 8e0cd919911a2b7d16d3f017a623b560 (MD5) 10Chapter_4_Figures.pdf: 1515333 bytes, checksum: 21321866740dd7bd2c50d41fb9c8f056 (MD5) 20Appendix_C.pdf: 81797 bytes, checksum: 3115905fba9ae81de824fc7aef9d626b (MD5) 18Appendix_A.pdf: 102708 bytes, checksum: 486560f60d34705699d853c4412820b8 (MD5) 17References.pdf: 38065 bytes, checksum: 9cb9f45ef2cb3fb6fae5c08939b8a827 (MD5) 12Chapter_5_Figures.pdf: 1789990 bytes, checksum: 9da7b56fb88cde15e7f89c546f366509 (MD5) 15Chapter_6_Figures.pdf: 402221 bytes, checksum: b79e2c0361f3728c9c4d32f8349af867 (MD5) 07Chapter_3_Figures.pdf: 821861 bytes, checksum: ca5f91ffe3101725e1f86019755684e3 (MD5) 06Chapter_3.pdf: 80649 bytes, checksum: ab995f57958678e586cb6ff21f4a28bd (MD5) 03Chapter_1_Figures.pdf: 13986 bytes, checksum: 5bb713d9bba99ebf6b0cb586131b0907 (MD5) 02Chapter_1.pdf: 24024 bytes, checksum: 60fa4e64ada04a0071aa28e95bc4d274 (MD5) 08Chapter_3_Tables.pdf: 16026 bytes, checksum: 23de90942b567b0625c4dfc94b0af1ae (MD5) 21Vita.pdf: 4514 bytes, checksum: 58e2ee903d643cc6950fc7f8700bb779 (MD5) 11Chapter_5.pdf: 169126 bytes, checksum: b1e5bf4c8365b0c939e4a11382373b9f (MD5)   Previous issue date: 2000-07-28"
  ],
  "handle": "29417",
  "identifier_other": "etd-11012000-08130056",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11012000-08130056/",
  "identifier_uri": "http://hdl.handle.net/10919/29417",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "01Introduction.pdf",
    "19Appendix_B.pdf",
    "05Chapter_2_Figures.pdf",
    "04Chapter_2.pdf",
    "13Chapter_5_Tables.pdf",
    "09Chapter_4.pdf",
    "16Chapter_7.pdf",
    "14Chapter_6.pdf",
    "10Chapter_4_Figures.pdf",
    "20Appendix_C.pdf",
    "18Appendix_A.pdf",
    "17References.pdf",
    "12Chapter_5_Figures.pdf",
    "15Chapter_6_Figures.pdf",
    "07Chapter_3_Figures.pdf",
    "06Chapter_3.pdf",
    "03Chapter_1_Figures.pdf",
    "02Chapter_1.pdf",
    "08Chapter_3_Tables.pdf",
    "21Vita.pdf",
    "11Chapter_5.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Pore Water Pressure",
    "Soil Dynamics",
    "Liquefaction",
    "Cone Penetration Testing",
    "Vibration"
  ],
  "title": "The Effects of Vibration on the Penetration Resistance and Pore Water Pressure in Sands",
  "type": "Dissertation"
}