{
  "contributor_author": "Smith, Myra Kay Davis",
  "contributor_committeechair": "McGrady, Harold J.",
  "contributor_committeemember": [
    "Devitt, Patricia A.",
    "Salmon, Richard G.",
    "Fortune, Jimmie C.",
    "Parks, David J."
  ],
  "contributor_department": "Administration and Supervision of Special Education",
  "date_accessioned": "2014-03-14T20:17:49Z",
  "date_adate": "1997-11-06",
  "date_available": "2014-03-14T20:17:49Z",
  "date_issued": "1997-07-28",
  "date_rdate": "1997-11-06",
  "date_sdate": "1997-07-28",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "TO BILL OR NOT TO BILL: MEDICAID BILLING FOR SPECIAL EDUCATION  RELATED SERVICES IN ARKANSAS PUBLIC SCHOOLS <p>  Myra Kay Davis Smith  <p>  (ABSTRACT)  <p>  Medicaid is a complicated system for educators to access.  LEAs can access Medicaid funds by: billing through a contracted service, establishing their own billing system, or may choose not billing Medicaid.  The purpose of this study was to investigate the Medicaid billing processes used in Arkansas public schools.  The study considers processes some LEAs use to bill Medicaid for related services, and reasons why other LEAs do not access Medicaid.  <p> \t All LEA supervisors of special education in the state of Arkansas were sent a survey regarding Medicaid billing practices.  A total of 87 supervisors responded to all or part of the survey (80%).  The survey included three major parts.  All supervisors were asked to complete the first section, which asked demographic information.  Supervisors who currently bill Medicaid were asked to respond to the second section of the questionnaire, which sought information about the billing process.  The third section of the survey was completed by supervisors of nonbilling LEAs.  These supervisors were asked to rate a series of possible reasons LEAs do not bill as each pertained to their decision.  They were also asked to list and rate any other reasons why they do not bill Medicaid. <p> The respondents worked in systems where attendances usually ranged between 500 and 5,000 students with 106-525 of those students receiving special education. <p>   Most school systems in the sample have participated in Medicaid billing (80%).  Most (76%) prefer billing Medicaid directly rather than using a billing service.  Ninety-seven percent bill Medicaid for speech therapy, 72% for occupational therapy, and 79% for physical therapy.  In addition, 31% bill Medicaid for Early Periodic Screening Diagnosis and Treatment (EPSDT). <p> The data suggest that the billing procedures can be incorporated with relative ease into a clerical/secretarial assignment, taking less than four hours per week to transact.  Various technologies were utilized for processing, but the most popular was the AEVCS machine.  <p> Almost half of the supervisors billing Medicaid experienced problems with other agencies.  Suggestions for improvements fell into four categories.  These were providing ongoing training for billing districts, simplifying billing requirements and paperwork, improving the software used to submit information, and dealing with DHS and Medicaid agency representatives.  For the LEAs responding to the survey, total Medicaid reimbursement was $2,237,006.55.  This is 78% of the statewide total. <p> Nonbilling districts indicated that the complexity of the billing process, and personnel factors were reasons they decided against seeking Medicaid reimbursement. <p> The findings of the study lead to recommendations for access to billing information, training, and communication with others involved in the process.",
  "description_provenance": [
    "Author Email: tksmith@memphisonline.com",
    "Advisor Email: HMcgrady@aol.com",
    "Made available in DSpace on 2014-03-14T20:17:49Z (GMT). No. of bitstreams: 2 Chapters123.PDF: 67646 bytes, checksum: f0e4ac8203f0acfa8989d92c35eb5fa9 (MD5) Chapter4.PDF: 114398 bytes, checksum: 9886f3606752b95c987e0688ad81b9c5 (MD5)   Previous issue date: 1997-07-28"
  ],
  "handle": "29415",
  "identifier_other": "etd-10597-19102",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-10597-19102/",
  "identifier_uri": "http://hdl.handle.net/10919/29415",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Chapters123.PDF",
    "Chapter4.PDF"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Arkansas",
    "Special Education",
    "Related Services",
    "Medicaid"
  ],
  "title": "To Bill or Not to Bill:  Medicaid Billing for Special Education Related Services in Arkansas Public Schools",
  "type": "Dissertation"
}