{
  "contributor_author": "Edwards, Jeanne Denise",
  "contributor_committeechair": "Parks, David J.",
  "contributor_committeemember": [
    "Harris, Larry A.",
    "Parson, Stephen R.",
    "Niles, Jerome A.",
    "Cutlip, Bobbi J."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:17:51Z",
  "date_adate": "1998-08-11",
  "date_available": "2014-03-14T20:17:51Z",
  "date_issued": "1998-11-18",
  "date_rdate": "1999-08-11",
  "date_sdate": "1998-11-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The need for giving all stakeholders a greater voice in schools is well documented in the school reform and change literature of the eighties and nineties. Many schools across the United States have attempted to implement numerous plans to increase involvement with varying degrees of success. This case study describes how involvement has developed for administrators, teachers, staff, families, students, and community members in one high involvement elementary school.  A list of characteristics of high involvement was developed from the current literature to aid in the identification and selection of a high involvement school site for the study. Potential sites were nominated by the Virginia Department of Education Field Representative serving Southwest Virginia. Directors of instruction or elementary supervisors in the nominated districts were contacted and asked to name high involvement schools in their divisions. Three schools were selected for site visits based on the convergence of the nominations. The school having the highest number of characteristics observed or mentioned during the site visits was selected for the study.  Interviews were conducted with administrators, teachers, parents, students, and community members to gain an understanding of how involvement developed at the school. One week was spent interviewing, observing involvement activities, and studying available documents on site.  Data from the study were used to describe how involvement developed at the school. Ten themes relevant to the development of high involvement at the school are identified and discussed. Findings are examined in relation to school culture, leadership, and schools as organizations. Implications for practice and further research are suggested.",
  "description_provenance": [
    "Author Email: jedwards@tcia.net",
    "Advisor Email: lharris@vt.edu",
    "Advisor Email: parson@vt.edu",
    "Advisor Email: niles@vt.edu",
    "Advisor Email: parks@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:51Z (GMT). No. of bitstreams: 1 etd.pdf: 477596 bytes, checksum: cdd66fbd76481d10b9ab6db10911fce9 (MD5)   Previous issue date: 1998-11-18"
  ],
  "handle": "29429",
  "identifier_other": "etd-110198-202025",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-110198-202025/",
  "identifier_uri": "http://hdl.handle.net/10919/29429",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "high involvement",
    "leadership",
    "elementary school",
    "participation"
  ],
  "title": "Toward Democracy:  A Case Study of High Involvement in One Elementary School",
  "type": "Dissertation"
}