{
  "contributor_author": "Warner, Jane Moss",
  "contributor_committeechair": "Crockett, Jean B.",
  "contributor_committeemember": [
    "Sughrue, Jennifer A.",
    "Asselin, Susan B.",
    "Reilly, Virginia J.",
    "Spencer, Edward F. D."
  ],
  "contributor_department": "Administration and Supervision of Special Education",
  "date_accessioned": "2014-03-14T20:17:50Z",
  "date_adate": "2004-11-01",
  "date_available": "2014-03-14T20:17:50Z",
  "date_issued": "2004-10-25",
  "date_rdate": "2004-11-01",
  "date_sdate": "2004-11-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "<html> <head> <title>Jane Warner's Dissertation</title> <meta http-equiv=\"Content-Type\" content=\"text/html; charset=iso-8859-1\"> </head>  <body> <p>In the current education environment, students with disabilities may lack adequate transition planning in high school that may explain why these students often experience poor outcomes in higher education. The <em>College Bound </em><em> Summer Program </em> was developed in 1999 as a supplement program within the state of Virginia to address transition issues and college success strategies for students with disabilities planning to attend college. The purpose of this qualitative study was to identify and assess the strengths and needs of <em>College Bound </em>. The intent of the evaluation is to provide data to guide the continuing development and improvement of the program. An adaptation of Schalock's (2001) outcome based evaluation model is utilized to provide a practical, problem-solving approach to gauge the quality and effectiveness of the program and to establish whether the program has produced its desired outcomes for participants. Sources of data included (a) interviews with 26 participants who attended the program in 1999, 2000, and 2001; and (b) extant documentation regarding program implementation. Data were analyzed qualitatively using constant comparative methods to derive findings that addressed eight categories related to <em>College Bound's </em>strengths and needs: (a) Learning Outcomes, (b) Experiencing On-Campus Living, (c) Attending Workshops, (d) Facilitating Personal Networks, (e) Marketing the Program, (f) Assessing Satisfaction, (g) Gathering Transition Information, and (h) Offering Suggestions. Findings from this evaluation suggest that the draw of <em>College Bound </em>for participants is concern regarding disability challenges in higher education. The data suggest that both parents and students are anxious about attending college and meeting the challenges of the collegiate environment. <em>College Bound </em> appears to be meeting the needs of the participants with programmatic strength in the following areas: (a) developing self-advocacy; (b) accessing college support services, and (c) networking with other participants, and (d) interacting with successful college students with disabilities. </p> <br> </body> </html>",
  "description_provenance": [
    "Author Email: jwarner@vt.edu",
    "Advisor Email: jsugh@vt.edu",
    "Advisor Email: crocketj@vt.edu",
    "Advisor Email: sasselin@vt.edu",
    "Advisor Email: jenmik@exchange.vt.edu",
    "Advisor Email: espencer@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:50Z (GMT). No. of bitstreams: 1 Janeetd.pdf: 365113 bytes, checksum: 96c80d7ed086fff4bcf2ea1929c9c8d3 (MD5)   Previous issue date: 2004-10-25"
  ],
  "handle": "29420",
  "identifier_other": "etd-11012004-114502",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11012004-114502/",
  "identifier_uri": "http://hdl.handle.net/10919/29420",
  "publisher": "Virginia Tech",
  "relation_haspart": "Janeetd.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "disabilities",
    "higher education",
    "postsecondary education",
    "secondary education",
    "special education",
    "Transition",
    "and students"
  ],
  "title": "Evaluation of the College Bound Summer Program for High School Students with Disabilities",
  "type": "Dissertation"
}