{
  "contributor_author": "Ajlouni, Burouj Kayed",
  "contributor_department": "Veterinary Medical Sciences",
  "date_accessioned": "2014-03-14T20:17:51Z",
  "date_adate": "2009-12-07",
  "date_available": "2014-03-14T20:17:51Z",
  "date_issued": "2009-09-07",
  "date_rdate": "2013-04-29",
  "date_sdate": "2009-11-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Vascular endothelial growth factor (VEGF) is a potent angiogenic agent. VEGF activates its biologic responses through two cell-surface receptors, Flt1 and Flk1. In addition to the transmembrane form of Flt1, the Flt1 gene also encodes a secreted, truncated form of the receptor (sFlt1) translated from an mRNA in which a portion of intron 13 is preserved. sFlt1 retains high affinity for VEGF and thereby inhibits its  angiogenic activity. Intron 13 contains important cis elements involved in sFlt1 mRNA formation. Here, we test the hypothesis that polymorphisms in the human Flt1 gene, particularly SNPs at sites suspected to contain splicing or cleavage-polyadenylation  signals, influence Flt1 pre-mRNA processing and rates of Flt1 and sFlt1 expression. The NCBI SNP database contained 23 SNPs in the region of interest, one each in exons 13 and 14. An independent human SNP screen confirmed several of the reported SNPs. The web-based ESEfinder software predicted that the exon 13/14 SNPs had reduced potential for recruitment of splicing components. To test effects of exonic SNPs  on Flt1 pre-mRNA processing, wild type and mutant Flt1 minigene plasmids were transfected into NIH/3T3 cells. Both exonic SNPs were associated with ~40% decreases in Flt1:sFlt1 mRNA ratios determined by real-time PCR. To facilitate  exploration of ESEs in regulated RNA splicing, a PERL computer program, â  EXONerator,â   was written to silence predicted ESEs without altering polypeptide sequence. These results support the notion that small changes in exon composition can  have significant effects on splicing activity and underscore the utility of software tools for hypothesis generation.",
  "description_provenance": [
    "Author Email: bajlouni@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:51Z (GMT). No. of bitstreams: 1 Ajlouni_BK_D_2009.pdf: 9490496 bytes, checksum: 3b1a486debc40ed932a21e568fb051c6 (MD5)   Previous issue date: 2009-09-07"
  ],
  "handle": "29426",
  "identifier_other": "etd-11012009-210522",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11012009-210522/",
  "identifier_uri": "http://hdl.handle.net/10919/29426",
  "publisher": "Virginia Tech",
  "relation_haspart": "Ajlouni_BK_D_2009.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "RNA Processing",
    "sFlt-1",
    "SNPs",
    "ESEs",
    "Vascular Endothelial Growth Factor",
    "Angiogenesis",
    "Flt-1"
  ],
  "title": "Polymorphisms in the Flt1 gene and their relation to expression of the secreted Flt1 variant",
  "type": "Dissertation"
}