{
  "contributor_author": "Fichtner, Jason J",
  "contributor_committeechair": "Kronenberg, Philip S.",
  "contributor_committeemember": [
    "Khademian, Anne Meredith",
    "Wolf, James F.",
    "Dudley, Larkin S."
  ],
  "contributor_department": "Public and International Affairs",
  "date_accessioned": "2014-03-14T20:17:50Z",
  "date_adate": "2005-11-18",
  "date_available": "2014-03-14T20:17:50Z",
  "date_issued": "2005-10-31",
  "date_rdate": "2005-11-18",
  "date_sdate": "2005-11-01",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Distribution tables have become ubiquitous to the tax policy debates surrounding major legislative initiatives to change tax law at the federal level.  The fairness of any proposed change to federal tax policy has become one of the most highlighted components of tax policy discussions.  The presentation of tax data within distribution tables can hide or omit important information that is required in order to effectively evaluate the merits of any tax legislation.  Many producers of distribution tables show only the information necessary to present their policy preferences in the best possible light.  The different economic assumptions and presentations of data used by the various groups that release distribution tables have the inherent consequence of providing the public with numerous tables that are often used as political ammunition to influence and shape debate.    The purpose of this research is to contribute to the tax policy research literature by exploring the limitations and biases inherent in specific designs of tax distribution tables and in specific methodological approaches to tax distribution analysis.  This is done by means of a systematic examination of how different designs and methodologies provide an incomplete picture of a proposed change to federal tax policy.  By comparing distribution tables as used by different groups to provide alternative perspectives of various tax proposals, the research shows how the use of tax distribution tables often provides misleading results about the impact of proposed tax legislation in order to influence and shape the issues surrounding a proposed change to federal tax policy.  A method for evaluating tax distribution tables is proposed which highlights the deficiencies of design and methodology which characterize the present use of tax distribution tables.  An index of questions is provided as part of this research project to serve as a new tool of policy analysis, an index termed the \"Tax Distribution Table Scoring Index\" (TDTSI).  The TDTSI will assist in balancing the different perspectives presented via tax distribution tables by identifying the biases and limitations associated with different methodologies and presentations of data.",
  "description_provenance": [
    "Author Email: jjfichtner@cavtel.net",
    "Advisor Email: Khademian@earthlink.net",
    "Advisor Email: philkvt@vt.edu",
    "Advisor Email: jfwolf@vt.edu",
    "Advisor Email: dudleyl@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:50Z (GMT). No. of bitstreams: 1 Dissertation_Fichtner_2005.pdf: 676751 bytes, checksum: 9f764673ecca49c2e894ac66a572a133 (MD5)   Previous issue date: 2005-10-31"
  ],
  "handle": "29422",
  "identifier_other": "etd-11012005-125628",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11012005-125628/",
  "identifier_uri": "http://hdl.handle.net/10919/29422",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation_Fichtner_2005.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "tax distribution analysis",
    "strategic management",
    "problem definition",
    "issue framing",
    "tax reform",
    "income distribution",
    "agenda setting",
    "federal taxation",
    "tax policy"
  ],
  "title": "Distribution Tables and Federal Tax Policy: A Scoring Index as a Method for Evaluation",
  "type": "Dissertation"
}