{
  "contributor_author": "Li, Guang-Shan",
  "contributor_committeechair": "Chen, Jiann-Shin",
  "contributor_committeemember": [
    "Krieg, Noel R.",
    "Newton, William E.",
    "Dean, Dennis R.",
    "Larson, Timothy J."
  ],
  "contributor_department": "Biochemistry and Anaerobic Microbiology",
  "date_accessioned": "2014-03-14T20:17:53Z",
  "date_adate": "1998-12-11",
  "date_available": "2014-03-14T20:17:53Z",
  "date_issued": "1998-09-23",
  "date_rdate": "1999-12-11",
  "date_sdate": "1998-11-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Development of a reporter system for the study of gene expression for solvent production in Clostridium beijerinckii NRRL B592 and Clostridium acetobutylicum ATCC 824  \t\t\t\t\tBy  \t\t\t\tGuang-Shan Li  \t\t\t\t    (Abstract)  \tTo study the regulation of gene expression, a good reporter system is very useful.  The lack of a good reporter system for the solvent-producing clostridia hindered the progress of research in this area.  The objective of this study was to develop a reporter system to facilitate the elucidation of the control mechanism for the expression of solvent-producing genes.  A potential reporter gene was found in Clostridium beijerinckii NRRL B593, which contains an adh gene encoding a primary-secondary alcohol dehydrogenase and this adh gene is not present in Clostridium acetobutylicum ATCC 824 and Clostridium beijerinckii NRRL B592.  The adh gene was cloned into the E. coli -Clostridium shuttle vectors to generate plasmids.  An electro-transformation procedure was developed for C. beijerinckii NRRL B592.  Shuttle plasmids were transformed into C. beijerinckii NRRL B592 or C. acetobutylicum ATCC 824.  The copy number of the plasmids in C. beijerinckii was 4.  Isopropanol production suggested that the adh gene was expressed in transformants of C. acetobutylicum ATCC 824 and C. beijerinckii NRRL B592.  Northern analysis indicated that the expression of the adh gene was regulated at the transcriptional level in the transformants of C. beijerinckii. \tThe transcriptional start site for the adh gene was identified by the primer extension method.  A promoter-probing vector was constructed and tested with the promoter from the ferredoxin(fer) gene.  The expression of the adh gene under the control of the fer promoter was at a low and similar level during acidogenesis and solventogenesis.  The expression pattern of the adh gene under the control of the promoter of the adh  gene differed from that under the control of the promoter of the fer gene.",
  "description_provenance": [
    "Author Email: iqu@ornl.gov",
    "Advisor Email: nrk@vt.edu",
    "Advisor Email: wenewton@vt.edu",
    "Advisor Email: deandr@vt.edu",
    "Advisor Email: tilarson@vt.edu",
    "Advisor Email: chenjs@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:53Z (GMT). No. of bitstreams: 1 ETDall.pdf: 260044 bytes, checksum: 197cbbb3ce5777902a5481f4be5ef1c7 (MD5)   Previous issue date: 1998-09-23"
  ],
  "handle": "29439",
  "identifier_other": "etd-110298-180740",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-110298-180740/",
  "identifier_uri": "http://hdl.handle.net/10919/29439",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETDall.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "adh",
    "reporter system",
    "anaerobe",
    "solventogenesis",
    "Clostridium"
  ],
  "title": "Development of a reporter system for the study of gene expression for solvent production in Clostridium beijerinckii NRRL B592 and Clostridium acetobutylicum ATCC 824",
  "type": "Dissertation"
}