{
  "contributor_author": "Poley, Lisa D.",
  "contributor_committeechair": "Stephenson, Max O. Jr.",
  "contributor_committeemember": [
    "Mayer, Heike",
    "Flora, Cornelia Butler",
    "Rothschild, Joyce"
  ],
  "contributor_department": "Architecture and Urban Studies",
  "date_accessioned": "2014-03-14T20:17:52Z",
  "date_adate": "2007-12-03",
  "date_available": "2014-03-14T20:17:52Z",
  "date_issued": "2007-09-06",
  "date_rdate": "2008-12-03",
  "date_sdate": "2007-11-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Widespread concern over recent changes in American civic life has spawned arguments in a range of disciplines about the importance of social capital, citizen civic capacity and deliberative democratic engagement in supporting the development of engaged citizens, as well as supporting a democracy that is effective, publicly-minded and accountable.    This study contributes to this literature by empirically investigating the potential for a specific type of place-based community development called â  cohousingâ   to enhance the quantity and quality of resident civic engagement. Cohousing neighborhoods marry elements of social contact design with democratic self-governance and intentional social practices designed to build trust and cohesion among neighbors.  In addition to investigating civic engagement in cohousing, this study investigates the degree to which U.S. cohousing neighborhoods build social capital, develop residentsâ   democratic capacities and provide a platform for deliberative democratic practice.  The results of the study indicate extraordinarily high levels of civic engagement by U.S. cohousing residents as compared to both the general population and to individuals with similar educational, income and racial characteristics. A multiple-case analysis of three neighborhoods, selected for positive deviance in civic engagement levels, were found to possess high levels of trust, social cohesion and norms of reciprocity. Case community residents were also found to be developing a range of democratic capacities, individually and collectively, particularly through engagement in community self-governance via structures of distributed leadership and the use of consensus-based, community decision-making processes.   This study suggests that self-governing, communities of place, such as cohousing neighborhoods may represent a promising new avenue for enhanced citizen-engagement at the grassroots-community level. These neighborhoods also represent an excellent arena for future investigation into conditions, necessary and sufficient, to catalyze increased democratic capacity and civic engagement on the part of citizens.",
  "description_provenance": [
    "Author Email: lpoley@vt.edu",
    "Advisor Email: heikem@vt.edu",
    "Advisor Email: mstephen@vt.edu",
    "Advisor Email: cflora@iastate.edu",
    "Advisor Email: joycer@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:52Z (GMT). No. of bitstreams: 2 03_appendices.pdf: 9169121 bytes, checksum: bc3d3d644b162570e8ad9ad12a036c56 (MD5) LPDISSERTATION.pdf: 1612634 bytes, checksum: adf40694ac20dfbae6f039065e26a2c5 (MD5)   Previous issue date: 2007-09-06"
  ],
  "handle": "29434",
  "identifier_other": "etd-11022007-145010",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11022007-145010/",
  "identifier_uri": "http://hdl.handle.net/10919/29434",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "03_appendices.pdf",
    "LPDISSERTATION.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Cohousing",
    "civic engagement",
    "social capital",
    "democratic effects",
    "deliberative democracy"
  ],
  "title": "Community and the Habits of Democratic Citizenship: An Investigation into Civic Engagement, Social Capital and Democratic Capacity-Building in U.S. Cohousing Neighborhoods",
  "type": "Dissertation"
}