{
  "contributor_author": "Holland, Janice Lee",
  "contributor_committeechair": "Kronfeld, David S.",
  "contributor_committeemember": [
    "Sklan, David S.",
    "Jack, Nancy E.",
    "Dunnington, E. Ann",
    "Meacham, Thomas N.",
    "Lawrence, Larry A."
  ],
  "contributor_department": "Animal and Poultry Sciences",
  "date_accessioned": "2014-03-14T20:17:53Z",
  "date_adate": "1998-03-11",
  "date_available": "2014-03-14T20:17:53Z",
  "date_issued": "1998-11-18",
  "date_rdate": "1999-03-11",
  "date_sdate": "1998-11-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Pasture Intake, Digestibility and Fecal Kinetics in Grazing Horses  Janice L. Holland  (ABSTRACT) Pasture intake of grazing livestock needs to be estimated to allow determination of energy and nutrient intakes.  It is commonly estimated by difference, subtracting intakes of other feeds from estimated needs for dry matter or energy.  However, these estimates are often erroneous, because they do not take individual animal variation for growth, reproductive status or activity level into account.   <p> One method that has had success in grazing ruminants has been the use of markers, or tracers, to estimate fecal output and nutrient digestibility.  External markers are dosed to the animal and can be used to determine fecal output.  Internal markers are an inherent part of the diet in question and can be used to determine dry matter and nutrient digestibilities.  These estimates can then be used to give estimates of intake.  These studies were conducted to evaluate the effectiveness of traditional marker methods in determining fecal output, digestibility, and thus intake in grazing horses.  <p> The first trial was conducted on 8 mature mares and geldings, housed in stalls, to determine if a common external marker, Cr, could be used to determine fecal output. Horses were dosed once daily with a molasses, Cr, and hay mixture for 12 d.  Feces were collected throughout the day into individual tubs so that total fecal output (TC) could be measured. Daily fecal Cr excretion values (Ct, mg/kg DM) were fit to a monoexponential equation with one rate constant (k), rising to an asymptote (Ca):  Ct = Ca - Ca.e-kt.  Superior fits were found when a delay (d) was incorporated into the equation, estimating the time required for Cr to enter the prefecal pool: Ct = Ca - Ca.e-k(t-d).  Estimates of fecal output (FO) were calculated using the equation:  FO = Cr dose-d / Ca and provided good estimates when compared to TC values.  <p> Subsequent trials evaluated to use of internal markers and more frequent dosing of Cr to improve estimates of intake.  Eight mature geldings were housed in stalls and were fed 2 hays in a replicated Latin Square design.   The monoexponential equation with the delay continued to fit the data well.  Thrice daily dosing of Cr improved the predictions of FO, when dosing was every 8 h.  The internal marker, yttrium (Y) consistently overestimated digestibility (D).   The internal markers, n-alkanes, gave a better estimate of digestibility.   When the digestibility estimates were combined with the FO estimates to estimate dry matter intake (DMI, kg/d):  DMI = [FO / (1-D)]*100, the combination including n-alkanes gave better estimates.   <p> Further studies found that dosing Cr for 12 d did not improve the fit of the monoexponential equation compared to dosing for only 8 d.  Marker methods that had been developed in stalls were applied to grazing horses, and results continued to be promising.",
  "description_provenance": [
    "Author Email: jahollan@vt.edu",
    "Advisor Email: sklan@agri.huji.ac.il",
    "Advisor Email: njack@vt.edu",
    "Advisor Email: dunning@vt.edu",
    "Advisor Email: kronfeld@vt.edu",
    "Advisor Email: tmeacham@vt.edu",
    "Advisor Email: alaw@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:53Z (GMT). No. of bitstreams: 1 JLHETD.pdf: 639098 bytes, checksum: 8d4644227878c8bb06c1e735ce48f01a (MD5)   Previous issue date: 1998-11-18"
  ],
  "handle": "29438",
  "identifier_other": "etd-110298-110812",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-110298-110812/",
  "identifier_uri": "http://hdl.handle.net/10919/29438",
  "publisher": "Virginia Tech",
  "relation_haspart": "JLHETD.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Horses",
    "Intake",
    "Digestibility",
    "Fecal Output"
  ],
  "title": "Pasture Intake, Digestibility and Fecal Kinetics in Grazing Horses",
  "type": "Dissertation"
}