{
  "contributor_author": "Guri, Amir Joseph",
  "contributor_committeechair": "Bassaganya-Riera, Josep",
  "contributor_committeemember": [
    "Barbeau, William E.",
    "Thye, Forrest W.",
    "Liu, Dongmin",
    "Huckle, William R.",
    "Kingston, David G. I."
  ],
  "contributor_department": "Human Nutrition, Foods, and Exercise",
  "date_accessioned": "2014-03-14T20:17:52Z",
  "date_adate": "2007-11-28",
  "date_available": "2014-03-14T20:17:52Z",
  "date_issued": "2007-10-19",
  "date_rdate": "2007-11-28",
  "date_sdate": "2007-11-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Obesity is a disease characterized by chronic inflammation and the progressive loss in systemic insulin sensitivity.  One of the more effective medications in the treatment of insulin resistance have been the thiazolidinediones (TZDs), which act through the nuclear receptor peroxisome proliferator-activated receptor gamma (PPARgamma ).  Due to the many side-effects of TZDs, our laboratory sought out a natural phytochemical, abscisic acid (ABA), with chemical similarities to TZDs.  Our first study demonstrated that ABA activates PPARgamma in vitro and significantly ameliorates white adipose tissue (WAT) inflammation and glucose tolerance in db/db mice.  We next further examined the effect of ABA on the phenotype of adipose tissue macrophages (ATMs).  In doing so, we discovered two separate ATM populations which differed in their expression of the macrophage surface glycoprotein and maturation marker F4/80 (F4/80hi vs F4/80lo).  Dietary ABA-supplementation significantly reduced F4/80hiCCR2+ ATMs and had no effect on the F4/80lo population.  Utilizing a tissue-specific knockout generated through Cre-lox recombination, we were able to determine that this effect was dependent on PPARgamma in immune cells.  To further characterize the differences between the ATM subsets that were affected by ABA, we performed a multi-organ assessment (i.e., WAT, skeletal muscle and liver) of the effect of diet-induced obesity on the phenotype of infiltrating macrophages and T cells into metabolic organs.  Based on our new data, we formulated a model by which F4/80hiCCR2hi ATMs infiltrate WAT and ultimately induce a CD11c+ pro-inflammatory phenotype in the resident F4/80loCCR2lo subset.  Ultimately, our findings provide evidence that ABA has potential as an alternative preventive intervention, expound the role of PPARgamma in immune cells and, in general, expand our knowledge concerning the immunopathogenesis of obesity-induced insulin resistance.",
  "description_provenance": [
    "Author Email: guri@vt.edu",
    "Advisor Email: barbeau@vt.edu",
    "Advisor Email: thye@vt.edu",
    "Advisor Email: doliu@vt.edu",
    "Advisor Email: wrhuckle@vt.edu",
    "Advisor Email: jbassaga@vt.edu",
    "Advisor Email: dkingsto@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:52Z (GMT). No. of bitstreams: 1 AG_Dissertation.pdf: 2095992 bytes, checksum: 6369306f9c6c930e0594ce0df1f95be7 (MD5)   Previous issue date: 2007-10-19"
  ],
  "handle": "29433",
  "identifier_other": "etd-11022007-120119",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11022007-120119/",
  "identifier_uri": "http://hdl.handle.net/10919/29433",
  "publisher": "Virginia Tech",
  "relation_haspart": "AG_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "abscisic acid",
    "obesity",
    "macrophage",
    "inlfammation",
    "white adipose tissue"
  ],
  "title": "Abscisic acid ameliorates glucose tolerance and obesity-induced inflammation",
  "type": "Dissertation"
}