{
  "contributor_author": "Fike, Wonae Bong",
  "contributor_committeecochair": [
    "Reneau, Raymond B. Jr.",
    "Martens, David C."
  ],
  "contributor_committeemember": [
    "Radcliffe, J. S.",
    "Zelazny, Lucian W.",
    "Berry, Duane F."
  ],
  "contributor_department": "Crop and Soil Environmental Sciences",
  "date_accessioned": "2014-03-14T20:17:51Z",
  "date_adate": "2001-11-08",
  "date_available": "2014-03-14T20:17:51Z",
  "date_issued": "2001-08-24",
  "date_rdate": "2002-11-08",
  "date_sdate": "2001-11-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Metals sorption in soils is influenced by several factors, including pH, ionic strength, the presence of ionic composition or organic ligands, total amount of metals, and adsorbent loading.  These conditions should be considered when evaluating metal sorption capacity of soil material or when applying laboratory results to field conditions.  Metal sorption experiments were conducted on Bertie sandy and Starr-Dyke clay loam soils from long-term field studies in which soils received annual applications of copper-rich pig manure for 16 years.  Adsorption of Cd, Cu, Pb, and Zn as affected by different background electrolytes at various concentrations was investigated.  Electrolytes were Na+, Ca2+, or Al3+ in perchlorate solution, and their concentrations ranged from 0.001 to 0.5 molc L-1.  Increasing ionic strength decreased metal adsorption capacity.  Electrolyte cation composition had a greater effect on adsorption than did electrolyte concentration.  The order of sensitivity to cation composition of the electrolyte was Zn > Cd > Cu > Pb, and this effect was greater in Bertie sandy loam than Starr-Dyke clay loam soils.  Little difference in Cu and Pb adsorption was observed between Na+ and Ca2+ in background solution.   Most added Cu was adsorbed at low concentrations regardless of pH, but at high concentrations Cu sorption was strongly related to solution pH.  Increases in pH resulted in greater Cu sorption due to pH-dependent negative charges and precipitation.  The USEPA recommends that soil systems receiving high metal loading rates be maintained at pH 6.5 or above because of the increased metal adsorption.  However, pig manure applications to the Bertie soil resulted in greater Cu in soil solution than in control (no manure) soil at pH > 6.5 due to soluble organic matter. Using the Langmuir equation to determine adsorption maxima for soil systems does not always give adequate estimates of adsorption and values from the equations are highly dependent upon soil environmental parameters.  Given the limitations in prediction of adsorption maxima, and given that the amount of nonsorbed metal is as important as the adsorbed amount, the isolines of metal remaining in soil solution were provided with a given set of soil environmental factors.",
  "description_provenance": [
    "Author Email: wfike@vt.edu",
    "Advisor Email: zelazny@vt.edu",
    "Advisor Email: reneau@vt.edu",
    "Advisor Email: duberry@vt.edu",
    "Advisor Email: martensd@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:51Z (GMT). No. of bitstreams: 1 Dissertation.pdf: 7693038 bytes, checksum: 5f0e7605bc0120e9eb1f12c04775b090 (MD5)   Previous issue date: 2001-08-24"
  ],
  "handle": "29430",
  "identifier_other": "etd-11022001-113053",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11022001-113053/",
  "identifier_uri": "http://hdl.handle.net/10919/29430",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "adsorption isotherm models",
    "heavy metals",
    "iso-concentration line",
    "EC"
  ],
  "title": "Sorption of Cadmium, Copper, Lead, and Zinc as influenced by pH, ionic strength and selected soil components",
  "type": "Dissertation"
}