{
  "contributor_author": "Long, Kevin Lewis",
  "contributor_committeechair": "Rohr, John A.",
  "contributor_committeemember": [
    "Dudley, Larkin S.",
    "Wamsley, Gary L.",
    "Hult, Karen M.",
    "Rees, Joesph V."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:17:52Z",
  "date_adate": "2005-12-06",
  "date_available": "2014-03-14T20:17:52Z",
  "date_issued": "2004-10-14",
  "date_rdate": "2007-12-06",
  "date_sdate": "2005-11-02",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p> The devolution and judicialization movements of the past thirty years have dramatically changed the nature and structure of state-federal governmental relations.  States and localities are now playing a larger role in the implementation and delivery of basic government services. Many state legislatures, such as Virginia's, because of their limited sessions and inadequate staff assistance, often leave the interpretation of complex, technical matters to state and local administrators.  As a result, the role of state and local administrators in public policy formulation and implementation has become increasingly important.  Often, these administrators work in a complex environment marked by unclear lines of authority and ambiguous law.  The question then becomes, to whom do state and local executive branch officials turn to for assistance and legal interpretation when legislation or regulatory schemes are unclear? </p><p> One answer is the state and federal judiciary, however the process of adjudication is often an ineffective instrument for solving complex administrative questions.  The risk is that courts will create what Lon Fuller (1964) calls an \"undanceable tune,\" one to which none of the participants know the steps necessary to keep in time with the judicial order.  Building upon what Fuller (1964) referred to as the \"distinctive competence\" of certain legal institutions, this paper offers the opinion writing function of the state attorney general as a viable alternative to adjudication.  All state attorneys general issue opinions.  These opinions can shape policy and the development of law, partly because the opinions may be the only guidance on statutory or constitutional issues in the absence of prior litigation.</p><p>  Building upon the French Council of State, and using the state of Virginia as a model, this dissertation examines the guiding role that state attorney general opinions can play in resolving issues of ambiguity and statutory construction in various areas of public management and administration.  Specifically, this dissertation will examine the influence of Virginia Attorney General Opinions from the years 1972, 1976, 1980, 1984, 1988, 1992, 1996, and 2000.  The reason for choosing these years will be explained in Chapter One.  The dissertation will conclude with a discussion of how state attorney general opinions contribute to the governance dialogue, as well as their potential as transmitters of what Rohr (1989) terms \"regime values.\"</p>",
  "description_provenance": [
    "Author Email: kelong1@vt.edu",
    "Advisor Email: dudleyl@vt.edu",
    "Advisor Email: jrohr@vt.ed",
    "Advisor Email: wamsley@vt.edu",
    "Advisor Email: khult@vt.edu",
    "Advisor Email: reesj@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:52Z (GMT). No. of bitstreams: 1 KLongDiss.pdf: 1921665 bytes, checksum: 85aa5a2a1eaab3ead41a836ec6ba41c9 (MD5)   Previous issue date: 2004-10-14"
  ],
  "handle": "29431",
  "identifier_other": "etd-11022005-113035",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11022005-113035/",
  "identifier_uri": "http://hdl.handle.net/10919/29431",
  "publisher": "Virginia Tech",
  "relation_haspart": "KLongDiss.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "state and local government",
    "distinctive competence",
    "attorney general opinions"
  ],
  "title": "Distinctive Competence: The Role of Virginia Attorney General Opinions in State and Local Governance.",
  "type": "Dissertation"
}