{
  "contributor_author": "Cannon, Colleen A.",
  "contributor_committeechair": "Fell, Richard D.",
  "contributor_committeemember": [
    "Mullins, Donald E.",
    "Kugler, Charles",
    "Bloomquist, Jeffrey R.",
    "Keyel, Richard E."
  ],
  "contributor_department": "Entomology",
  "date_accessioned": "2014-03-14T20:17:55Z",
  "date_adate": "1998-05-11",
  "date_available": "2014-03-14T20:17:55Z",
  "date_issued": "1998-06-12",
  "date_rdate": "1999-05-11",
  "date_sdate": "1998-11-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Nutritional Ecology of the Carpenter Ant Camponotus pennsylvanicus (De Geer): Macronutrient Preference and Particle Consumption <p> Colleen A. Cannon <p> (ABSTRACT) <p> The nutritional ecology of the black carpenter ant, Camponotus pennsylvanicus (De Geer) was investigated by examining macronutrient preference and particle consumption in foraging workers.  The crops of foragers collected in the field were analyzed for macronutrient content at two-week intervals through the active season.  Choice tests were conducted at similar intervals during the active season to determine preference within and between macronutrient groups.  Isolated individuals and small social groups were fed fluorescent microspheres in the laboratory to establish the fate of particles ingested by workers of both castes. <p> Under natural conditions, foragers chiefly collected carbohydrate and nitrogenous material.  Carbohydrate predominated in the crop and consisted largely of simple sugars.  A small amount of glycogen was present.  Carbohydrate levels did not vary with time.  Lipid levels in the crop were quite low.  The level of nitrogen compounds in the crop was approximately half that of carbohydrate, and exhibited seasonal dependence.  Peaks in nitrogen foraging occurred in June and September,  months associated with the completion of brood rearing in Camponotus. <p> In choice tests, foragers demonstrated a preference for sucrose, fructose, and glucose, the most common honeydew sugars.  Sucrose was preferred over other sugars in laboratory and field tests.  Consumption rates peaked at a concentration of 20%.  Casein hydrolysate and processed fish products stimulated the most feeding in choice tests of protein foods.  Though a variety of lipids of plant and animal origin were offered in both field and laboratory tests, they were generally ignored. <p> No effect of time was observed during choice tests of macronutrient preference.  Overall, nitrogenous food was collected four-fold more intensively than carbohydrate, in contrast to the results obtained from examinations of the crop contents.  These data suggest that accessible nitrogen is limited in the environment. <p> Workers readily consumed fluorescent microspheres 0.5 - 45 μm diameter.  Forty-five μm microspheres were excluded from the crop.  Particles 3 - 10 μm reached the crop, but were never seen in the mid- or hindguts of either major or minor workers.  They also filled the infrabuccal pocket, where they were compacted into pellets.  It is thought that the proventriculus contains such particles in the foregut, where they are eventually filtered from the ingluvium. <p> Microspheres 1 μm or less were difficult to observe in the infrabuccal pocket, suggesting that they are not as effectively sequestered as larger particles.  Microspheres smaller than 1 μm were seen in the mid- and hindgut of both worker castes, indicating that particles of this size are immune to the proventricular filter.  Caste exerted an effect at one μm diameter, the threshold of filtering efficiency.  One μm microspheres consumed by minor workers were detected in the mid- and hindgut, whereas one μm microspheres were never detected beyond the proventriculus in major workers.",
  "description_provenance": [
    "Author Email: colleen.cannon@usa.net",
    "Advisor Email: mullinsd@vt.edu",
    "Advisor Email: rfell@vt.edu",
    "Advisor Email: jbquist@vt.edu",
    "Advisor Email: rekeyel@scj.com",
    "Made available in DSpace on 2014-03-14T20:17:55Z (GMT). No. of bitstreams: 1 Dissertation-etd.PDF: 1465190 bytes, checksum: 05fe4d34b5b8026744895d8925daa6b2 (MD5)   Previous issue date: 1998-06-12"
  ],
  "handle": "29447",
  "identifier_other": "etd-110398-001812",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-110398-001812/",
  "identifier_uri": "http://hdl.handle.net/10919/29447",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation-etd.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "foraging",
    "food",
    "feeding behavior",
    "diet",
    "Formicidae"
  ],
  "title": "Nutritional Ecology of the Carpenter Ant Camponotus pennsylvanicus (De Geer): Macronutrient Preference and Particle Consumption",
  "type": "Dissertation"
}