{
  "contributor_author": "Deck, Jr., D. William",
  "contributor_committeechair": "Price, William T. Jr.",
  "contributor_committeemember": [
    "Camp, William G.",
    "Asselin, Susan B.",
    "Brown, James R.",
    "Morgan, Samuel D."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:17:53Z",
  "date_adate": "1998-05-11",
  "date_available": "2014-03-14T20:17:53Z",
  "date_issued": "1998-10-30",
  "date_rdate": "1998-05-11",
  "date_sdate": "1998-11-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study was designed to determine if college students perform differently when they are tested more frequently than less frequently. The purpose of this research study was: (a) to determine if there is a difference in achievement between students given weekly tests (experimental group) and students given monthly tests (control group), (b) to determine if there is a difference in knowledge retention between students given weekly tests and students given monthly tests, and (c) to determine if there is a difference in time spent studying between students given weekly tests and students given monthly tests. The research design used was a true experimental form of the posttest-only with control technique. The participants were 109 students taking Principles of Marketing at Concord College in Athens, West Virginia. Fifty were enrolled in the fall of 1996, and the study was replicated with 59 students who were enrolled in the spring of 1997. Half of each class (fall and spring) was randomly assigned to weekly testing and the other halves were assigned to monthly testing. The weekly and monthly groups were taught simultaneously by the researcher both semesters. To test for differences in achievement between the weekly group and the monthly group, the mean test scores were compared at 80-question intervals. To test for differences in knowledge retention between the weekly group and the monthly group, the mean final exam scores were compared. To test for differences in hours spent studying between the weekly group and the monthly group, the means from the self-reported study hours surveys were compared at 80-question intervals. Based on the results of analysis of covariance, the research showed a significant difference in achievement between the weekly and the monthly groups in favor of the weekly group ( p = .007). However, the difference between the weekly and monthly group final exam scores was not significant ( p = .553), and the difference between the weekly and monthly groups' self-reported study hours was also not significant ( p = .231).",
  "description_provenance": [
    "Author Email: ddeck@bev.net",
    "Made available in DSpace on 2014-03-14T20:17:53Z (GMT). No. of bitstreams: 1 dis.pdf: 111246 bytes, checksum: 595da37ceb45478b69b45dbf003fef0f (MD5)   Previous issue date: 1998-10-30"
  ],
  "handle": "29440",
  "identifier_other": "etd-110298-195932",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-110298-195932/",
  "identifier_uri": "http://hdl.handle.net/10919/29440",
  "publisher": "Virginia Tech",
  "relation_haspart": "dis.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Spacing Effect",
    "Student Achievement",
    "Testing Frequency",
    "Cognitive Learning",
    "Assessment"
  ],
  "title": "The Effects of Frequency of Testing on College Students in a Principles of Marketing Course",
  "type": "Dissertation"
}