{
  "contributor_author": "Ford, James Leslie",
  "contributor_committeechair": "Mancini, Jay A.",
  "contributor_committeemember": [
    "Roberto, Karen A.",
    "Allen, Katherine R.",
    "Dolbin-MacNab, Megan L."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:17:54Z",
  "date_adate": "2008-11-20",
  "date_available": "2014-03-14T20:17:54Z",
  "date_issued": "2008-10-24",
  "date_rdate": "2008-11-20",
  "date_sdate": "2008-11-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This research explored psychological, social, and relational aspects of caregiving. It examined documented resolution of ethical dilemmas precipitated by veteransâ   medical crises and involved formal caregivers, informal caregivers, and veteran patients. The unit of analysis was caregiving relationships.  The main research question asked, how does case documentation and documented processes of resolving ethical dilemmas in institutional healthcare for veterans reflect relational ethics? Relational ethics was defined as fairness of interpersonal give and take and included efforts to elicit, understand, and honor veteranâ  s values and care preferences.   The caregiving context was a Veterans Affairs Medical Center (VAMC). The research population was 25 male veterans whose cases required intervention by the VAMC ethics committee. The research was conducted in three phases using grounded theory methodology.  The research purpose, guided by symbolic interaction theory, was to develop substantive theory in relational ethics. Study analyses used Atlas.ti qualitative software.     Main study one, Veteran-Formal Caregiver Relations, focused on relational processes internal to the VAMC. It explored how members of professional healthcare disciplines documented ethical caregiving concerns amongst themselves and in interactions with veteran patients. Agency emerged as the core category. Agency meant that veteran patients could make choices and act on those choices in ways that impacted their care. When veteransâ   agency was compromised, formal caregiversâ   roles became more salient. The substantive theory was the dynamic process of clarifying agency.    Main study two, Formal-Informal Caregiver Relations, focused on interactions between VAMC staff and veteransâ   significant others. It explored medical center staff communications with informal caregivers regarding veteransâ   health problems. Documented interactions confirmed the impact of relational ethics. Agendas and advocacy emerged as key categories that determined and respected veteransâ   relational autonomy. Relational autonomy validated other ethical concerns and resource demands, considered social context, and included obligations as well as entitlements. The substantive theory was the agenda to advocate for relational autonomy.    Substantive theories from the two main studies were integrated. Categorical dimensions were combined into substantive theory; that doing the right thing in institutional caregiving for veterans was the dynamic process of clarifying agency with the agenda to advocate for relational autonomy.",
  "description_provenance": [
    "Author Email: cptjym05@vt.edu",
    "Advisor Email: kroberto@vt.edu",
    "Advisor Email: kallen@vt.edu",
    "Advisor Email: mdolbinm@vt.edu",
    "Advisor Email: mancini@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:54Z (GMT). No. of bitstreams: 1 ETD_JLF_FINAL_DISS.pdf: 3767316 bytes, checksum: 1fe4169698a4b95d64b6517267b1c754 (MD5)   Previous issue date: 2008-10-24"
  ],
  "handle": "29445",
  "identifier_other": "etd-11032008-172512",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11032008-172512/",
  "identifier_uri": "http://hdl.handle.net/10919/29445",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETD_JLF_FINAL_DISS.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Agency",
    "Veterans",
    "Symbolic Interaction",
    "Relational Ethics",
    "Ethics",
    "Caregiving",
    "Autonomy"
  ],
  "title": "Doing the Right Thing: Relational Ethics in Institutional Caregiving for Veterans",
  "type": "Dissertation"
}