{
  "contributor_author": "Giunta, Rachel K.",
  "contributor_committeechair": "Kander, Ronald G.",
  "contributor_committeemember": [
    "Dillard, John G.",
    "Dillard, David A.",
    "Ward, Thomas C.",
    "St. Clair, Terry L."
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-03-14T20:17:55Z",
  "date_adate": "1999-11-18",
  "date_available": "2014-03-14T20:17:55Z",
  "date_issued": "1999-10-18",
  "date_rdate": "2000-11-18",
  "date_sdate": "1999-11-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "When bonded joints are subjected to harsh environmental conditions, the interphase, the three-dimensional region surrounding the adhesive/substrate interface, becomes critically important.  Frequently, failure occurs in this region after adhesively bonded systems are subjected to elevated temperature oxidative aging.  In a previous study, this was found to be the case with a polyimide adhesive bonded to chromic acid anodized (CAA) Ti-6Al-4V.  The objective of the current research has been twofold: 1) to investigate the effect of thermal aging on the interphase region of polyimide/titanium adhesive joints, and 2) to evaluate the method used in the current study for durability characterization of other adhesive/substrate systems.  The method used in this research has been to characterize the effect of elevated temperature aging on the following systems: 1) Notched coating adhesion (NCA) specimens and 2) bulk samples of dispersed substrate particles in an adhesive matrix.  The NCA test has the advantages of an accelerated aging geometry and a mode mix that leads to failure through the interphase, the region of interest.  The bulk samples have the advantage of an increased interphase volume and allow for the application of bulk analysis techniques to the interphase, a region that is traditionally limited to surface analysis techniques.  The adhesive systems studied consisted of one of two polyimide adhesives, LaRCâ ¢ PETI-5 or Cytec Fiberiteâ ¢ FM-5, bonded to CAA Ti-6Al-4V.  The model filled system consisted of a PETI-5 matrix with amorphous titanium dioxide filler.  Through the use of the NCA test, it was determined that bonded specimens made with FM-5 lose approximately 50% of their original fracture energy when aged in air at 177Â°C for 30 days.  This aging temperature is well below the glass transition temperature of the adhesive, 250Â°C.  At the same time, the failure location moves from the anodized oxide layer to the adhesive that is directly adjacent to the substrate surface, the interphase region.  Through surface analysis of this region, it is determined that the adhesive penetrates the pores of the CAA surface to a depth of 70 to 100 nm, promoting adhesion at the interface.  With aging, the adhesive in the interphase region appears to be weakening, although analysis of the bulk adhesive after aging shows little change.  This indicates that adhesive degradation is enhanced in the interphase compared to the bulk.  Analysis of the model filled system gave similar information.  Specimens containing titanium dioxide filler had glass transition temperatures that were approximately 20Â°C lower than the neat polyimide samples.  In addition, the filled samples contained a significant portion of low molecular weight extractable material that was not present in the neat specimens.  The tan delta spectra from dynamic mechanical thermal analysis of the filled specimens exhibited a shoulder on the high-temperature side of the glass transition peak.  This shoulder is attributed to the glass transition of the interphase, a distinct phase of the polyimide which is constrained by adsorption onto the filler particle surfaces.  As a function of aging time at 177Â° or 204Â°C, the shoulder decreases substantially in magnitude, which may relate to loss of adhesive strength between the polyimide and the filler particles.  From this research, it has been illustrated that information relating to the durability of adhesively bonded systems is gained using an interfacially debonding adhesive test and a model system of substrate particles dispersed in an adhesive matrix",
  "description_provenance": [
    "Author Email: giunta@spinn.net",
    "Advisor Email: dillardj@vt.edu",
    "Advisor Email: dillard@vt.edu",
    "Advisor Email: rkander@vt.edu",
    "Advisor Email: tward@chemserver.chem.vt.edu",
    "Advisor Email: t.l.stclair@larc.nasa.gov",
    "Made available in DSpace on 2014-03-14T20:17:55Z (GMT). No. of bitstreams: 1 etd.pdf: 6702172 bytes, checksum: 04308efc3ca8ca13e3193f36432a612e (MD5)   Previous issue date: 1999-10-18"
  ],
  "handle": "29449",
  "identifier_other": "etd-110399-105241",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-110399-105241/",
  "identifier_uri": "http://hdl.handle.net/10919/29449",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Notched Coating Adhesion Test",
    "Interphase",
    "PETI-5 Adhesive",
    "Ti-6Al-4V",
    "Pore Penetration",
    "Dynamic Mechanical Thermal Analysis",
    "Polyimide",
    "Aging",
    "Degradation",
    "Durability",
    "Chromic Acid Anodization"
  ],
  "title": "Durability of Polyimide/Titanium Adhesive Bonds: An Interphase Investigation",
  "type": "Dissertation"
}