{
  "contributor_author": "Byun, Gwibo",
  "contributor_committeechair": "Simpson, Roger L.",
  "contributor_committeemember": [
    "Thole, Karen A.",
    "Devenport, William J.",
    "Mason, William H.",
    "Neu, Wayne L."
  ],
  "contributor_department": "Aerospace and Ocean Engineering",
  "date_accessioned": "2014-03-14T20:17:54Z",
  "date_adate": "2005-11-14",
  "date_available": "2014-03-14T20:17:54Z",
  "date_issued": "2005-09-30",
  "date_rdate": "2005-11-14",
  "date_sdate": "2005-11-03",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Surface mean pressures, oil flow visualization, and 3-velocity-component laser-Doppler velocimeter measurements are presented for a turbulent boundary layer of momentum thickness Reynolds number, 7300 and thickness delta over two circular based axisymmetric bumps of height H = delta and 2delta and one rectangular based symmetric bump of H = 2delta. LDV data were obtained at one plane x/H ¥ 3.26 for each case. Complex vortical separations occur on the leeside and merge into large stream-wise mean vortices downstream for the 2 axisymmetric cases. The near-wall flow (y+ < 90) is dominated by the wall. For the axisymmetric cases, the vortices in the outer region produce large turbulence levels near the centerline and appear to have low frequency motions that contribute to turbulent diffusion. For the case with a narrower span-wise shape, there are sharper separation lines and lower turbulence intensities in the vortical downstream flow.  Fine-spatial-resolution LDV measurements were also obtained on half of the leeside of an axisymmetric bump (H/delta = 2) in a turbulent boundary layer. Three-dimensional (3-D) separations occur on the leeside with one saddle separation on the centerline that is connected by a separation line to one focus separation on each side of the centerline. Downstream of the saddle point the mean backflow converges to the focal separation points in a thin region confined within about 0.15delta from the local bump surface. The mean backflow zone is supplied by the intermittent large eddies as well as by the near surface flow from the side of the bump. The separated flow has a higher turbulent kinetic energy and shows bimodal histograms in local   and U and W, which appear to be due to highly unsteady turbulent motions. By the mode-averaged analysis of bimodal histograms, highly unsteady flow structures are estimated and unsteady 3-D separations seem to be occurring over a wide region on the bump leeside. The process of these separations has very complex dynamics having a large intermittent attached and detached flow region which is varying in time. These bimodal features with highly correlated local u and w fluctuating motions are the major source of large Reynolds stresses local u2, w2 and -uw. Because of the variation of the mean flow angle in the separation zones, the turbulent flow from different directions is non-correlated, resulting in lower shearing stresses. Farther from the wall, large stream-wise vortices form from flow around the sides of the bump.",
  "description_provenance": [
    "Author Email: gbyun@vt.edu",
    "Advisor Email: thole@vt.edu",
    "Advisor Email: simpson@aoe.vt.edu",
    "Advisor Email: devenport@aoe.vt.edu",
    "Advisor Email: whmason@vt.edu",
    "Advisor Email: neu@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:54Z (GMT). No. of bitstreams: 1 ByunDissertation.pdf: 15132197 bytes, checksum: ddaa61f57603b675c838ee104a52133b (MD5)   Previous issue date: 2005-09-30"
  ],
  "handle": "29441",
  "identifier_other": "etd-11032005-214442",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11032005-214442/",
  "identifier_uri": "http://hdl.handle.net/10919/29441",
  "publisher": "Virginia Tech",
  "relation_haspart": "ByunDissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Turbulent Flow Structures",
    "Bump",
    "Separation on Curved Surface",
    "Vortical Separation",
    "Three-Dimensional Separation",
    "Bimodal PDF",
    "Laser Doppler Velocimeter"
  ],
  "title": "Sturcture of Three-Dimensional Separated Flow on Symmetric Bumps",
  "type": "Dissertation"
}