{
  "contributor_author": "Weber, Miriam S.",
  "contributor_committeechair": "Akers, Robert Michael",
  "contributor_committeemember": [
    "Eyestone, Willard H.",
    "Pearson, Ronald E.",
    "Sejrsen, K.",
    "Wong, Eric A.",
    "Vinson, William E."
  ],
  "contributor_department": "Dairy Science",
  "date_accessioned": "2014-03-14T20:17:56Z",
  "date_adate": "1998-05-11",
  "date_available": "2014-03-14T20:17:56Z",
  "date_issued": "1998-11-19",
  "date_rdate": "1998-05-11",
  "date_sdate": "1998-12-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Development of the mammary gland is likely mediated by locally produced growth factors acting in concert with circulating mitogens.  To investigate the importance of mammary synthesis of insulin-like growth factor-I (IGF-I) and IGF-binding proteins (IGFBP), the initial objective was to evaluate the physiological effects of recombinant IGF-I synthesis in the mouse mammary gland.  Expression of recombinant IGF-I was targeted by the mouse mammary tumor virus - long terminal repeat (MMTV-LTR) to the mammary glands of two lines (15 and 29) of transgenic mice.  Mammary synthesis of recombinant IGF-I increased the frequency of appearance of mammary alveolar buds (71% vs. 21%) in transgenic compared with non-transgenic CD-1 mice.  During lactation, mammary synthesis of recombinant IGF-I reduced the amount of endogenous native IGF-I secreted into milk of transgenic mice.  Regardless of transgenesis, a shift in the milk IGFBP profile from predominantly IGFBP-3 to a lower molecular weight IGFBP occurred between d 8 and d 12 of lactation.  The altered composition of milk from transgenic line 29 dams reduced by 27% the average daily gain of suckling litters, compared with CD-1 dams.  Moreover, mammary glands of transgenic mice were less regressed after weaning than controls and were characterized by the presence of more organized secretory lobules. \t  The second overall objective was to evaluate the regulation and physiological effects of mammary IGF-I and IGFBP synthesis in prepubertal heifers.  Serum and extracts of mammary tissue at 5% concentration in media stimulated DNA synthesis 545% and 28%, respectively, in primary mammary epithelial organoids in collagen gel culture.  Addition of IGFBP-3 strongly inhibited this growth response.  High feeding level tended to increase IGFBP-3 levels in mammary tissue and reduced by 30% the growth response to mammary tissue extracts.  Somatotropin increased the mitogenic response to mammary extracts at high feeding level and increased the tissue content of IGF-I by 46%. \t  In summary, local synthesis of IGF-I and IGFBP is influenced by feeding level and exogenous somatotropin and contributes substantially to effects on mammary cell proliferation.  Interactions of locally produced IGFBP-3 with IGF-I and other growth factors appear to be especially important when mammary growth is modulated by feeding level.",
  "description_provenance": [
    "Author Email: miweber@vt.edu",
    "Advisor Email: weyest@vt.edu",
    "Advisor Email: rep@vt.edu",
    "Advisor Email: kr.sejrsen@agrsci.dk",
    "Advisor Email: rma@vt.edu",
    "Advisor Email: ewong@vt.edu",
    "Advisor Email: usrwev@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:56Z (GMT). No. of bitstreams: 1 etd.pdf: 706375 bytes, checksum: 47eae9e49e87699b04edb2f4ae28f9cf (MD5)   Previous issue date: 1998-11-19"
  ],
  "handle": "29457",
  "identifier_other": "etd-110498-101824",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-110498-101824/",
  "identifier_uri": "http://hdl.handle.net/10919/29457",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "mammary",
    "insulin-like growth factor binding proteins",
    "insulin-like growth factor-I"
  ],
  "title": "The Role of Insulin-like Growth Factor-I and IGF-binding Proteins in Mammary Gland Development",
  "type": "Dissertation"
}