{
  "contributor_author": "Zigler, David Francis",
  "contributor_committeechair": "Brewer, Karen J.",
  "contributor_committeemember": [
    "Winkel, Brenda S. J.",
    "Deck, Paul A.",
    "Tanko, James M.",
    "Yee, Gordon T."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:17:55Z",
  "date_adate": "2008-11-19",
  "date_available": "2014-03-14T20:17:55Z",
  "date_issued": "2008-10-28",
  "date_rdate": "2011-09-05",
  "date_sdate": "2008-11-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "A series mixed metal supramolecular complexes were synthesized and studied by electrochemistry, photophysics and photochemistry.  The complexes consisted of a single RuII or OsII polyazine light absorber bound to a cis-RhIIICl2 moiety through a polyazine bridging ligand.  A related class of supramolecule is known to perform photoinitiated electron collection, photocatalysis of hydrogen from water, DNA photomodification and is known to kill mammalian cells; all with visible light irradiation.  The complexes studied herein, [(bpy)2Ru(bpm)RhCl2(phen)](PF6)3, [(bpy)2Ru(dpp)RhCl2(phen)](PF6)3, [(bpy)2Os(dpp)RhCl2(phen)](PF6)3, and [(tpy)OsCl(dpp)RhCl2(phen)](PF6)2 were synthesized in moderate yields (54-84%) by reaction of the appropriate monometallic visible light absorbing subunit with a slight excess of K[(phen)RhCl4]â ¢3H2O (bpy = 2,2'-bipyridine, bpm = 2,2'-bipyrimidine, 1,10-phenanthroline, dpp = 2,3-bis(2-pyridyl)pyrazine, and tpy = 2,2':6',2\"-terpyridine).  Voltammetric analysis of [(bpy)2Ru(bpm)RhCl2(phen)](PF6)3  revealed a reversible oxidation at 1.76 V (vs. Ag/AgCl)  (RuIII/II).  A reversible reduction at â  0.14 V (bpm0/-), and quasi-reversible reductions at â  0.77 V and â  0.91 V each corresponded to a one electron process, bpm0/â  , RhIII/II and RhII/I.  The electrochemistry of [(bpy)2Ru(dpp)RhCl2(phen)](PF6)3  showed a reversible oxidation at 1.61 V (RuIII/II), and quasi-reversible reductions at â  0.39 V,  â  0.74 V and â  0.98 V.  The first two reductive couples corresponded to two electrons, consistent with Rh reduction.  [(bpy)2Os(dpp)RhCl2(phen)](PF6)3, and [(tpy)OsCl(dpp)RhCl2(phen)](PF6)2 each exhibited reductions similar to the dpp bridged Ru,Rh dyad, but with OsIII/II based oxidations at 1.24 V and 0.83 V, respectively.  The complexes [(bpy)2Ru(bpm)RhCl2(phen)](PF6)3 and [{(bpy)2Ru(bpm)}2RhCl2](PF6)5 display Ru(d&#960;)â  bpm(&#960;*) CT (MLCT) transitions at 581 nm and at 594 nm, respectively.  The dpp bridged Ru,Rh bimetallic and Ru,Rh,Ru trimetallic display Ru(d&#960;)â  dpp(&#960;*) CT transitions at 509 nm and 518 nm, respectively.  Similarly, [(bpy)2Os(dpp)RhCl2(phen)](PF6)3 absorbs strongly at 520 nm versus 534 nm for [{(bpy)2Os(dpp)}2RhCl2](PF6)5, both with low energy tails at 800 nm indicative of Os centered MLCT transitions.  Overlapping Os(d&#960;)â  dpp(&#960;*) and Os(d&#960;)â  tpy(&#960;*)  transitions occur at 536 nm with low energy tails at 856 nm for both [(tpy)OsCl(dpp)RhCl2(phen)](PF6)2 and [{(tpy)OsCl(dpp)}2RhCl2](PF6)3.  Emission from [{(bpy)2Ru(dpp)}RhCl2](PF6)5 and [(bpy)2Ru(dpp)RhCl2(phen)](PF6)3 at room temperature and 77 K was red shifted and less intense than emission from [(bpy)2Ru(dpp)Ru(bpy)2](PF6)4, consistent with quenched emission from a Ru(d&#960;)â  dpp(&#960;*) 3MLCT state.  Transient absorption spectroscopy supported assignment of the emissive state as Ru(d&#960;)â  dpp(&#960;*) CT in nature.  The complexes [(bpy)Ru(dpp)RhCl2(phen)](PF6)3 (&#964; =18 ns) and [{(bpy)2Ru(dpp)}2RhCl2](PF6)5 (&#964; = 16 ns) each exhibit shorter lived 3MLCT states than the Ru,Ru dyad (&#964; = 125 ns) in acetonitrile consistent with favorable electron transfer to Rh(III) to generate a metal to metal charge transfer (3MMCT) state.  The photochemistry of [{(bpy)2Ru(dpp)}2RhCl2]Cl5, [{(tpy)OsCl(dpp)}2RhCl2]Cl3, [(bpy)2Ru(dpp)RhCl2(phen)]Cl3, and [(tpy)OsCl(dpp)RhCl2(phen)]Cl2 with DNA was investigated using gel electrophoresis and selective precipitation of a DNA/metal complex adduct.  An array of high intensity LEDs was designed, constructed and validated to accommodate these high throughput photochemical experiments with DNA.  Each of the metal complexes is suggested to undergo photobinding with DNA as well as to photocleave DNA.  A 3MMCT state or a thermally accessible Rh centered 3LF state each are proposed as leading to photobinding, while a 3MMCT state is thought to be involved in DNA photocleavage.",
  "description_provenance": [
    "Author Email: dfzigler@vt.edu",
    "Advisor Email: kbrewer@vt.edu",
    "Advisor Email: winkel@vt.edu",
    "Advisor Email: pdeck@vt.edu",
    "Advisor Email: jtanko@vt.edu",
    "Advisor Email: gyee@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:55Z (GMT). No. of bitstreams: 1 Zigler_ETD_3.pdf: 3751905 bytes, checksum: 83386786cd5b96fc9e35bf5f7d6e8498 (MD5)   Previous issue date: 2008-10-28"
  ],
  "handle": "29453",
  "identifier_other": "etd-11042008-143805",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11042008-143805/",
  "identifier_uri": "http://hdl.handle.net/10919/29453",
  "publisher": "Virginia Tech",
  "relation_haspart": "Zigler_ETD_3.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "supramolecules",
    "osmium",
    "photochemistry",
    "mixed-metal",
    "polyazine",
    "DNA",
    "ruthenium",
    "rhodium"
  ],
  "title": "Synthesis and Study of Polyazine Bridged Mixed Metal Dyads: Electrochemical, Photophysical, and Photochemical Properties of a New Supramolecular Architecture",
  "type": "Dissertation"
}