{
  "contributor_author": "Smith, Kenneth Samuel",
  "contributor_committeechair": "Hirt, Joan B.",
  "contributor_committeemember": [
    "Janosik, Steven M.",
    "Chang, Mido",
    "Hyer, Patricia B."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:17:56Z",
  "date_adate": "2011-11-23",
  "date_available": "2014-03-14T20:17:56Z",
  "date_issued": "2011-10-31",
  "date_rdate": "2011-11-23",
  "date_sdate": "2011-11-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Participation in summer session has benefits for students including improved retention and degree completion and increased contact with faculty (Adelman, 2006; DiGregorio, 1998).  Just as some characteristics of students limit their access to participate in higher education in general, participation in summer session may also be affected by certain student characteristics.  This study used a nationally representative sample to explore how undergraduate students who enroll in summer session may differ from undergraduate students who do not enroll in summer session in a variety of financial, geographic, academic, programmatic and cultural/social/physical characteristics historically associated with access to higher education. Significant differences between summer enrolled and not enrolled students were found in a number of instances.  Some characteristics that are negatively associated with enrollment, persistence and attainment in higher education were positively associated with summer enrollment.  A regression analysis revealed that the combined predictive value of student characteristics accounts for only a small portion of the overall decision to enroll in the summer term.",
  "description_provenance": [
    "Author Email: kensmith@vt.edu",
    "Advisor Email: jbhirt@vt.edu",
    "Advisor Email: sjanosik@vt.edu",
    "Advisor Email: mchang@vt.edu",
    "Advisor Email: hyerp@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:56Z (GMT). No. of bitstreams: 1 Smith_KS_D_2011.pdf: 1932843 bytes, checksum: a0e2b6580add473f2f77d25b6cb745d5 (MD5)   Previous issue date: 2011-10-31"
  ],
  "handle": "29456",
  "identifier_other": "etd-11042011-121953",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11042011-121953/",
  "identifier_uri": "http://hdl.handle.net/10919/29456",
  "publisher": "Virginia Tech",
  "relation_haspart": "Smith_KS_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Access",
    "Summer Session",
    "Summer",
    "Year-Round Attendance"
  ],
  "title": "Characteristics of Students Who Enroll in Summer Session",
  "type": "Dissertation"
}