{
  "contributor_author": "Harun, Mahmud",
  "contributor_committeechair": "Ellingson, Steven W.",
  "contributor_committeemember": [
    "Safaai-Jazi, Ahmad",
    "Manteghi, Majid",
    "Patterson, Cameron D.",
    "Simonetti, John H."
  ],
  "contributor_department": "Electrical and Computer Engineering",
  "date_accessioned": "2014-03-14T20:17:56Z",
  "date_adate": "2011-11-14",
  "date_available": "2014-03-14T20:17:56Z",
  "date_issued": "2011-11-28",
  "date_rdate": "2011-11-14",
  "date_sdate": "2011-11-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Modifications of large reflector antennas, such that their observing capabilities are enhanced in the range of about 10-500~MHz without affecting operation of the pre-existing higher-frequency systems, are addressed in this dissertation. The major contributions of this dissertation can be divided into two parts: 1) designing new low frequency feeds, and 2) developing new analysis methodologies which, as opposed to traditional techniques, are suitable for analyzing low frequency systems.  First, we consider the performance of existing schemes that provide low frequency capability. Then, a new class of dipole-based low frequency feeds - namely, the ``distributed feed array'' - is designed to cover the frequency range of interest without affecting operation at higher frequencies. As an example, distributed feed arrays are designed for the Expanded Very Large Array (EVLA) to cover the range of 50-250~MHz. A method of moments (MoM) model of an EVLA antenna is developed for this purpose. The new design shows performance comparable to the existing 4 m system on the EVLA in the range of 50-88~MHz, and introduces observing capabilities in the range of 110-250~MHz (currently not covered by the EVLA). Moreover, the blockage presented to the existing EVLA L-band system is reduced significantly when the existing 4 m system is replaced by the proposed system.    At low frequencies, external noise can be a significant or dominant contribution to the total noise of the system. This, combined with mutual coupling between the array elements of the distributed feed array, makes it difficult to predict the sensitivity of these systems. This dissertation describes a system model and procedure for estimating the system equivalent flux density (SEFD) - a useful and meaningful metric of the sensitivity of a radio telescope - that accounts for these issues.  We consider the efficiency of methods other than MoM - in particular, Physical Optics (PO), Uniform Geometrical Theory of Diffraction (UTD), and hybrid methods - for accelerated computation at low frequencies. A method for estimating the blockage presented by low frequency systems to the pre-existing higher-frequency systems is also described.",
  "description_provenance": [
    "Author Email: mharun@vt.edu",
    "Advisor Email: ellingson@vt.edu",
    "Advisor Email: ajazi@vt.edu",
    "Advisor Email: manteghi@vt.edu",
    "Advisor Email: cdp@vt.edu",
    "Advisor Email: jsimonet@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:56Z (GMT). No. of bitstreams: 2 Harun_Mahmud_D_2011.pdf: 6878281 bytes, checksum: 78759497182382cf6d75fef56243ef37 (MD5) Harun_Mahmud_D_2011_Copyright.pdf: 31413 bytes, checksum: 9dfa4a4efb0d7dfd60adcd4a735ad737 (MD5)   Previous issue date: 2011-11-28"
  ],
  "handle": "29455",
  "identifier_other": "etd-11042011-103540",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11042011-103540/",
  "identifier_uri": "http://hdl.handle.net/10919/29455",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Harun_Mahmud_D_2011.pdf",
    "Harun_Mahmud_D_2011_Copyright.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Low Frequency Radio Astronomy",
    "Reflector Antennas",
    "Feeds",
    "Sensitivity"
  ],
  "title": "Modification of Large Reflector Antennas for Low Frequency Operation",
  "type": "Dissertation"
}