{
  "contributor_author": "Toomire, Bruce Vincent",
  "contributor_committeechair": "Zweifel, Paul F.",
  "contributor_committeemember": [
    "Ficenec, John R.",
    "Hagedorn, George A.",
    "Slawny, Joseph",
    "Klaus, Martin",
    "Chang, Lay Nam"
  ],
  "contributor_department": "Physics",
  "date_accessioned": "2014-03-14T20:17:58Z",
  "date_adate": "1998-05-11",
  "date_available": "2014-03-14T20:17:58Z",
  "date_issued": "1998-10-21",
  "date_rdate": "1999-05-11",
  "date_sdate": "1998-12-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The need to model the quantum effects in semiconductor devices such as resonance tunneling diodes and quantum dots has lead to an intense study of the Wigner-Poisson (WP) and Schroedinger-Poisson (SP) systems. In this work we present the mathematical analysis of several related models for these systems. These include: a time-dependent model of dissipation in (SP), a quasi-linear (SP) system, a study of the stationary (WP)-(SP) problem with a discussion of the quantum analogue of classical BGK modes and a proof of existence of eigenfunctions for (SP) with periodic boundary conditions, and an examination of the stationary Wigner equations with inflow\" boundary conditions. Finally, a proposed numerical scheme for the stationary (SP) system with Boltzmann distribution functions is shown along with its corresponding Bloch equation.",
  "description_provenance": [
    "Author Email: bvt@austin.rr.com",
    "Advisor Email: Zweifel@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:58Z (GMT). No. of bitstreams: 1 etd.pdf: 583341 bytes, checksum: bd46c6dea97be163932fe5b5e47e3701 (MD5)   Previous issue date: 1998-10-21"
  ],
  "handle": "29464",
  "identifier_other": "etd-110498-165301",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-110498-165301/",
  "identifier_uri": "http://hdl.handle.net/10919/29464",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": "Wigner-Poisson Schroedinger-Poisson Quantum Transp",
  "title": "Studies in the Wigner-Poisson and Schroedinger-Poisson Systems",
  "type": "Dissertation"
}