{
  "contributor_author": "Chapman, Betty Foust",
  "contributor_committeechair": "Heath-Camp, Betty A.",
  "contributor_committeemember": [
    "Holmes, Glen A.",
    "Skaggs, Gary E.",
    "Brown, Ralphael L.",
    "Stewart, Daisy L."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:17:59Z",
  "date_adate": "2003-11-11",
  "date_available": "2014-03-14T20:17:59Z",
  "date_issued": "2003-08-29",
  "date_rdate": "2004-11-11",
  "date_sdate": "2003-11-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<title>AN ASSESSMENT OF BUSINESS TEACHER EDUCATORS'</title> <title>ADOPTION OF COMPUTER TECHNOLOGY</title>  <title>Betty Foust Chapman</title>  <p><title> (ABSTRACT) </title></p>  <p>Federal legislation, the Office of Technology Assessment of the U. S. Congress, and national and state technological standards strongly encourage faculty to use computer technology in their lessons as a teaching tool. Technological standards have existed for several years that strongly encourage the use of computer technology in colleges and universities as a teaching tool. Yet it is difficult for faculty to infuse technology into their teaching. </p> <p>The purpose of this study was to assess and identify the factors that influence business teacher educators to adopt computer technology methods and utilize them in their instruction and to determine the extent to which business teacher educators are adopting computer technology in their teaching. The population consisted of 95 members of the National Association of Teacher Educators for Business Education. </> <p>Findings from the descriptive statistics revealed that the largest percentage of the business teacher educators were early adopters. They indicated that they always used word processing and almost always integrated computers, projectors, and email in their instruction during the past semester. The study also found certain social, organizational, and personal motivational factors that the business teacher educators considered as very important in influencing them to adopt emerging computer technology for use in their instruction. </p> <p>The means revealed differences within the respondents' personal and employment characteristics and the extent to which they adopt current computer technology as a teaching tool; however, an analysis of variance (ANOVA) indicated no significant difference between these variables. Also, multiple regression analysis revealed that the importance of students, a specific adoption category, and the importance of physical resources (hardware) significantly predicted computer technology adoption. </p> <p>The study also revealed that the business teacher educators in this study have the potential to serve as change agents and role models for their student clientele and peers since the findings suggest that these faculty members are among the first individuals to adopt computer technology for use in their instruction. The findings from the study have the potential to contribute to the development of an adopter profile that could be used to identify potential adopters of emerging computer technology. </p>",
  "description_provenance": [
    "Author Email: bechapma@vt.edu",
    "Advisor Email: holmesg@wssu.edu",
    "Advisor Email: gskaggs@vt.edu",
    "Advisor Email: rbrown1@triad.rr.com",
    "Advisor Email: bh76@cornell.edu",
    "Advisor Email: daisys@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:59Z (GMT). No. of bitstreams: 1 ChapmanDiss.pdf: 602387 bytes, checksum: 30c7dc77e6b82a32f8f5e4dbc493ba62 (MD5)   Previous issue date: 2003-08-29"
  ],
  "handle": "29468",
  "identifier_other": "etd-11052003-152749",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11052003-152749/",
  "identifier_uri": "http://hdl.handle.net/10919/29468",
  "publisher": "Virginia Tech",
  "relation_haspart": "ChapmanDiss.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "computer history in education",
    "adoption",
    "integration",
    "computer technology",
    "instructional technology",
    "diffusion of innovation theory"
  ],
  "title": "An Assessment of Business Teacher Educators' Adoption of Computer Technology",
  "type": "Dissertation"
}