{
  "contributor_author": "Hutcheson, Florence Vanel",
  "contributor_committeechair": "Fuller, Christopher R.",
  "contributor_committeemember": [
    "O'Brien, Walter F. Jr.",
    "Barnwell, Richard W.",
    "Burdisso, Ricardo A.",
    "Dunn, Mark"
  ],
  "contributor_department": "Mechanical Engineering",
  "date_accessioned": "2014-03-14T20:17:59Z",
  "date_adate": "1999-11-17",
  "date_available": "2014-03-14T20:17:59Z",
  "date_issued": "1999-10-14",
  "date_rdate": "2000-11-17",
  "date_sdate": "1999-11-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "An advanced model of active control of fan noise for ultra high bypass turbofan  engines has been developed. This model is based on a boundary integral equation method  and simulates the propagation, radiation and control of the noise generated by an engine  fan surrounded by a duct of finite length and cylindrical shape, placed in a uniform flow.  Control sources, modeled by point monopoles placed along the wall of the engine inlet or  outlet duct, inject anti-noise into the duct to destructively interfere with the sound field  generated by the fan. The duct inner wall can be lined or rigid. Unlike current methods,  reflection from the duct openings is taken into account, as well as the presence of the  evanescent modes. Forward, as well as backward (i.e., from the rear of the engine),  external radiation is computed.     The development of analytical expressions for the sound field resulting from both the  fan loading noise and the control sources is presented. Two fan models are described. The  first model uses spinning line sources with radially distributed strength to model the  loading force that the fan blades exert on the medium. The second model uses radial  arrays of spinning point dipoles to simulate the generation of fan modes of specific modal  amplitudes. It is shown that these fan models can provide a reasonable approximation of  actual engine fan noise in the instance when the modal amplitude of the propagating  modes or the loading force distribution on the fan blades, is known.     Sample cases of active noise control are performed to demonstrate the feasibility of  the model. The results from these tests indicate that this model 1) is conducive to more  realistic studies of active control of fan noise on ultra high bypass turbofan engines  because it accounts for the presence of evanescent modes and for interference between  inlet and outlet radiation, which were shown to have some impact on the performance of  the active control system; 2) is very useful because it allows monitoring of any region of  the acoustic field; 3) is computationally fast, and therefore suitable to conduct parametric  studies.     Finally, the potential that active noise control techniques have for reducing fan noise  on an ultra high bypass turbofan engine is investigated. Feedforward control algorithms  are simulated. Pure active control techniques, as well as hybrid (active/passive) control  techniques, are studied. It is demonstrated that active noise control has the potential to  reduce substantially, and over a relatively large far field sector, the fan noise radiated by  an ultra high bypass turbofan engine. It is also shown that a hybrid control system can  achieve significantly better levels of noise reduction than a pure passive or pure active  control system, and that its optimum solution is more robust than the one achieved with a  pure active control system.    The model has shown to realistically predict engine acoustic behavior and is thus  likely to be a very useful tool for designing active noise control systems for ultra high  bypass turbofan engines.",
  "description_provenance": [
    "Author Email: f.v.hutcheson@larc.nasa.gov",
    "Advisor Email: walto@vt.edu",
    "Advisor Email: barnwell@vces.larc.nasa.gov",
    "Advisor Email: c.r.fuller@larc.nasa.gov",
    "Advisor Email: rburdiss@vt.edu",
    "Advisor Email: mhd314@aol.com",
    "Made available in DSpace on 2014-03-14T20:17:59Z (GMT). No. of bitstreams: 12 00_etd.pdf: 43994 bytes, checksum: c5b25fa9cb0c48b7c2092672f7d78a54 (MD5) chapter5.pdf: 2409324 bytes, checksum: 9a67a68b58a1637a646f282023ec29a9 (MD5) chapter1.pdf: 88230 bytes, checksum: 16fdced7c96a9be4e54505a4c2cf3fb1 (MD5) vita.pdf: 2745 bytes, checksum: 66397d1f7fe67a19d6cc6b5a5a7d9825 (MD5) chapter7.pdf: 12102 bytes, checksum: 7d7b9f18d244d9960688054aa38d9099 (MD5) appendixa.pdf: 8993 bytes, checksum: a0004d1168edde4f69fe8c4a36ae7633 (MD5) appendixb.pdf: 17856 bytes, checksum: 9985fa75f405c9e070bb02315db5c9c2 (MD5) chapter2.pdf: 104581 bytes, checksum: 3eb9dddfbaf0b82ef08853a5b4d8a4d6 (MD5) references.pdf: 29047 bytes, checksum: c56c0b648aa3cf4c3fc258769ec5679e (MD5) chapter6.pdf: 491978 bytes, checksum: d6ab0704d6c2ea74f8432ed9f101c7c1 (MD5) chapter3.pdf: 137927 bytes, checksum: 306c1d60cbece4167abffb96f89fd9e5 (MD5) chapter4.pdf: 142005 bytes, checksum: 49ab1a131e0c7e539323fef9353b3960 (MD5)   Previous issue date: 1999-10-14"
  ],
  "handle": "29466",
  "identifier_other": "etd-110499-180010",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-110499-180010/",
  "identifier_uri": "http://hdl.handle.net/10919/29466",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "00_etd.pdf",
    "chapter5.pdf",
    "chapter1.pdf",
    "vita.pdf",
    "chapter7.pdf",
    "appendixa.pdf",
    "appendixb.pdf",
    "chapter2.pdf",
    "references.pdf",
    "chapter6.pdf",
    "chapter3.pdf",
    "chapter4.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "turbofan engine",
    "fan noise",
    "active control"
  ],
  "title": "Advanced modeling of active control of fan noise for ultra high bypass turbofan engines",
  "type": "Dissertation"
}