{
  "contributor_author": "Badami, Anand Shreyans",
  "contributor_committeechair": "McGrath, James E.",
  "contributor_committeemember": [
    "Joseph, Eugene G.",
    "Wilkes, Garth L.",
    "Riffle, Judy S.",
    "Davis, Richey M."
  ],
  "contributor_department": "Macromolecular Science and Engineering",
  "date_accessioned": "2014-03-14T20:17:59Z",
  "date_adate": "2007-12-04",
  "date_available": "2014-03-14T20:17:59Z",
  "date_issued": "2007-10-15",
  "date_rdate": "2007-12-04",
  "date_sdate": "2007-11-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The commercialization of proton exchange membrane (PEM) fuel cells depends largely upon the development of PEMs whose properties are enhanced over current perfluorinated sulfonic acid PEMs.  Understanding how a PEMâ  s molecular weight and morphology affect its relevant performance properties is essential to this effort.  Changes in molecular weight were found to have little effect on the phase separated morphologies, water uptake, and proton conductivities of random copolymers.  Changes in block length, however, have a pronounced effect on multiblock copolymers, affecting surface and bulk morphologies, water uptake, proton conductivity, and hydrolytic stability, suggesting that multiblock copolymer PEM properties may be optimized by changes in morphology. \tA major goal of current proton exchange membrane fuel cell research involves developing high temperature membranes that can operate at ~120 Â°C and low humidites.  Multiblock copolymers synthesized from 100% disulfonated poly(arylene ether sulfone) (BPSH100) and naphthalene polyimide (PI) oligomers may be an alternative.  At block lengths of ~15 kg/mol they displayed no morphological changes up to 120 Â°C or even higher.  Water desorption was observed to decrease with increasing block length.  The copolymers exhibited little to no water loss during a 200 Â°C isotherm in contrast to random BPSH copolymers and Nafion.  A BPSH100-PI multiblock copolymer with large block length appears to have morphological stability and retain water at temperatures exceeding 120 Â°C, suggesting its candidacy as a high temperature PEM.  \tA growing number of alternative PEM research efforts involve multiblock copolymer chemistries, but little emphasis is placed on the methods used to couple the oligomers.  Fluorinated linkage groups can help increase block efficiency during coupling, but their effect on a PEM is not well-known.  The choice of linkage type, hexafluorobenzene (HFB) vs. decafluorobiphenyl (DFBP), appears to have small but observable influences on multiblock copolymers with disulfonated and unsulfonated poly(arylene ether sulfone) oligomers.  DFBP linkages promote greater phase separation than HFB linkages, resulting in increased stiffness, decreased ductility, and increased proton conductivity at low humidities.  DFBP linkages also promote more surface enrichment of fluorine, causing changes in surface morphology and slightly increased water desorption, but determining the impact on actual fuel cell performance requires further research.",
  "description_provenance": [
    "Author Email: abadami@vt.edu",
    "Advisor Email: ggjoseph@mmm.com",
    "Advisor Email: gwilkes@vt.edu",
    "Advisor Email: judyriffle@aol.com",
    "Advisor Email: jmcgrath@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:59Z (GMT). No. of bitstreams: 1 Badami_ETD.pdf: 6000111 bytes, checksum: a98e70f8f6f460655036931de8a22614 (MD5)   Previous issue date: 2007-10-15"
  ],
  "handle": "29469",
  "identifier_other": "etd-11052007-130520",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11052007-130520/",
  "identifier_uri": "http://hdl.handle.net/10919/29469",
  "publisher": "Virginia Tech",
  "relation_haspart": "Badami_ETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "proton exchange membrane",
    "sulfonated polymers",
    "molecular weight",
    "block length",
    "high temperature",
    "linkage group"
  ],
  "title": "Morphological and Structure-Property Analyses of Poly(arylene ether sulfone)-Based Random and Multiblock Copolymers for Fuel Cells",
  "type": "Dissertation"
}