{
  "contributor_author": "Nitowski, Gary Alan",
  "contributor_committeecochair": [
    "Dillard, John G.",
    "Wefers, Karl"
  ],
  "contributor_committeemember": [
    "Dillard, David A.",
    "Reynolds, William T. Jr.",
    "Ward, Thomas C.",
    "Wightman, James P."
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-03-14T20:17:57Z",
  "date_adate": "1998-05-11",
  "date_available": "2014-03-14T20:17:57Z",
  "date_issued": "1998-08-26",
  "date_rdate": "1999-05-11",
  "date_sdate": "1998-12-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Structural adhesive bonding offers several advantages over other types of joining.  These  include improved stress distribution and increased design flexibility.  Adhesive bonding  is important in aerospace, automotive, and packaging applications.  However, the full  potential of the technology has not been exploited because the understanding of the basic  mechanisms of adhesion and adhesion failure is incomplete.  This investigation elucidates the chemical and mechanical mechanisms responsible for  durable adhesion of epoxy resins to phosphorus oxo acid treated aluminum alloys.  By  systematically altering the adherend surface chemistry, surface topography, and adhesive  formulation, combined with accelerated testing, the chemical and mechanical factors that  influence the properties of adhesively bonded aluminum are isolated and assessed.  It is postulated that a combination of two factors determines the strength and  environmental durability of epoxy-bonded aluminum.  One is the formation of  hydrolytically stable, primary bonds between the adhesive and the adherend, and the  second is the hydrolytic stability of the surface oxide, which is always present on the  surface of aluminum and aluminum alloys.  These conditions can best be met by chemical pretreatment of the oxide surface, which  renders the oxide insoluble and creates, at the same time, functional surface sites.  These  sites can form chemical bonds with reactive components of the adhesive.  Morphological and mechanical alteration of the metal surface oxide through hydroxide  formation requires liquid water.  Liquid water can only form by capillary condensation in  interfacial gaps from molecularly diffusing water.  A hydrolytically stable oxide will  prevent bond failure due to mechanical weakening of the substrate surface, while a high  density of hydrolytically stable surface bonding sites will minimize the occurrence of  capillary gaps at the interface, thus decreasing the formation of liquid water.  It is shown  that highly chemically active, although not inherently stable, oxide surfaces can provide  environmentally stable adhesive bonds.  Conversely, certain highly stable oxide surfaces  with few chemically active sites provide no environmental stability to adhesive joints,  regardless of the topography of the surface.",
  "description_provenance": [
    "Author Email: Gary.Nitowski@Alcoa.com",
    "Advisor Email: john.dillard@vt.edu",
    "Advisor Email: dillard@vt.edu",
    "Advisor Email: reynolds@vt.edu",
    "Advisor Email: tward@chemserver.chem.vt.edu",
    "Advisor Email: wightman@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:57Z (GMT). No. of bitstreams: 1 etd.pdf: 3080498 bytes, checksum: 0e3feb58e5bceb29e52632d07dbf41e9 (MD5)   Previous issue date: 1998-08-26"
  ],
  "handle": "29461",
  "identifier_other": "etd-110498-122417",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-110498-122417/",
  "identifier_uri": "http://hdl.handle.net/10919/29461",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "phosphorous acid",
    "aluminum surface treatment",
    "vinylphosphonic acid",
    "epoxy",
    "adhesive bonding",
    "joint durability"
  ],
  "title": "Topographic and Surface Chemical Aspects of the Adhesion of  Structural Epoxy Resins to Phosphorus Oxo Acid Treated  Aluminum Adherends",
  "type": "Dissertation"
}