{
  "contributor_author": "Harris III, Charles H.",
  "contributor_committeecochair": [
    "Carlton, Patrick W.",
    "Earthman, Glen I."
  ],
  "contributor_committeemember": [
    "Gatewood, Thomas E.",
    "Parson, Stephen R.",
    "Lichtman, Marilyn V.",
    "Salmon, Richard G."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:17:57Z",
  "date_adate": "1998-05-11",
  "date_available": "2014-03-14T20:17:57Z",
  "date_issued": "1998-10-15",
  "date_rdate": "1998-05-11",
  "date_sdate": "1998-12-04",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "The purpose of this study was to describe the current schedules employed, teaming practices, and curricula used by the middle-level schools in the Commonwealth of Virginia, and it was conducted through the use of descriptive statistics.  A questionnaire was sent to experts in the area of middle school education for review and field-tested with practicing administrators in middle-level education.  The questionnaire was revised and mailed to 237 principals of the public schools in Virginia which have at least three grade levels drawn from five, six, seven, or eight but not grade levels four or nine.  Principals from 134 schools, 57 percent of middle schools in Virginia, returned the questionnaire.  Data collected from these questionnaires were used to describe the types of schedules employed, teaming practices, and curricula utilized by the participating middle schools.  The number of middle schools in Virginia has continued to grow since their reported existence in the 1970's and the Virginia Department of Education's emphasis on the use of middle school practices in 1986.  In 1985, Jessie Charles Zedd reported that there were 110 middle schools in the state.  By 1996, the Virginia Educational Directory listed 237 middle schools,  a percentage gain of 46.  An increased use of middle school flexible scheduling and interdisciplinary teaming has occurred since that study.  Most of the middle-level schools that participated in this study were mid-sized schools with 501 to 1,000 students and housing grades six, seven, and eight.   The majority of middle-level schools in the Commonwealth of Virginia was found to utilize interdisciplinary teaming and a core curriculum.  Flexible scheduling is utilized in most middle schools at grades six and seven but traditional schedules are used more frequently at grade eight.  The use of flexible scheduling and teaming decreases from the sixth grade to the eighth grade in middle schools in the Commonwealth of Virginia.  Ability grouping was reportedly used in more than 75 percent of middle schools participating in the study.  Students are required to take all core subjects in most middle-level schools in Virginia and are offered high school level classes even before the eighth grade.   The emphasis on the importance of middle-level education continues to be stressed nationally as well as within the Commonwealth of Virginia.  Middle-level practices such as flexible scheduling and interdisciplinary teaming have served as examples of effective practices being considered and utilized by high schools.  Advocates, practitioners, administrators, and teachers of the middle-level schools need to continue their emphasis on effective middle-level programs and practices for the continued improvement and success of middle schools.  Improvement in the use of flexible scheduling, interdisciplinary teaming, and fewer grouping practices should be a goal of many middle-level schools to become exemplary schools.  Middle schools should have high expectations for all and make their programs accessible to all students.  Recommendations and data reported from this study may be used as a resource by administrators and other interested practitioners to restructure their programs in order to better serve middle-level children.",
  "description_provenance": [
    "Author Email: chharris@spotsylvania.k12.va.us",
    "Advisor Email: earthman@vt.edu",
    "Made available in DSpace on 2014-03-14T20:17:57Z (GMT). No. of bitstreams: 1 chharris.PDF: 360093 bytes, checksum: 43387bd9b0c3225ea5a86505af09fe79 (MD5)   Previous issue date: 1998-10-15"
  ],
  "handle": "29462",
  "identifier_other": "etd-110498-162600",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-110498-162600/",
  "identifier_uri": "http://hdl.handle.net/10919/29462",
  "publisher": "Virginia Tech",
  "relation_haspart": "chharris.PDF",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Curriculum",
    "Middle Schools",
    "Interdisciplinary Teaming",
    "Scheduling"
  ],
  "title": "Current Scheduling, Teaming, and Curriculum Practices In Virginia's Middle Schools",
  "type": "Dissertation"
}