{
  "contributor_author": "Ye, Zhihong",
  "contributor_committeechair": "Boroyevich, Dushan",
  "contributor_committeemember": [
    "Lai, Jason",
    "Chen, Dan Y.",
    "Lee, Fred C.",
    "Nayfeh, Ali H."
  ],
  "contributor_department": "Electrical and Computer Engineering",
  "date_accessioned": "2014-03-14T20:18:01Z",
  "date_adate": "2000-11-10",
  "date_available": "2014-03-14T20:18:01Z",
  "date_issued": "2000-09-15",
  "date_rdate": "2001-11-10",
  "date_sdate": "2000-11-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation studies modeling and control issues of parallel three-phase pulse-width modulated (PWM) converters. The converters include three-phase boost rectifiers, voltage source inverters, buck rectifiers and current source inverters. The averaging of the parallel converters is performed based on a generic functional switching unit, which is called a phase leg in boost rectifiers and voltage source inverters, and a rail arm in buck rectifiers and current source inverters. Based on phase-leg and rail-arm averaging, the developed models are not only equivalent to the conventional three-phase converter models that are based on phase-to-phase averaging, but they also preserve common-mode information, which is critical in the analysis of the parallel converters. The models reveal such parallel dynamics as reactive power circulation and small-signal interaction.  A unique feature of the parallel three-phase converters is a zero-sequence circulating current. This work proposes a novel zero-sequence control concept that uses variable zero-vectors in the space-vector modulation (SVM) of the converters. The control can be implemented within an individual converter and is independent from the other control loops for the converter. Therefore, it greatly facilitates the design and expansion of a parallel system. Proper operation of the parallel converters requires an explicit load-sharing mechanism. In order to have a modular design, a droop method is recommended. Traditionally, however, a droop method has to compromise between voltage regulation and load sharing. After parametric analysis, a novel droop method using a gain-scheduling technique is proposed. The numeric analysis shows that the proposed droop method can achieve both good voltage regulation and good load sharing. An interleaving technique is often used in parallel converter systems in order to reduce current ripples. Because of its symmetrical circuit structure, the parallel three-phase converter system can reduce both differential-mode and common-mode noise with a center-aligned symmetrical SVM. Based on the concept that a symmetrical circuit can reduce common-mode dv/dt noise, a conventional three-phase, four-leg inverter is modified so that its fourth leg is symmetrical to the other three legs. The common-mode dv/dt noise can be practically eliminated with a new modulation strategy. Meanwhile, with a modified control design, the new four-leg inverter still can handle low-frequency common-mode components that occur due to unbalanced and nonlinear load.",
  "description_provenance": [
    "Author Email: zhye@vt.edu",
    "Advisor Email: laijs@vt.edu",
    "Advisor Email: dushan@vt.edu",
    "Advisor Email: chen@vt.edu",
    "Advisor Email: fclee@vt.edu",
    "Advisor Email: anayfeh@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:01Z (GMT). No. of bitstreams: 12 TOC.pdf: 26108 bytes, checksum: 790e81ba4fe0c081a70e3750f3b8a49d (MD5) Chapter6.pdf: 76931 bytes, checksum: 6c3bdaf1722e9fd22762dacb9b77631a (MD5) References.pdf: 26420 bytes, checksum: 337935a56440d19e4abeeac230300688 (MD5) Chapter8.pdf: 9412 bytes, checksum: 8aea3dcad3d6926594b9bfbd3a37e530 (MD5) Chapter7.pdf: 362921 bytes, checksum: cad7affbc30e5b451cd84512bc4ff2ae (MD5) Chapter4.pdf: 318441 bytes, checksum: 7143059e735ce8a67cf3149bcbb8a797 (MD5) Chapter3.pdf: 2072746 bytes, checksum: 688005a4bd736a3158927253d7f5ba0e (MD5) Vita.pdf: 2689 bytes, checksum: 19ff8a1addbff5198a5286f596a827a6 (MD5) Chapter1.pdf: 22842 bytes, checksum: 572f71374c058a0121ad3bb2ea837851 (MD5) Frontpages.pdf: 12980 bytes, checksum: 22db5daa9c55dcac6ab63b302f13c390 (MD5) Chapter2.pdf: 3217638 bytes, checksum: 5517237649c8a9d1f1f168c39ddbdbba (MD5) Chapter5.pdf: 178485 bytes, checksum: f8b787a528bf781b8beb9ac1467bc030 (MD5)   Previous issue date: 2000-09-15"
  ],
  "handle": "29476",
  "identifier_other": "etd-11062000-08510043",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11062000-08510043/",
  "identifier_uri": "http://hdl.handle.net/10919/29476",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "TOC.pdf",
    "Chapter6.pdf",
    "References.pdf",
    "Chapter8.pdf",
    "Chapter7.pdf",
    "Chapter4.pdf",
    "Chapter3.pdf",
    "Vita.pdf",
    "Chapter1.pdf",
    "Frontpages.pdf",
    "Chapter2.pdf",
    "Chapter5.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "circulating current",
    "common-mode noise",
    "multi-phase converter",
    "four-leg converter",
    "PWM converters",
    "zero-sequence",
    "current-bidirectional",
    "current-unidirectional",
    "load sharing",
    "parallel",
    "three-phase"
  ],
  "title": "Modeling and Control of Parallel Three-Phase PWM Converters",
  "type": "Dissertation"
}