{
  "contributor_author": "Sucre, Eric Brandon",
  "contributor_committeechair": "Fox, Thomas R.",
  "contributor_committeemember": [
    "Haas, Carola A.",
    "Aust, Wallace Michael",
    "Loftis, David L.",
    "Jones, Robert H."
  ],
  "contributor_department": "Forestry",
  "date_accessioned": "2014-03-14T20:18:00Z",
  "date_adate": "2008-12-02",
  "date_available": "2014-03-14T20:18:00Z",
  "date_issued": "2008-10-21",
  "date_rdate": "2008-12-02",
  "date_sdate": "2008-11-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The Southern Appalachian hardwood forests contain a wide diversity of flora and fauna.  Understanding processes that affect nutrient availability in these forests is essential for sound forest management.  Three interconnected research projects regarding soil resource heterogeneity were designed to increase our understanding of this ecosystem. The objective of these projects were as follows: 1) to examine and quantify the role of decaying stumps in regards to total carbon (C) and nitrogen (N) pools and fine-root dynamics, 2) compare and contrast the use of ground-penetrating radar (GPR) vs. a soil auger for estimating soil depth and site quality and 3) to evaluate how eastern red-backed salamanders (Plethodon cinereus) affect N-availability. For the stump study, results show that decomposing stumps occupy approximately 1.2% of the total soil volume and constitute 4% and 10% of total soil N and C pools.  Significant differences in N (p = 0.0114), C (p = 0.0172), microbial biomass C (p = 0.0004), potentially mineralizable N (p = 0.0042), and extractable NH4+ (p = 0.0312) concentrations were observed when compared to mineral soil horizons.  In particular, potentially mineralizable N was 2.5 times greater in stump soil than the A-horizon (103 vs. 39 mg kg-1), 2.7 times greater for extractable NH4+ (16 vs. 6 mg kg-1) and almost 4 times greater for MBC (1528 vs. 397 mg kg-1).  These measured properties suggest higher N-availability, organic matter turnover and N uptake in stump soil versus the bulk soil.  19% of the total fine root length and 14% of fine root surface area also occurred in the stump soil.  The increased fine root length suggests higher concentrations of labile nutrient in the stumps since roots often proliferate in areas with higher nutrient availability. Significant differences occurred in N and C concentrations between all four decay classes and the A-horizon, which validated the use of this system and the need to calculate weighted averages based on the frequency and soil volume influenced by each decay class.   In the GPR Study, depth estimations were shallower using a soil auger compared to estimates obtained using GPR across all plots (p = 0.0002; Figure 3.4). On a soil volume basis, this was equivalent to about 3500 m3 of soil per hectare unaccounted for using traditional methods. In regards to using soil depth as a predictor for site quality, no significant relationships were observed with soil depth estimations obtained from the auger (Table 3.3).  On the other hand, depth measurements from GPR explained significant amounts of variation across all sites and by physiographic region.  Across all sites, soil depth estimates from GPR explained 45.5% of the residual variation (p = 0.001; Table 3.3).  When the data were stratified by physiographic region, a higher amount of variation was explained by the regression equations; 85% for the Cumberland Plateau (p = 0.009), 86.7% for the Allegheny Plateau (0.007) and 66.7% for the Ridge and Valley (p = 0.013), respectively (Table 4.2).   Results from this study demonstrate how inaccurate current methods can be for estimating soil depth rocky forests soils.  Furthermore, depth estimations from GPR can be used to increase the accuracy of site quality in the southern Appalachians. In the salamander study, no significant salamander density treatment or treatment by time effects were observed over the entire study period (p < 0.05).  However, when the data were separated by individual sampling periods a few significant treatment by time interactions occurred: 1) during August 2006 for available NH4+ under the forest floor (i.e. horizontal cation membranes; p = 0.001), 2) August and 3) September 2006 for available NH4+ in the A-horizon (p = 0.026), and 4) May 2007 for available NO3- under the forest floor (p = 0.011). As a result of these trends, an index of cumulative N-availability (i.e. NH4+ and NO3-) under the forest floor and in the A-horizon was examined through the entire study period.  Cumulative N-availability under the forest floor was consistently higher in the low- and medium-density salamander treatments compared to the high-density treatment. For cumulative N-availability in the A-horizon, a gradient of high to low N-availability existed as salamander density increased. Factors such as a prolonged drought in 2007 may have affected our ability to accurately assess the effects of salamanders on N-availability. We concluded that higher salamander densities do not increase N-availability.   Implementing methodologies that accurately account for soil nutrient pools such as stump soil, physical properties such as depth and fauna such as salamanders, increase our understanding of factors that regulate site productivity in these ecosystems. As a result, landscape-level and stand-level management decisions can be conducted more effectively.",
  "description_provenance": [
    "Author Email: eric.sucre@weyerhaeuser.com",
    "Advisor Email: cahaas@vt.edu",
    "Advisor Email: waust@vt.edu",
    "Advisor Email: dloftis@fs.fed.us",
    "Advisor Email: trfox@vt.edu",
    "Advisor Email: rhjones@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:00Z (GMT). No. of bitstreams: 1 Sucre_Dissertation.pdf: 13586752 bytes, checksum: a9907a680beb3f170e54c283bb0181bf (MD5)   Previous issue date: 2008-10-21"
  ],
  "handle": "29470",
  "identifier_other": "etd-11052008-093555",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11052008-093555/",
  "identifier_uri": "http://hdl.handle.net/10919/29470",
  "publisher": "Virginia Tech",
  "relation_haspart": "Sucre_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "fine root dynamics",
    "Appalachian hardwoods",
    "nutrient cycling",
    "soil heterogeneity",
    "ground-penetrating radar",
    "salamanders",
    "decomposing stumps",
    "microbial biomass"
  ],
  "title": "Soil resource heterogeneity and site quality in Southern Appalachian hardwood forests: Impact of decomposing stumps, geology and salamander abundance",
  "type": "Dissertation"
}