{
  "contributor_author": "Sarver, Emily Allyn",
  "contributor_committeechair": "Edwards, Marc A.",
  "contributor_committeemember": [
    "Parks, Jeffrey",
    "Dietrich, Andrea M.",
    "Luttrell, Gerald H.",
    "Corcoran, Sean Gerald"
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:18:00Z",
  "date_adate": "2010-11-17",
  "date_available": "2014-03-14T20:18:00Z",
  "date_issued": "2010-11-01",
  "date_rdate": "2012-03-07",
  "date_sdate": "2010-11-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Non-uniform corrosion of copper and brass in potable water systems poses both economic and environmental problems associated with premature plumbing failures and release of metals. With respect to copper pitting corrosion, it was found that forensic testing (i.e., in pipe-loops) is  the only investigative technique that can closely mimic conditions found in real water systems and produce unambiguous results; and, if used in combination with electrochemical techniques, it may also provide some mechanistic insights into the pitting process. Using pipe-loops, it was demonstrated that copper pitting in aggressive water qualities (i.e., chlorinated, high pH and low alkalinity) is deterministic and reproducible. Additionally, the effects of various chemical and physical factors on pitting were investigated. Overall, increased flow velocity and frequency, increased chlorine residual and decreased hardness were found to accelerate pitting; whereas increased phosphate and silica were found to decelerate pitting. <p> Several mitigation strategies for copper pitting in aggressive water were further investigated, and experimental data were interpreted utilizing electrochemical theory to evaluate specific effects on the initiation and propagation phases of pitting. Surprisingly, it was found that decreased chlorine may delay pit initiation, however, even relatively low levels of chlorine may eventually initiate and propagate pits. Increased alkalinity appears to decelerate pit growth, but does not prevent pit initiation. NOM can delay pit initiation and propagation, although the potential for DBP formation in chlorinated waters makes inhibition by NOM an unfavorable alternative. At sufficient dosages, phosphate and silica corrosion inhibitors may completely stop pitting, consistent with the success of several field trials. At very low dosages, phosphate and silica may actually accelerate pinhole failures, so these inhibitors should not be under-dosed. <p> While brass alloys exist that can limit dezincification problems, they are not always utilized in potable water applications due to high costs, and so dezincification is a re-emerging issue in some countries, including the US. Little research has been conducted in the past several decades regarding the effects of water chemistry, and almost no work has addressed the roles of physical factors associated with real plumbing systems. Thus, a comprehensive review of these topics was conducted. <p> To better understand the effects of some factors associated with specific plumbing installations on dezincification and other brass corrosion types, a series of pipe-loop studies was carried out. It was confirmed that increased oxidant delivery rates to cathodic surfaces, either via increased oxidant concentration or increased flow velocity, can increase corrosion rates. Several key differences were observed with respect to corrosion of brass located in copper plumbing tube systems as opposed to plastic. When copper tubes contribute copper ions to water, brass corrosion becomes more selective for zinc; but if galvanic connections are made between the copper tubes and brass, selectivity for zinc is reduced while overall corrosion rates are accelerated. As opposed to copper tubing, plastic maintains oxidant (e.g., free chlorine) levels, and may thereby increase brass corrosion and build-up of corrosion by-products. Finally, it was found that increased temperature can significantly increase lead leaching from brass. <p> Following recent outbreaks of brass dezincification failures, NSF/ANSI Standard 14 has been revised to require that all NSF 14-listed brass is dezincification resistant, as certified by satisfactory results from an accelerated test method (ISO 6509). Various brasses were tested using this method as well as a longer-term jar method utilizing real potable water. Results of the two tests were in good agreement with respect to dezincification, specifically; but some inconsistencies were observed with respect to uniform corrosion and lead leaching.",
  "description_provenance": [
    "Author Email: esarver@vt.edu",
    "Advisor Email: jparks@vt.edu",
    "Advisor Email: andread@vt.edu",
    "Advisor Email: luttrell@vt.edu",
    "Advisor Email: sgc@vt.edu",
    "Advisor Email: edwardsm@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:00Z (GMT). No. of bitstreams: 1 Sarver_EA_D_2010.pdf: 3364859 bytes, checksum: 0159a85bc747743ca192504fa9b7d767 (MD5)   Previous issue date: 2010-11-01"
  ],
  "handle": "29474",
  "identifier_other": "etd-11052010-155843",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11052010-155843/",
  "identifier_uri": "http://hdl.handle.net/10919/29474",
  "publisher": "Virginia Tech",
  "relation_haspart": "Sarver_EA_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "pipe-loop testing",
    "non-uniform corrosion",
    "brass lead leaching",
    "brass dezincification",
    "copper pitting",
    "corrosion inhibitors"
  ],
  "title": "Insights Into Non-Uniform Copper and Brass Corrosion in Potable Water Systems",
  "type": "Dissertation"
}