{
  "contributor_author": "du Plessis, Sarah Browning",
  "contributor_committeecochair": [
    "Earthman, Glen I.",
    "Driscoll, Lisa G."
  ],
  "contributor_committeemember": [
    "Martin, Rosalie Marie",
    "Creighton, Theodore B."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:18:00Z",
  "date_adate": "2008-12-03",
  "date_available": "2014-03-14T20:18:00Z",
  "date_issued": "2008-10-27",
  "date_rdate": "2011-09-05",
  "date_sdate": "2008-11-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to describe the leadership practices of women superintendents of public school divisions. The researcher interviewed eight women superintendents in the Commonwealth of Virginia examining the participantsâ   self-perceived leadership practices and their reflections of these practices. Data collection occurred through use of interviews, member checks, field notes, a reflexive journal and completion of the Leadership Practices Inventory-SELF. Descriptive accounts of the womenâ  s leadership practices in the context of their professional lived experiences and within the framework of transformational leadership theory are presented in a narrative format. Findings and conclusions, were determined by analyzing the collected data, the research question and the review of literature. The findings produced eight leadership practices: 1) use consistent and accurate communication with all stakeholders, 2) be visible, 3) use limited delegation, 4) be collaborative, 5) remain poised, 6) accept personal sacrifice of time and family, 7) exhibit confident, and 8) self-educate, be a quick learner. The findings concluded that women described their leadership practices as relationship building practices and practices incorporating issues of gender and silencing. An implication for future research included discussion for a study which would go beyond the self-described leadership practices of the women superintendents and examine how their leadership practices are implemented and perceived by stakeholders and employees. Data from these direct observations may offer further, detailed insights as to how the described leadership practices of this study are practiced, implemented and perceived by others.",
  "description_provenance": [
    "Author Email: sduplessis@vt.edu",
    "Advisor Email: rowhite@vt.edu",
    "Advisor Email: tcreigh@vt.edu",
    "Advisor Email: earthman@vt.edu",
    "Advisor Email: ldriscol@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:00Z (GMT). No. of bitstreams: 1 DU-PLESSIS-DISSERTATION-11.2008.pdf: 2024693 bytes, checksum: 0d20a889739a7975f489808e752c4e66 (MD5)   Previous issue date: 2008-10-27"
  ],
  "handle": "29471",
  "identifier_other": "etd-11052008-121745",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11052008-121745/",
  "identifier_uri": "http://hdl.handle.net/10919/29471",
  "publisher": "Virginia Tech",
  "relation_haspart": "DU-PLESSIS-DISSERTATION-11.2008.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "leadership practices",
    "school administration",
    "gender",
    "women",
    "superintendent"
  ],
  "title": "Leadership Practices of Women Superintendents: A Qualitative Study",
  "type": "Dissertation"
}