{
  "contributor_author": "Ameen, Shafeeq Aqeel",
  "contributor_committeechair": "Twiford, Travis W.",
  "contributor_committeemember": [
    "Roberts, James T.",
    "Creighton, Theodore B.",
    "Cash, Carol S."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:18:00Z",
  "date_adate": "2009-12-09",
  "date_available": "2014-03-14T20:18:00Z",
  "date_issued": "2009-10-27",
  "date_rdate": "2011-09-05",
  "date_sdate": "2009-11-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The JROTC program is one of service and commitment.  Its mission is to build better citizens and give them a sense of pride in service to their fellow man.  Today these core principles are still needed, but with the increase in the student dropout rate, the JROTC program can be one of many alternatives needed to help public education reach todayâ  s youth who are struggling to stay in school.<p>      The purpose of this mixed methods study was to examine the impact of the Air Force JROTC Leadership Program on the grade point average (GPA), attendance rate, disciplinary referrals, and dropout rate of JROTC students at an urban high school in southeastern Virginia.  The study also addressed the perceptions of school administrators, Air Force JROTC instructors, teachers, JROTC students and their parents on students enrolled in the program during the 2005-2009 school years.  <p>      Descriptive statistics were used to determine the means, standard deviations and frequency distributions for the groups in the study. Three independent sample t-tests and seven one-way Analysis of Variance (ANOVAâ  s) were used to determine where there was a statistically significant difference for each group.  The Tukey post hoc procedure was used to determine where the difference occurred in the variables.  <p>      There were three major findings revealed in this study.  The first finding indicated that students who participated in the JROTC program had lower grade point averages  (M =2.47, SD = 1.17) than non-JROTC participants (M = 3.00, SD = 0.94).  Second, administrators had higher levels of agreement (100%) than AFJROTC instructors, teachers, JROTC students and parents that leadership skills were developed in the AFJROTC program. Third, JROTC students (12%) and parents (7%) had lower levels of agreement than administrators, AFJROTC instructors and teachers that the AFJROTC program is used as a recruitment tool.<p>      Focus groups results showed strong support for the program from administrators, teachers, JROTC students and parents.  These findings suggest that if school districts and educational leaders are to benefit from implementing the AFJROTC program they must understand that the program is not designed to impact academics. The program is designed to develop leadership skills along with helping students become better citizens.  Educational leaders in school districts should read the findings and consider utilizing the program as a possible alternative to help students to develop skills to keep them from dropping out of school.",
  "description_provenance": [
    "Author Email: deniseameen@aol.com",
    "Advisor Email: Jim.Roberts@cpshools.com",
    "Advisor Email: tcreigh@vt.edu",
    "Advisor Email: ccash48@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:00Z (GMT). No. of bitstreams: 1 Ameen_AQ_D_2009.pdf: 635712 bytes, checksum: 25f855451f3accba2b04728654f93a03 (MD5)   Previous issue date: 2009-10-27"
  ],
  "handle": "29473",
  "identifier_other": "etd-11052009-072138",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11052009-072138/",
  "identifier_uri": "http://hdl.handle.net/10919/29473",
  "publisher": "Virginia Tech",
  "relation_haspart": "Ameen_AQ_D_2009.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Disciplinary Referrals",
    "Attendance Rate",
    "GPA",
    "JROTC",
    "Dropout Rate"
  ],
  "title": "A Mixed Methods Study of the Air Force Jrotc Leadership Program at an Urban High School in Southeastern Virginia",
  "type": "Dissertation"
}