{
  "contributor_author": "Rayfield III, James Denard",
  "contributor_committeechair": "Parson, Stephen R.",
  "contributor_committeemember": [
    "Twiford, Travis W.",
    "Krill, Cecelia W.",
    "Roberts, James T.",
    "Yakimowski-Srebnick, Mary E."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:18:01Z",
  "date_adate": "2002-11-27",
  "date_available": "2014-03-14T20:18:01Z",
  "date_issued": "2002-10-22",
  "date_rdate": "2003-11-27",
  "date_sdate": "2002-11-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "Educators across the nation are rethinking the organization of the high school day in relation to time as they face the challenges of a new century. Block scheduling, the use of extended periods of time for learning, is one response to the reorganization of the high school where in Virginia during the 2000-2001 school year, 74% of the high schools were on some form of block scheduling. Two models of block scheduling continue to receive attention in the review of educational literature. They are the alternating day or A-B model and the 4 x 4 model. Although there are numerous qualitative research studies regarding the effects of block scheduling on school climate and student achievement, there is limited quantitative evidence that supports the use of block scheduling to improve student academic achievement on criterion-referenced standardized test scores. This study compared the effects of the 7-period alternating day schedule, the 4 x 4 block schedule, and the traditional single-period schedule on high school student academic achievement as measured by the Virginia Stanards of Learning (SOL) end-of-course assessments. An Analysis of Variance was used as the primary tool to test for mean differences between the test scores. The results indicated that the mean scaled scores for the 7-period alternating day were significantly higher (p<.05) than the mean scaled scores for the 4 x 4 block on the English:Reading, English:Writing, and geometry SOL end-of-course tests. In addition, the mean scaled scores for the 7-period alternating day and the traditional schedule were significantly higher (p<.05) than the 4 x 4 block on the English:Writing SOL end-of-course tests. It appears that the 7-period alternating day schedule has merit in terms of English and geometry instruction. Division and school leaders will want to explore the effects of the 7-period alternating day schedule on English and geometry courses. As a new century unravels, the question of time and how it is used for student learning will continue to be a major focus. Educational leaders must continue to work together with teachers to design and to develop a high school schedule that will provide a maximum learning experience for all students.",
  "description_provenance": [
    "Author Email: jrayfiel3@cox.net",
    "Advisor Email: ttwiford@vt.edu",
    "Advisor Email: parson@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:01Z (GMT). No. of bitstreams: 7 Dissertation.PDF: 76093 bytes, checksum: 36e73cc4c0bf7607ea1c5241be3fd5d7 (MD5) Title.pdf: 8356 bytes, checksum: 4d07c2e5ea4a515bc4b9e26b01bce15d (MD5) CHAPTERIII.pdf: 21312 bytes, checksum: edd853868183675bc3772c042dba1683 (MD5) Appendix_ABC.pdf: 33424 bytes, checksum: d18d9db5c00a9268fe1cbc2712373a10 (MD5) REFERENCES.pdf: 14025 bytes, checksum: f00a1565567a4c4032c819f37f95dfc7 (MD5) CHAPTERIV.pdf: 34820 bytes, checksum: 0860e944575dc5825239e533c52622a8 (MD5) CHAPTERV.pdf: 31740 bytes, checksum: a955dd33815e73fe9306cf15be7b0498 (MD5)   Previous issue date: 2002-10-22"
  ],
  "handle": "29478",
  "identifier_other": "etd-11062002-181858",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11062002-181858/",
  "identifier_uri": "http://hdl.handle.net/10919/29478",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Dissertation.PDF",
    "Title.pdf",
    "CHAPTERIII.pdf",
    "Appendix_ABC.pdf",
    "REFERENCES.pdf",
    "CHAPTERIV.pdf",
    "CHAPTERV.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Achievement",
    "Block Scheduling",
    "Standards of Learning"
  ],
  "title": "Effects of Two Models of High School Block Scheduling on The Virginia Standards of Learning Assessments",
  "type": "Dissertation"
}