{
  "contributor_author": "Kamminga, Katherine Lee",
  "contributor_committeechair": "Herbert, David Ames Jr.",
  "contributor_committeemember": [
    "Huckaba, Randy M.",
    "Mullins, Donald E.",
    "Pfeiffer, Douglas G.",
    "Kuhar, Thomas P."
  ],
  "contributor_department": "Entomology",
  "date_accessioned": "2014-03-14T20:18:00Z",
  "date_adate": "2008-11-20",
  "date_available": "2014-03-14T20:18:00Z",
  "date_issued": "2008-10-23",
  "date_rdate": "2011-09-05",
  "date_sdate": "2008-11-05",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Stink bugs are major pests of agricultural crops throughout Virginia and much of the United States.  Knowledge of the biology, the species complex, and insecticide susceptibility can improve management.  A survey was conducted in Virginia to determine the species complex in soybean and cotton and to monitor for nonnative species.  Seven stink bug species were identified.  Acrosternum hilare (Say) and Euschistus servus (Say) were the most common.  Two sampling methods, the sweep net and the beat sheet, were assessed in soybean and cotton.  There was less variability with the sweep net method compared to the beat sheet method.<p> Laboratory bioassays and field trials were conducted to evaluate the toxicity and efficacy of selected conventional and organic insecticides against A. hilare and E. servus.  In bioassays with conventional insecticides, A. hilare adults and nymphs were susceptible to all pyrethroids tested.  Generally, the neonicotinoids, dinotefuran and clothianidin, were more toxic to A. hilare, while thiamethoxam and acetamiprid were more toxic to E. servus. In soybean field efficacy trials, dinotefuran performed comparably to the organophosphates and pyrethroids. <p> Laboratory bioassays with organic insecticides resulted in moderate to high levels of mortality, and in antifeedant and repellency responses.  Likewise, soybean field trials indicated that a single application can reduce stink bug numbers for up to two days after treatment; however in tomato field trials multiple weekly applications did not result in significant reductions in stink bug damage.  <p> A weather model to predict abundance of A. hilare adults was developed using weekly black light trap catch data collected from 1990 to 2007 at a single location.  The two weather variables that resulted in a significant model were days below freezing and mean monthly precipitation from January to April.  The model was validated by correlating five independent data sets to predicted weekly trap catch.  Mean trap catch plotted over time showed three peaks.  In accordance with A. hilare developmental rates, the peaks indicated that two generations and a partial third occur in Virginia.  Cumulative trap catch estimated from the 18-yr trap catch mean showed that 10, 50, and 90% of the total seasonal catch should occur by 153, 501, and 1066 degree days, respectively.",
  "description_provenance": [
    "Author Email: kamminga@vt.edu",
    "Advisor Email: herbert@vt.edu",
    "Advisor Email: rmhuckaba@dow.com",
    "Advisor Email: mullinsd@vt.edu",
    "Advisor Email: dgpfeiff@vt.edu",
    "Advisor Email: tkuhar@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:00Z (GMT). No. of bitstreams: 1 KKamminga_Dissertation.pdf: 613377 bytes, checksum: 37fdaac04e7c5ed8c5c37aa619ccf9ea (MD5)   Previous issue date: 2008-10-23"
  ],
  "handle": "29472",
  "identifier_other": "etd-11052008-161122",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11052008-161122/",
  "identifier_uri": "http://hdl.handle.net/10919/29472",
  "publisher": "Virginia Tech",
  "relation_haspart": "KKamminga_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "organic insecticide efficacy",
    "insecticide efficacy",
    "bioassays",
    "Euschistus servus",
    "Acrosternum hilare",
    "modeling"
  ],
  "title": "Species survey, monitoring and management of economically important stink bug species in eastern Virginia",
  "type": "Dissertation"
}