{
  "contributor_author": "Williams, Robert C.",
  "contributor_committeechair": "Vorster, Michael C.",
  "contributor_committeecochair": "Hildreth, John C.",
  "contributor_committeemember": [
    "de la Garza, Jesus M.",
    "Pethtel, Ray D.",
    "Songer, Anthony D."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:18:02Z",
  "date_adate": "2008-11-25",
  "date_available": "2014-03-14T20:18:02Z",
  "date_issued": "2008-11-04",
  "date_rdate": "2008-11-25",
  "date_sdate": "2008-11-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Knowledge of construction duration is pertinent to a number of project planning functions prior to detailed design development.  Funding, financing, and resource allocation decisions take place early in project design development and are significantly influenced by the construction duration.  Currently, there is not an understanding of the project factors having a statistically significant relationship with highway construction duration.  Other industry sectors have successfully used statistical regression analysis to identify and model the project parameters related to construction duration.  While the need is seen for such work in highway construction, there are very few studies which attempt to identify duration-influential parameters and their relationship with the highway construction duration.  <p>This research identifies the project factors, known early in design development, which influence highway construction duration.  The factors identified are specific to their respective project types and are those factors which demonstrate a statistically-significant relationship with construction duration.  This work also quantifies the relationship between the duration-influential factors and highway construction duration.  The quantity, magnitude, and sign of the factor coefficient yields evidence regarding the importance of the project factor to highway construction duration.  Finally, the research incorporates the duration-influential project factors and their relationship with highway construction duration into mathematical models which assist in the prediction of construction duration.  Full and condensed models are presented for Full-Depth Section and Highway Improvement project types.  This research uses statistical regression analysis to identify, quantify, and model these early-known, duration-influential project factors.  <p>The results of this research contribute to the body of knowledge of the sponsoring organization (Virginia Department of Transportation), the highway construction industry, and the general construction industry at large.",
  "description_provenance": [
    "Author Email: rcwill04@vt.edu",
    "Advisor Email: chema@vt.edu",
    "Advisor Email: rpethtel@vt.edu",
    "Advisor Email: adsonger@vt.edu",
    "Advisor Email: john.hildreth@uncc.edu",
    "Advisor Email: mikev@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:02Z (GMT). No. of bitstreams: 1  RCW_Dissertation_ETD2.pdf: 1526281 bytes, checksum: d898c8cd43a8b9d45918b2dc2c3cd099 (MD5)    Previous issue date: 2008-11-04"
  ],
  "handle": "29483",
  "identifier_other": "etd-11062008-085348",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11062008-085348/",
  "identifier_uri": "http://hdl.handle.net/10919/29483",
  "publisher": "Virginia Tech",
  "relation_haspart": "RCW_Dissertation_ETD2.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Highway Construction Duration",
    "Multiple Linear Regression Analysis",
    "Duration-Influential Project Factors"
  ],
  "title": "The Development of Mathematical Models for Preliminary Prediction of Highway Construction Duration",
  "type": "Dissertation"
}