{
  "contributor_author": "Peng, Wei",
  "contributor_committeechair": "Bosch, Darrell J.",
  "contributor_committeemember": [
    "Mostaghimi, Saied",
    "Taylor, Daniel B.",
    "Phipps, Patrick M.",
    "Alley, Marcus M.",
    "McGuirk, Anya M.",
    "Pease, James W."
  ],
  "contributor_department": "Agricultural and Applied Economics",
  "date_accessioned": "2014-03-14T20:18:03Z",
  "date_adate": "2001-11-13",
  "date_available": "2014-03-14T20:18:03Z",
  "date_issued": "2001-09-21",
  "date_rdate": "2002-11-13",
  "date_sdate": "2001-11-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Nitrogen (N) is a key nutrient input to crops and one of the major pollutants to the environment from agriculture in the United States. Recent developments in site-specific management (SSM) technology have the potential to reduce both N overapplication and underapplication and increase farmers' net returns. In Virginia, due to the high variability of within-field yield-limiting factors such as soil physical properties and fertility, the adoption of SSM is hindered by high grid&#64979;sampling cost. Many Virginia corn-wheat-soybean farms have practiced generating yield maps using yield monitors for several years even though few variable applications based on yield maps were reported. It is unknown if the information generated by yield monitors under actual production situations can be used to direct N management for increased net returns in this area.    The overall objective of the study is to analyze the economic and environmental impact of alternative management strategies for N in corn and wheat production based on site-specific information in eastern Virginia. Specifically, evaluations were made of three levels of site-specific information regarding crop N requirements combined with variable and uniform N application. The three levels of information are information about the yield potential of the predominant soil type within the field, information about yield potentials of all soils within the field (soil zones), information about yield potentials of smaller sub-field units which are aggregated into functional zones. Effects of information on expected net returns and net N (applied N that is not removed by the crop) were evaluated for corn-wheat-soybean fields in eastern Virginia. Ex post and ex ante evaluations of information were carried out.    Historical weather data and farm-level yield data were used to generate yield sequences for individual fields. A Markov chain model was used to describe both temporal and spatial yield variation. Soil maps were used to divide a field into several soil management units. Cluster analysis was used to group sub&#64979;field units into functional zones based on yield monitor data.  Yield monitor data were used to evaluate ex post information and variable application values for 1995-1999, and ex ante information and variable application values for 1999.    Ex post analysis results show that soil zone information increased N input but decreased net return, while functional zone information decreased N input and increased net returns. Variable application decreased N input compared with uniform application. Variable application based on soil zone information reduced net return due to cost of overapplication or underapplication. Variable application based on functional information increased net return.    Ex ante results show that information on spatial variability was not able to increase farmers?net return due to the cost of variable N application and information. Variable rate application decreases N input relative to uniform application. However, imprecision in the spatial predictor makes the variable application unprofitable due to an imbalance between costs of under- and over-application of N. Sensitivity analysis showed that value of information was positive when temporal uncertainty was eliminated.    The ex post results of this study suggest there is potential to improve efficiency of N use and farmers?net returns with site specific management techniques. The ex ante results suggest that site specific management improvements should be tested under conditions faced by farmers including imperfect information about temporal and spatial yield variability.",
  "description_provenance": [
    "Author Email: pengw@vt.edu",
    "Advisor Email: smostagh@vt.edu",
    "Advisor Email: taylord@vt.edu",
    "Advisor Email: pmphipps@vt.edu",
    "Advisor Email: malley@vt.edu",
    "Advisor Email: mcguirk@vt.edu",
    "Advisor Email: peasej@vt.edu",
    "Advisor Email: bosch@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:03Z (GMT). No. of bitstreams: 1 dissertation_true.PDF: 684698 bytes, checksum: 2477739476e20cd0815ebb31308a2dc6 (MD5)   Previous issue date: 2001-09-21"
  ],
  "handle": "29485",
  "identifier_other": "etd-11072001-182352",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11072001-182352/",
  "identifier_uri": "http://hdl.handle.net/10919/29485",
  "publisher": "Virginia Tech",
  "relation_haspart": "dissertation_true.PDF",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Markov Chain",
    "Nitrogen",
    "Cluster Analysis",
    "Site-Specific Management",
    "Variable Application",
    "Information"
  ],
  "title": "Improving Nitrogen Management in Corn- Wheat-Soybean Rotations Using Site Specific Management in Eastern Virginia",
  "type": "Dissertation"
}