{
  "contributor_author": "Grant, Elizabeth Joyce",
  "contributor_committeechair": "Jones, James R.",
  "contributor_committeemember": [
    "Schubert, Robert P.",
    "Wakefield, Ronald R.",
    "Wynn, Theresa M."
  ],
  "contributor_department": "Architecture",
  "date_accessioned": "2014-03-14T20:18:02Z",
  "date_adate": "2007-11-26",
  "date_available": "2014-03-14T20:18:02Z",
  "date_issued": "2007-10-30",
  "date_rdate": "2007-11-26",
  "date_sdate": "2007-11-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p> Design frequently involves a series of trade-offs to obtain the \"optimal\" solution to a design problem.  Green roofs have many different characteristics based on a variety of variables.  Designers typically weigh the impacts of these characteristics in an implicit process based on intuition or past experience.  But since vegetated roofing is a relatively complex and comparatively new technology to many practitioners, a rational, explicit method to help organize and rank the trade-offs made during the design process is useful.   </p><p> This research comprises the creation of a framework diagramming the decision process involved in the selection of vegetated roofing systems. Through a series of expert interviews and case studies, the available knowledge is captured and organized to determine the critical parameters affecting design decisions.  A set of six case study projects in North America is analyzed and six critically important evaluative categories are identified:  storm water management, energy consumption, acoustics, structure, compliance with regulatory guidelines and governmental incentives, and cost.  These six factors are key decision-making parameters in the selection of vegetated roofing systems and they form the basis of this study.  They are addressed in the context of a decision support system for green roof designers.  A summation of the total importance of the advantages represented by each alternative is used to determine the most feasible green roof system for a particular project. The decision-making framework developed in this dissertation will ultimately be adaptable to digital processing and a computer-based design assistance tool.</p>",
  "description_provenance": [
    "Author Email: elgrant2@vt.edu",
    "Advisor Email: wolverine@vt.edu",
    "Advisor Email: silver@vt.edu",
    "Advisor Email: ron.wakefield@rmit.edu.au",
    "Advisor Email: tesswynn@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:02Z (GMT). No. of bitstreams: 2 01DISSERTATION.pdf: 5965457 bytes, checksum: 760cc4d32295a4dfe51a6f5148cf9c0f (MD5) 02APPENDIX.pdf: 10649612 bytes, checksum: 3452f2af150c3ea428e0d207932b5d47 (MD5)   Previous issue date: 2007-10-30"
  ],
  "handle": "29482",
  "identifier_other": "etd-11062007-232745",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11062007-232745/",
  "identifier_uri": "http://hdl.handle.net/10919/29482",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "01DISSERTATION.pdf",
    "02APPENDIX.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "decision support system",
    "Choosing By Advantages",
    "green roof"
  ],
  "title": "A Decision-Making Framework for Vegetated Roofing System Selection",
  "type": "Dissertation"
}