{
  "contributor_author": "Kniola, David",
  "contributor_committeechair": "Janosik, Steven M.",
  "contributor_committeemember": [
    "Skaggs, Gary E.",
    "Chang, Mido",
    "Hirt, Joan B."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:18:02Z",
  "date_adate": "2009-11-24",
  "date_available": "2014-03-14T20:18:02Z",
  "date_issued": "2009-10-29",
  "date_rdate": "2009-11-24",
  "date_sdate": "2009-11-06",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Two broad influences have converged to shape a new environment in which universities must now compete and operate. Shrinking financial resources and a global economy have arguably compelled universities to adapt. The concept of academic capitalism helps explain the new realities and places universities in the context of a global, knowledge-based economy (Slaughter & Leslie, 1997). Prior to this theory, the role of universities in the knowledge economy was largely undocumented. Academic capitalism is a measurable concept defined by the mechanisms and behaviors of universities that seek to generate new sources of revenue and are best revealed through faculty work. This study was designed to create empirical evidence of academic capitalism through the behaviors of faculty members at research universities. Using a large-scale, national database, the researcher created a new measureâ  an estimate of academic capitalismâ  at the individual faculty member level and then used multi-level analysis to explain variation among these individual faculty members. This study will increase our understanding of the changing nature of faculty work, will lead to future studies on academic capitalism that involve longitudinal analysis and important sub-populations, and will likely influence institutional and public policy.",
  "description_provenance": [
    "Author Email: dkniola@vt.edu",
    "Advisor Email: gskaggs@vt.edu",
    "Advisor Email: mchang@vt.edu",
    "Advisor Email: jbhirt@vt.edu",
    "Advisor Email: sjanosik@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:02Z (GMT). No. of bitstreams: 1 Kniola_DJ_D_2009.pdf: 1279898 bytes, checksum: 4bfe000158ac6ef647b35e4cd9aed35f (MD5)   Previous issue date: 2009-10-29"
  ],
  "handle": "29484",
  "identifier_other": "etd-11062009-133835",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11062009-133835/",
  "identifier_uri": "http://hdl.handle.net/10919/29484",
  "publisher": "Virginia Tech",
  "relation_haspart": "Kniola_DJ_D_2009.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Hierarchical Linear Modeling",
    "Item Response Theory",
    "University Faculty",
    "Academic Capitalism"
  ],
  "title": "Constructing an Estimate of Academic Capitalism and Explaining Faculty Differences through Multilevel Analysis",
  "type": "Dissertation"
}