{
  "contributor_author": "Perdomo-Rivera, Jose Luis",
  "contributor_committeechair": "Thabet, Walid",
  "contributor_committeemember": [
    "Auchey, Flynn L.",
    "Beliveau, Yvan J.",
    "Martinez, Julio C.",
    "Badinelli, Ralph D."
  ],
  "contributor_department": "Environmental Design and Planning",
  "date_accessioned": "2014-03-14T20:18:14Z",
  "date_adate": "2004-12-08",
  "date_available": "2014-03-14T20:18:14Z",
  "date_issued": "2004-11-01",
  "date_rdate": "2004-12-08",
  "date_sdate": "2004-11-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Materials are one of the areas that require special attention while creating a project's master plan as well as during the daily construction progress. The absence of materials when needed is one of the main causes of loss of productivity at a jobsite. Inefficient materials management can lead to an increase of 50% in work hours. As a result, a detailed plan for the materials management of each construction project is necessary.        The critical role of materials management in the success of a construction project motivates the development of a new framework for the process of materials management for the construction industry, specifically the electrical construction industry. Materials management problems have a great impact on general contractors, but are more critical for specialty contractors such as electrical contractors. Based on the co-authors' experience, the construction industry has moved toward specialty contractors in the last decade to the point where at least 80% of the work performed on a typical construction contract is done by specialty contractors. General contractors have become, for the most part, project managers.       Currently, materials management functions in the construction industry are often performed on a fragmented basis with minimal communication and no clearly established responsibilities among the parties involved. In addition, the collaboration required among departments has not been considered and implemented. This fragmentation creates gaps in information flow, which leads to delays in material ordering and receiving, expediting costs, excessive inventories of some items and project delays. However, model-based, computerized solutions to materials management problems are proliferating. Unfortunately, the typical electrical contractor may be overwhelmed by the technology required by these solutions and the challenges of implementing them into their business practices. A way out of this dilemma is presented by designing an industry-specific framework for the development of computerized decision support systems for the supply chains of the electrical contracting industry. Decision models are ever-present in the materials management processes of industries other than construction and have proven their worth in improving productivity and profitability. Knowledge-management concepts were applied to design an integrated, effective system of decision-support tools for materials-management decisions of an electrical contractor during the construction phase of a project.       The framework developed is valuable in two fundamental ways.  First, the framework identifies and describes all phases of materials management for an integrated, holistic view of all factors that affect the total cost of materials and material shortages. The research created detailed mappings of the essential decisions, decision models and data that are required to support supply-chain activities of construction contractors throughout a project life cycle.        Second, the framework differentiates those steps in the materials management process that are straightforward applications of methods from those steps that are decisions. For these decisions, that are critical to the performance of the materials management process, we introduce the concept of a decision model and describe how such models can be incorporated into an advanced materials management system. This phase of the research developed a structured systems design of distributed, integrated decision support systems for materials management of the electrical contractor. The research derives the optimal integration of people, decision processes, decision support systems and data that are required to support efficient and effective systems for acquisition, procurement, transport, storage and allocation of material in the construction industry.",
  "description_provenance": [
    "Author Email: jperdomo@vt.edu",
    "Advisor Email: flynn@vt.edu",
    "Advisor Email: yvan@vt.edu",
    "Advisor Email: julio@vt.edu",
    "Advisor Email: ralphb@vt.edu",
    "Advisor Email: thabet@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:14Z (GMT). No. of bitstreams: 1 Perdomo-ETD.pdf: 3393778 bytes, checksum: 4f4b15c74d84e2978ae5fbfec359382f (MD5)   Previous issue date: 2004-11-01"
  ],
  "handle": "29497",
  "identifier_other": "etd-11082004-152347",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11082004-152347/",
  "identifier_uri": "http://hdl.handle.net/10919/29497",
  "publisher": "Virginia Tech",
  "relation_haspart": "Perdomo-ETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Knowledge Management",
    "Supply Chain",
    "Material Management",
    "Electrical Contractors",
    "Decision Analysis",
    "Construction",
    "Decision Modeling",
    "Information Technology"
  ],
  "title": "A Framework For A Decision Support Model For Supply Chain Management In The Construction Industry",
  "type": "Dissertation"
}