{
  "contributor_author": "Richardson, Sharon E.",
  "contributor_committeecochair": [
    "Parks, David J.",
    "Niles, Jerome A."
  ],
  "contributor_committeemember": [
    "Kelly, Patricia Proudfoot",
    "Harris, Larry A.",
    "Parson, Stephen R."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:18:14Z",
  "date_adate": "2001-11-12",
  "date_available": "2014-03-14T20:18:14Z",
  "date_issued": "2001-09-20",
  "date_rdate": "2002-11-12",
  "date_sdate": "2001-11-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "Positioning Student Voice in the Classroom: The Postmodern Era  Sharon E. Richardson  (ABSTRACT)   \tTypically, students have had limited voice in their schooling (Erickson & Schultz,1992). The purposes of this study were to explore the concept of student voice in the elementary school and to develop strategies that develop student voice in the curricula. An elementary school principal and four teachers participated in an action research study that examined and attempted to develop student voice in their classrooms. Acting as a coach, the principal supported the four teachers as they implemented their classroom research on student voice. Four case studies were developed based on artifacts such as journals (student and participant), lesson plans, meetings, surveys and observations. Data were analyzed for emerging themes and compared across cases. \tFindings indicate that there was a difference in the teachers' emerging understanding and promotion of student voice. These differences were explained on the evolving commonalities being discovered in each case study.  First and foremost were the instructional strategies utilized by the participants that engaged the learners and promoted their voice? Next, the organizational structure of the building and classes played an important role. Time and size of classes either promoted or restrained student voice. Finally, the culture of the organization and the belief system of the individual teacher played an important role.",
  "description_provenance": [
    "Author Email: srichardson@roanoke.k12.va.us",
    "Advisor Email: niles@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:14Z (GMT). No. of bitstreams: 1 Dissertation.PDF: 364165 bytes, checksum: ba2bd18ad859166a50d168db6239c1e1 (MD5)   Previous issue date: 2001-09-20"
  ],
  "handle": "29495",
  "identifier_other": "etd-11082001-140010",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11082001-140010/",
  "identifier_uri": "http://hdl.handle.net/10919/29495",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.PDF",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "student voice",
    "student culture",
    "postmodernism"
  ],
  "title": "Positioning Student Voice in the Classroom: The Postmodern Era",
  "type": "Dissertation"
}