{
  "contributor_author": "Wigginton, Erin O'Donnell",
  "contributor_committeechair": "Hicks, David",
  "contributor_committeemember": [
    "Doolittle, Peter E.",
    "Williams, Thomas O. Jr.",
    "Feinberg, Joseph R."
  ],
  "contributor_department": "Curriculum and Instruction",
  "date_accessioned": "2014-03-14T20:18:14Z",
  "date_adate": "2011-12-02",
  "date_available": "2014-03-14T20:18:14Z",
  "date_issued": "2011-10-31",
  "date_rdate": "2011-12-02",
  "date_sdate": "2011-11-07",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to examine how government teachers make decisions regarding the type of technological tools they incorporate in their instruction. As a case study of two teachers, this work was oriented by the question:  How are U.S. Government teachers' beliefs and perspectives about learning and teaching reflected in their pedagogical practice and use of technological tools.      There is little work about how teachers prepare students for the 21st century. Teaching U.S. Government or about the U.S. government has been ignored in much of the research of social studies classes.  Additionally, most studies that examine the use of technological tools in the social studies classroom have either investigated the use of non-digital tools specifically or the use of digital tools specifically.  Few studies combine how social studies teachers use both non-digital and digital tools in their instruction. My goal was to shift the gaze and include the swirl of influences shaping U.S. Government teachers'   decision-making process as when both types of technological tools are used with their classes.    This study has its antecedents in my desire to examine Technological Pedagogical Content Knowledge, TPCK.  TPCK is a theoretical framework that posits that technological knowledge, pedagogical knowledge, and content knowledge are the key elements to understand teachersâ   instructional choices. The findings in this study indicate that while TPCK can offer teachers a framework to help begin to understand knowledge bases one could consider when planning class instruction, it falls short of providing the complete picture necessary to describe teacher decisions.",
  "description_provenance": [
    "Author Email: erinwigginton@gmail.com",
    "Advisor Email: hicks@vt.edu",
    "Advisor Email: pdoo@vt.edu",
    "Advisor Email: thwilli@vt.edu",
    "Advisor Email: mstjrf@langate.gsu.edu",
    "Made available in DSpace on 2014-03-14T20:18:14Z (GMT). No. of bitstreams: 1  Wigginton_EO_D_2011-1.pdf: 4979592 bytes, checksum: 291c666dac20415153cddf8ccdd75d81 (MD5)    Previous issue date: 2011-10-31"
  ],
  "handle": "29493",
  "identifier_other": "etd-11072011-154516",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11072011-154516/",
  "identifier_uri": "http://hdl.handle.net/10919/29493",
  "publisher": "Virginia Tech",
  "relation_haspart": "Wigginton_EO_D_2011-1.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.    I hereby grant to Virginia Tech or its agents the non-exclusive  license to archive and make accessible, under the conditions specified below,  my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Technological Pedagogical Content Knowledge",
    "social studies education",
    "high school",
    "government",
    "technology"
  ],
  "title": "The Choices and Uses of Technological Tools in High School Government Classes",
  "type": "Dissertation"
}