{
  "contributor_author": "Risch, Brian G.",
  "contributor_committeechair": "Wilkes, Garth L.",
  "contributor_committeemember": [
    "Ward, Thomas C.",
    "Davis, Richey M.",
    "Marand, Harve",
    "Dillard, David A."
  ],
  "contributor_department": "Materials Engineering Science",
  "date_accessioned": "2014-03-14T20:18:15Z",
  "date_adate": "2006-11-08",
  "date_available": "2014-03-14T20:18:15Z",
  "date_issued": "1994-03-31",
  "date_rdate": "2013-12-03",
  "date_sdate": "2006-11-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p> The crystallization behavior of poly(p-phenylene sulfide) PPS has been studied. Two PPS samples with < M<sub>w</sub> > = 43K and < M<sub>w</sub> > = 83K were fractionated to remove low molecular weight oligomers yielding fractionated PPS samples with < M<sub>w</sub> > = 57K and < Mw > = 113K. The fractionated samples were then treated with an ion exchange process to allow control over the nature of endgroup counterion. Isothermal rates of hulk crystallization were analyzed as a function of n1olecular weight of PPS, fractionation, and chen1ical nature of the endgroup counter-ion. Additionally the spherulitic growth rates and nucleation densities were studied as a function of the chemical nature of the endgroup counter-ion for fractionated PPS with < M<sub>w</sub> > = 57K. As a function of endgroup counter-ion, crystal growth rates and overall rates of crystallization decreased in the following order: H > Zn > Na. No significant trends in nucleation density as a function of endgroup counter-ion were observed. </p>  <p> Bulk crystallization rates, nucleation density, general morphological features, equilibrium melting point, and abso1ute crystalline percentage of linear and starbranched nylon-6 have been studied as a function of branch-point functionality and crystallization temperature. Overall bulk crystallization rates were described in terms of the Avrami equation. The crystallization half-times of star-branched nylon-6 as a function of supercooling were reduced relative to those of linear nylon-6 of comparable molecular weight. Irregularities in lame1lar structure were implied by SAXS experiments on samples with branch-point functionality as low as three. </p>  <p> The effects of changing the block length of poly(dimethylsiloxane), PSX, blocks in poly(etheretherketone)-poly(dimethylsiloxane), PEEK-PSX, multi block copolymers and their ketimine precursors, PEEKt-PSX, were investigated. A dran1atic dependence on thermal history prior to crystallization was observed in both block copolymer systems. Block copolyn1crs crystallized from the glassy state obtained a much higher degree of crystallinity at a n1uch faster rate of crystallization than copolymers crystallized from the melt at identical crystallization temperatures. </p>  <p> Thermal and mechanical behavior of bisphenol-A polycarbonate was studied as a function of thermal history and absorbed mass fraction of C0<sub>2</sub>. Mechanical testing and gas absorption experiments were performed on physically aged and unaged polycarbonate. Gas absorption studies indicated that although initial diffusion was somewhat retarded in the aged samples, both aged and unaged polycarbonate samples showed identical equilibrium absorbed gas values at 6500KPa and identical gas desorption behavior. Absorbed C0<sub>2</sub> was shown to plasticize polycarbonate. </p>  <p> Polymeric liquid crystalline foams were produced from star-branched polyoxybenzoate-po1yoxyphenoxybenzoate copolymers (POB-co-POPB) via gas supersaturation followed by thermal blowing. Solid state C0<sub>2</sub> gas absorption well as melt processability of star-branched POB-co-POPB was increased relative to the linear polymer of comparable molecular weight. While C0<sub>2</sub> blown foams of linear POB-co-POPB produced by the gas supersaturation technique had a relatively high density and showed highly anisotropic bubble growth, well defined, nearly isotropic foams of star-branched POB-co-POPB with mean cell size from 200 to 400~ were made using the gas supersaturation technique. </p>",
  "description_provenance": [
    "Author Email: Brian.Risch@prysmiangroup.com",
    "Advisor Email: none",
    "Advisor Email: none",
    "Advisor Email: none",
    "Advisor Email: none",
    "Advisor Email: none",
    "Made available in DSpace on 2014-03-14T20:18:15Z (GMT). No. of bitstreams: 1 LD5655.V856_1994.R573.pdf: 28613461 bytes, checksum: 933a2f2cba47aff39b048012db051ca7 (MD5)   Previous issue date: 1994-03-31"
  ],
  "format_medium": "BTD",
  "handle": "29499",
  "identifier_other": "etd-11082006-133621",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11082006-133621/",
  "identifier_uri": "http://hdl.handle.net/10919/29499",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.V856_1994.R573.pdf",
  "subject": [
    "Crystallization",
    "Thermoplastics"
  ],
  "subject_lcc": "LD5655.V856 1994.R573",
  "title": "Crystallization behavior and structure property behavior of selected thermoplastic polymers",
  "type": "Dissertation"
}