{
  "contributor_author": "Lim, Junghwa",
  "contributor_committeechair": "Luckhart, Shirley",
  "contributor_committeemember": [
    "Kennelly, Peter J.",
    "Larson, Timothy J.",
    "Tu, Zhijian Jake",
    "Gillaspy, Glenda E."
  ],
  "contributor_department": "Biochemistry",
  "date_accessioned": "2014-03-14T20:18:14Z",
  "date_adate": "2004-11-17",
  "date_available": "2014-03-14T20:18:14Z",
  "date_issued": "2004-11-03",
  "date_rdate": "2007-11-17",
  "date_sdate": "2004-11-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Malaria parasite (Plasmodium spp.) infection in the mosquito Anopheles stephensi induces significant expression of A. stephensi nitric oxide synthase (AsNOS) in the midgut epithelium as early as 6 h post-infection and intermittently thereafter.  This induction results in the synthesis of inflammatory levels of nitric oxide (NO) in the blood-filled midgut that limit parasite development.  However, the Plasmodium-derived factors that can induce AsNOS expression and the signaling pathways responsible for transduction in A. stephensi have not been identified until completion of the work described herein.   In my studies, I have determined that P. falciparum glycosylphosphatidylinositol (PfGPIs) can induce AsNOS expression in A. stephensi cells in vitro and in the midgut epithelium in vivo.  Based on related work in mammals, I hypothesized that parasite-derived AsNOS-inducing factors signal through the insulin signaling pathway and the NF-kappaB-dependent Toll and Immune deficiency (Imd) signaling pathways.  In support of this hypothesis, I have determined that signaling by P. falciparum merozoites and PfGPIs is mediated through A. stephensi protein kinase B (Akt/PKB) and DSOR1 (mitogen activated protein kinase kinase, MEK)/Extracellular signal-regulated protein kinase (ERK), kinases which are associated with the insulin signaling pathway.  However, signaling by P. falciparum and PfGPIs is distinctively different from signaling by insulin and these parasite signals are not insulin-mimetic to A. stephensi cells.  In other studies, treatment with pyrrolidine dithiocarbamate (PDTC), an inhibitor of NF-kappaB, reduced AsNOS expression by P. falciparum merozoites in A. stephensi cells.  This result suggested the involvement of Toll and Imd pathways in parasite signaling of mosquito cells.  Knockout of Pelle, a proximal signaling protein in the Toll pathway, increased AsNOS expression following parasite stimulation, suggesting that the Toll pathway may negatively regulate signaling by Plasmodium-derived AsNOS-inducing factors.  In contrast, knockout of TGF-beta-activated kinase 1 (Tak1), a proximal signaling protein in the Imd pathway, reduced AsNOS expression by 20% relative to the control, suggesting that the Imd pathway is required for signaling by Plasmodium-derived AsNOS-inducing factors.    Despite the NO-rich environment of the midgut, Plasmodium development is not completely inhibited.  This observation suggests that Plasmodium may have efficient detoxification systems during sexual development in A. stephensi.  To identify Plasmodium defense genes that may defend parasites against nitrosative stress caused by AsNOS induction, expression of several antioxidant defense genes known to function in nitrosative stress defense in a variety of organisms were examined during sporogonic development.  Notably, increased expression levels of P. falciparum peroxiredoxins containing 1 or 2 cysteines (1-cys or 2-cys PfPrx) were associated with periods of parasite development just prior to and during parasite penetration of midgut epithelium, an event associated with significant AsNOS induction in the midgut.  The provision of N omega-L-arginine (L-NAME), a known inhibitor of NOS enzyme activity, to A. stephensi with Plasmodium culture by artificial bloodmeal significantly reduced expression of 1-cys and 2-cys PfPrx indicating that these gene products may function to protect parasites against nitrosative stress induced by AsNOS.",
  "description_provenance": [
    "Author Email: junghwa.lim@gmail.com",
    "Advisor Email: pjkennel@vt.edu",
    "Advisor Email: tilarson@vt.edu",
    "Advisor Email: jaketu@vt.edu",
    "Advisor Email: sluckhart@ucdavis.edu",
    "Advisor Email: gillaspy@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:14Z (GMT). No. of bitstreams: 1 Lim11-15-04.pdf: 1584929 bytes, checksum: 0d15d246a2eb0dd4fe03bc6c6dda3d88 (MD5)   Previous issue date: 2004-11-03"
  ],
  "handle": "29496",
  "identifier_other": "etd-11082004-023754",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11082004-023754/",
  "identifier_uri": "http://hdl.handle.net/10919/29496",
  "publisher": "Virginia Tech",
  "relation_haspart": "Lim11-15-04.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Plasmodium",
    "Nitric oxide synthase",
    "Malaria",
    "Anopheles stephensi"
  ],
  "title": "Induction of Anopheles stephensi nitric oxide synthase by Plasmodium-derived factor(s)",
  "type": "Dissertation"
}