{
  "contributor_author": "Mitchell, Tami Lee",
  "contributor_committeecochair": [
    "Khademian, Anne Meredith",
    "Murch, Randall"
  ],
  "contributor_committeemember": [
    "Roberts, Patrick S.",
    "Dull, Matthew Martin"
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:18:21Z",
  "date_adate": "2011-11-11",
  "date_available": "2014-03-14T20:18:21Z",
  "date_issued": "2011-10-25",
  "date_rdate": "2011-11-11",
  "date_sdate": "2011-11-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation examines multi-agency policy environments as a policy system of systems (SoS).  The research conducted for this dissertation establishes the need to develop a method of analysis suitable for the analysis of a policy SoS that allows for the examination of individual policy relationships while maintaining a holistic perspective of the entire SoS.  The Three-Dimensional Policy Design Structure (3DPDS) is proposed as a method of analysis suitable for examination of a policy SoS.  This dissertation focuses on application of the 3DPDS to three specific areas of space launch policy that impact space launch capacity: (1) policies related to space launch vehicles, (2) policies related to space launch facilities, and (3) the potential impacts of the cancellation of the Ares 1 launch vehicle.  The first two applications of the 3DPDS provide a retrospective analysis of the policy relationships within the space launch policy SoS.  The final application uses the results of the examination of policies related to space launch vehicles to systematically examine a current issue.  The results of the first two applications, when compared against data gathered from subject matter experts during the interview process, provided a much more complete and holistic perspective of the policy relationships within the SoS, including identification of policy outliers.  The third application enabled a systematic review of a current policy issue that incorporated information from formal policy documents with information provided by subject matter experts during the interview process.",
  "description_provenance": [
    "Author Email: tami@vt.edu",
    "Advisor Email: robertsp@vt.edu",
    "Advisor Email: mdull@vt.edu",
    "Advisor Email: akhademi@vt.edu",
    "Advisor Email: rmurch@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:21Z (GMT). No. of bitstreams: 3 Mitchell_Tami_L_D_2011.pdf: 4193293 bytes, checksum: 71b7b147455caf7b6dcd2088b4a5140a (MD5) Mitchell_Tami_L_D_2011_copyright.pdf: 7181218 bytes, checksum: 6fcf9aa88782b6f6b3ab884f6072915a (MD5) Mitchell_Tami_L_D_2011_IRB.pdf: 1959591 bytes, checksum: 658e5d50cf65db5b355cfbd0e830de94 (MD5)   Previous issue date: 2011-10-25"
  ],
  "handle": "29506",
  "identifier_other": "etd-11082011-174349",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11082011-174349/",
  "identifier_uri": "http://hdl.handle.net/10919/29506",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Mitchell_Tami_L_D_2011.pdf",
    "Mitchell_Tami_L_D_2011_copyright.pdf",
    "Mitchell_Tami_L_D_2011_IRB.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Three-Dimensional Policy Design Structure (3DPDS)",
    "Space Launch Policy",
    "Systems of Systems (SoS)"
  ],
  "title": "A New Method for the Examination of Policy Systems of Systems",
  "type": "Dissertation"
}