{
  "contributor_author": "Burts, Ellen",
  "contributor_committeechair": "Riffle, Judy S.",
  "contributor_committeemember": [
    "Wightman, James P.",
    "Lesko, John",
    "Mcgrath, James E.",
    "Hale, Arturo"
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:18:21Z",
  "date_adate": "2000-12-04",
  "date_available": "2014-03-14T20:18:21Z",
  "date_issued": "2000-10-26",
  "date_rdate": "2001-12-04",
  "date_sdate": "2000-11-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "One of the major classes of polymer matrix resins under consideration for structural composite applications in the infrastructure and construction industries is the dimethacrylate matrix resin.  An investigation of the relationships between the chemical structures and properties of these dimethacrylate/styrene networks has been conducted.  Oligomer number average molecular weights of the polyhydroxyether ranging from 700 to 1200g/mole were studied with systematically varied styrene concentrations to assess the effects of crosslink density and chemical composition on glass transition temperatures, toughness, tensile properties and matrix strain.  Network densities have been estimated from measurements of the rubbery moduli at Tg + 40&#176;C.  Within this rather small range in vinyl ester molecular weight, toughness of the resultant networks improved tremendously as the vinyl ester oligomer Mn was increased from 700g/mole to 1200g/mole due to improvements in the resistance to crack propagation.  As styrene concentration was increased along all series' of materials, brittleness increased even though the molecular weight between crosslinks increased.  This was attributed to the inherent relative brittleness of the polystyrene chemical structure relative to the polyhydroxyether component.  This may also be related to the reactivity ratios dictating styrene and vinyl ester sequence length and warrants further investigation.  As expected, the volume contraction upon cure also decreased significantly as styrene was decreased, and thus residual cure stresses may be reduced in fiber-reinforced composites.  Vickers microhardness values decreased for each of the series when molecular weight increased and styrene content decreased.  <p> Two different cure procedures were compared to assess the effects of conversion on the physical and mechanical properties.  All mechanical properties investigated (i.e. fracture toughness, tensile strength, and microhardness) were dependent on the cure procedure.  Materials cured at 140&#176;C were harder, more brittle, had lower elongations and higher rubbery moduli than those cured at 25&#176;C followed by a 93&#176;C postcure.  A maximum in the degree of conversion occurred with increasing polymerization temperature and can be explained by the competition between the chemical reaction and molecular mobility.  The overall shrinkage per moles of vinyl groups converted was the same when the materials were cured at 25&#176;C or 140&#176;C.  However, in the room temperature cured samples, there was essentially no further densification of the network during postcure, regardless of the postcure temperature.  A mono-methacrylate analogue of the dimethacrylate terminated poly(hydroxyether) oligomer was synthesized and copolymerized with styrene to study the effects of chain transfer during elevated temperature reactions.</p>",
  "description_provenance": [
    "Author Email: eburts@vt.edu",
    "Advisor Email: wightman@vt.edu",
    "Advisor Email: jlesko@vt.edu",
    "Advisor Email: jmcgrath@vt.edu",
    "Advisor Email: judyriffle@aol.com",
    "Advisor Email: arturo@bell-labs.com",
    "Made available in DSpace on 2014-03-14T20:18:21Z (GMT). No. of bitstreams: 1 Burtsdiss.pdf: 20437276 bytes, checksum: 31db5292fd753f08a9875cf8fe4dec81 (MD5)   Previous issue date: 2000-10-26"
  ],
  "handle": "29507",
  "identifier_other": "etd-11092000-18580048",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11092000-18580048/",
  "identifier_uri": "http://hdl.handle.net/10919/29507",
  "publisher": "Virginia Tech",
  "relation_haspart": "Burtsdiss.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": "dimethacrylate; vinyl ester; network; crosslink de",
  "title": "Structure and Properties Of dimethacrylate-Styrene Resins and Networks",
  "type": "Dissertation"
}