{
  "contributor_author": "Darlington, Lisa Marie",
  "contributor_committeechair": "Singh, Kusum",
  "contributor_committeemember": [
    "Scheckler, Rebecca K.",
    "Chang, Mido",
    "Burge, Penny L.",
    "Allen, Katherine R."
  ],
  "contributor_department": "Educational Research and Evaluation",
  "date_accessioned": "2014-03-14T20:18:21Z",
  "date_adate": "2008-12-04",
  "date_available": "2014-03-14T20:18:21Z",
  "date_issued": "2008-10-31",
  "date_rdate": "2009-12-04",
  "date_sdate": "2008-11-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The demand for workers with college level training in computer related skills is growing rapidly.  Although the number of computer science jobs is growing, the percentage of these jobs currently held by women is lower than in 1983 (Commission on Professionals in Science and Technology, 2004).  The underrepresentation of women and minorities in postsecondary computing education has become a major national concern (Cohoon & Aspray, 2006).  Despite a growing literature on women in STEM fields, there is a lack of theoretical development about womenâ  s participation and attrition in computer related majors.  The findings are often inconsistent and there are few discipline-specific guidelines for policy. An important next step is to examine these insights with confirmatory quantitative methods.  Larsen and Stubbs (2005) argue that efforts to increase diversity in computer fields should be broad-based and move beyond gender.  Factors that are successful in attracting and retaining a diverse population of undergraduates in computer related majors will also benefit women and minorities.  The purpose of this quantitative study was to develop and test a model of factors influencing the satisfaction and persistence of undergraduates in computer related majors at two universities in Virginia.  There were three major independent constructs:  academic, social, and institutional factors.  Dependent constructs were persistence and satisfaction.   The sample was a convenience sample of classes at differing academic levels. A total of 388 students in computer-related majors were surveyed during regularly scheduled class sessions. \tData analysis was conducted using structural equation modeling (SEM) techniques. The goal of SEM is to determine the extent to which a theoretical model is supported by data.  Both measurement and structural models were tested.   Results indicate that these factors have significant and substantive effects on satisfaction and persistence.  They highlight the importance of faculty, peers, and family support for student satisfaction and retention, and the need to examine instruction and content in computer related majors.  The findings suggest the need for further work in the measurement of the constructs, and for further refinement of the final model.  In addition, comparison of individual item means suggest that models may vary significantly among majors and between white and minority students.  Future research should continue to test and refine the model for the influence of academic, social, and institutional factors on student satisfaction and persistence in computer related majors so that educators and policy makers can enhance the academic and social support structures for students in these majors.",
  "description_provenance": [
    "Author Email: ldarling@vt.edu",
    "Advisor Email: rscheckler@radford.edu",
    "Advisor Email: mchang@vt.edu",
    "Advisor Email: burge@vt.edu",
    "Advisor Email: ksingh@vt.edu",
    "Advisor Email: kallen@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:21Z (GMT). No. of bitstreams: 1 etd_LMD.pdf: 1415616 bytes, checksum: 362faa6b33bca971674fefb3c294c682 (MD5)   Previous issue date: 2008-10-31"
  ],
  "handle": "29504",
  "identifier_other": "etd-11082008-210252",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11082008-210252/",
  "identifier_uri": "http://hdl.handle.net/10919/29504",
  "publisher": "Virginia Tech",
  "relation_haspart": "etd_LMD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "structural equation modeling",
    "computer related majors",
    "satisfaction",
    "persistence"
  ],
  "title": "Factors that Influence the Satisfaction and Persistence of Undergraduates in Computer Related Majors",
  "type": "Dissertation"
}