{
  "contributor_author": "Serchuk, Adam.",
  "contributor_committeechair": "Hirsh, Richard F.",
  "contributor_committeemember": [
    "Weinberg, Carl",
    "Barker, Peter",
    "Rahman, Saifur",
    "Fuhrman, Ellsworth R."
  ],
  "contributor_department": "Science and Technology Studies",
  "date_accessioned": "2014-03-14T20:18:20Z",
  "date_adate": "2006-11-08",
  "date_available": "2014-03-14T20:18:20Z",
  "date_issued": "1995-01-27",
  "date_rdate": "2012-04-06",
  "date_sdate": "2006-11-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "In 1994, the use of wind turbines for electricity generation verges on economic respectability. Two contradictory trends have prepared a fertile niche for utility-scale windpower. The introduction of \"deregulatory,\" competitive principles onto the electric industry fostered a non-utility generating sector relying on unconventional technologies. Simultaneously, policy-makers using \"hyper-regulatory\" tactics to pursue social goals such as reduced pollution pushed utilities to include renewable energy in their resource· plans. Both tendencies advanced windpower. <p> By comparing the Federal Wind Energy Program (FWEP) to California's entrepreneurial windpower industry, this dissertation argues that windpower constituted a conservative addition to the American electric utility system, rather than a radical challenge to it. True, venture capitalists producing and delivering windpower to the nation's transmission grid challenged the utilities' financial control. But participants in the windpower story have constructed a version of windpower largely compatible with the electric system. <p> The most notable products of the FWEP--multi-megawatt wind generators--proved too complex, too expensive and too unreliable for their environment. Windpower entrepreneurs, by contrast, devised smaller machines better suited to the market. Equally important, regulatory support shielded the windfarms from the political and economic turnabouts that scuttled the ambitious FWEP, which relied completely on ephemeral Federal patronage. Today's wind entrepreneurs present their technology as a cost-effective addition to the conventional generating system, rather than as a social tool dependent on government support for environmentalism. <p> But the story of windpower does not constitute a self-contained drama. In addition to pitched negotiations over wind energy, the story implicates the changing utility industry, shifts in global energy politics, and emergent environmentalism. The windfarms' \"success\" and the FWEP's \"failure\" frequently depended on actors' ability to exploit or insulate themselves from events unrelated to windpower itself. Thus, the dissertation binds firstperson accounts from participants in the windpower story to strands of larger histories, recounted through periodical and secondary literature. The dissertation speaks to historians, sociologists, energy managers, policy-makers and members of the community of \"science and technology studies.\" Ultimately, it aims to produce a tool for the actors and policymakers it describes.",
  "description_provenance": [
    "Author Email: adser@VESTAS.COM",
    "Advisor Email: richards@vt.edu",
    "Advisor Email: srahman@vt.edu",
    "Advisor Email: fuhrman@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:20Z (GMT). No. of bitstreams: 1 LD5655.V856_1995.S473.pdf: 16448311 bytes, checksum: 35f2e219a0c5429838544400fe633638 (MD5)   Previous issue date: 1995-01-27"
  ],
  "format_medium": "BTD",
  "handle": "29501",
  "identifier_other": "etd-11082006-133624",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11082006-133624/",
  "identifier_uri": "http://hdl.handle.net/10919/29501",
  "publisher": "Virginia Tech",
  "relation_haspart": "LD5655.V856_1995.S473.pdf",
  "subject": [
    "entrepreneurs",
    "energy",
    "wind",
    "Federal giants"
  ],
  "subject_lcc": "LD5655.V856 1995.S473",
  "title": "Federal giants and wind energy entrepreneurs : utility-scale windpower in America 1970-1990",
  "type": "Dissertation"
}