{
  "contributor_author": "Choksi, Kashyap Nalin",
  "contributor_committeechair": "White, Orion F. Jr.",
  "contributor_committeemember": [
    "Dudley, Larkin S.",
    "Jones, Judith H.",
    "Backer, Thomas E.",
    "Wolf, James F."
  ],
  "contributor_department": "Public Administration and Public Affairs",
  "date_accessioned": "2014-03-14T20:18:21Z",
  "date_adate": "2004-11-22",
  "date_available": "2014-03-14T20:18:21Z",
  "date_issued": "2004-09-07",
  "date_rdate": "2004-11-22",
  "date_sdate": "2004-11-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "One of the central areas of focus in organizational theory that has been of particular interest is the organization-environment interface.  While various theories have made vital contributions to the study of organization-environment relations, their emphasis on organization adaptation is varied.  However, research and practice have amply demonstrated that organizations do not exist in a vacuum; that if an organization is to survive and meet its goals, it has to adapt to or somehow make accommodations with its cognitive and normative environment.    \tThis study explores the issue of an organization trying to adapt to its normative environment by deeply examining the situation of a national private nonprofit organization, with ties to the land-grant university and college system, which found itself in the midst of a turbulent environment.  Specifically, the study discusses how that nonprofit was affected by this turbulence when it accepted funding from the nation's largest tobacco company to develop and implement a tobacco prevention program.  The act of this nonprofit accepting funds from the tobacco corporation caused challenges in internal management, worsened relations with some of its core constituencies, and fomented discord within leading non-profit organizations.  The notion of turbulence, the mechanism of isomorphism as espoused by the new institutionalists, and the role of agency was explored, supplemented by a strategic approach that included components of contracting standards that organizations could adapt to attain congruency with elements of their turbulent normative environment.  In particular, this strategic approach utilized a framework borrowed from research conducted by Oliver (1991), emphasizing strategies of Defiance, Manipulation and Avoidance.  What this study offers is a strategic approach to help non-profit organizations when they partner with a controversial source of funding, especially in cases where they are faced with these kinds of management dilemmas.",
  "description_provenance": [
    "Author Email: KASHYAPNCHOKSI@YAHOO.COM",
    "Advisor Email: mcswite@sbcglobal.net",
    "Advisor Email: dudleyl@vt.edu",
    "Advisor Email: judith@vt.edu",
    "Advisor Email: tombacker@aol.com",
    "Advisor Email: jfwolf@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:21Z (GMT). No. of bitstreams: 1 ChoksiDissertationNov122004.pdf: 3906658 bytes, checksum: 933ee2f039e3b283c51aacf836b6bcdc (MD5)   Previous issue date: 2004-09-07"
  ],
  "handle": "29508",
  "identifier_other": "etd-11092004-141346",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11092004-141346/",
  "identifier_uri": "http://hdl.handle.net/10919/29508",
  "publisher": "Virginia Tech",
  "relation_haspart": "ChoksiDissertationNov122004.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "organizational environment",
    "defiance",
    "strategic",
    "nonprofit",
    "isomorphism"
  ],
  "title": "a Strategic Approach to Managing Turbulence in the Normative Environment",
  "type": "Dissertation"
}