{
  "contributor_author": "Green, Ellen  P",
  "contributor_committeechair": "Ball, Sheryl B.",
  "contributor_committeemember": [
    "Ge, Suqin",
    "Macieira, Joao C.",
    "Tideman, Thorwald Nicolaus",
    "You, Wen"
  ],
  "contributor_department": "Economics",
  "date_accessioned": "2014-03-14T20:18:21Z",
  "date_adate": "2011-11-21",
  "date_available": "2014-03-14T20:18:21Z",
  "date_issued": "2011-11-04",
  "date_rdate": "2011-11-21",
  "date_sdate": "2011-11-08",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This dissertation contains three essays on the impact of other-regarding behavior on human decision-making. Chapter II uses experimental methods to analyze the relative performance of a variety of compensation contracts. This study creates an environment in which individuals are paid via common payment mechanisms employed in the dual-principal agent relationships (Piece Rate, Flat Rate, Salary, Bonus and Socialization) and examines the effect that different incentive structures have on agent behavior. In Chapter III I explore the potential outcomes of blended payment structures in a dual-principal agent environment. I draw from the previously conducted experimental study in Chapter II and simulate agent behavior induced by blended payment mechanisms. In Chapter IV, I move away from studying payment mechanisms to investigate the impact of intentionality and responsibility on an individualâ  s decision-making process. I explore the effects of direct and indirect responsibility as well as selfish and kind intentions using experimental methodology. Each of these essays provides further evidence that other-regarding behavior has a significant impact on the outcome of an economic situation; therefore, emphasizing the need to address such behavior in theoretical designs.",
  "description_provenance": [
    "Author Email: econglet@vt.edu",
    "Advisor Email: sball@vt.edu",
    "Advisor Email: ges@vt.edu",
    "Advisor Email: joaom07@vt.edu",
    "Advisor Email: ntideman@vt.edu",
    "Advisor Email: wenyou@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:21Z (GMT). No. of bitstreams: 1 Green_EP_D_2011.pdf: 15175996 bytes, checksum: edde8aca180fa90b7c20cbf0132c8a1c (MD5)   Previous issue date: 2011-11-04"
  ],
  "handle": "29505",
  "identifier_other": "etd-11082011-152752",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11082011-152752/",
  "identifier_uri": "http://hdl.handle.net/10919/29505",
  "publisher": "Virginia Tech",
  "relation_haspart": "Green_EP_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Principal-agent theory",
    "moral hazard",
    "contract enforcement",
    "reciprocity",
    "altruism",
    "other-regarding behavior",
    "responsibility",
    "intentionality"
  ],
  "title": "A Study of Human Decision-Making in Economic Games",
  "type": "Dissertation"
}