{
  "contributor_author": "Whitaker, Brian Daniel",
  "contributor_committeechair": "Knight, James W.",
  "contributor_committeemember": [
    "Estienne, Mark J.",
    "Wong, Eric A.",
    "Eng, Ludeman A.",
    "Gwazdauskas, Francis C."
  ],
  "contributor_department": "Animal and Poultry Sciences",
  "date_accessioned": "2014-03-14T20:18:22Z",
  "date_adate": "2007-11-19",
  "date_available": "2014-03-14T20:18:22Z",
  "date_issued": "2007-08-13",
  "date_rdate": "2008-11-19",
  "date_sdate": "2007-11-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Oxidative stress contributes to inadequate in vitro maturation of porcine oocytes which leads to a failure of successful fertilization and embryo development.  Therefore, the overall objective of this research was to characterize the mechanisms of oxidative stress in maturing oocytes and determine how oocytes alleviate oxidative stress with the assistance of supplemental antioxidants.  A preliminary study was conducted to evaluate the effects of glutathione (GSH), N-acetyl-cysteine (NAC), and N-acetyl-cysteine-amide (NACA) supplemented to the maturation medium on intracellular GSH concentrations, nuclear maturation, fertilization success and embryo development.  Antioxidants GSH, NAC and NACA (1.0 mM) were supplemented to the media during oocyte maturation.  Intracellular GSH concentrations were recorded at 48 h of maturation and nuclear maturation and fertilization were analyzed 12 h after IVF.  Embryo development was analyzed at 48 h and 144 h after IVF or intracytoplasmic sperm injection (ICSI).  Supplementation of antioxidants had no effect on intracellular levels of GSH, nuclear maturation or fertilization traits.  Blastocyst formation for NAC (35.0 ± 7.4%) and NACA (40.0 ± 7.4%) supplementation were higher (P < 0.05) than the control (20.0 ± 7.4%) and GSH supplemented (20 ± 7.4%) oocytes.  The same pattern was seen for ICSI-derived embryos: blastocyst formation for NAC (22.0 ± 5.9%) and NACA (25.0 ± 4.6%) supplementation were higher (P < 0.05) than the un-supplemented (10.0 ± 6.0%) oocytes.  There were no differences between NAC and NACA supplementation and there were no differences between the cleavage rates for any of the treatment groups.  These results indicate that supplementing 1.0 mM of NAC or NACA to the oocyte maturation medium and the ICSI medium increased the percentage of viable embryos reaching the blastocyst stage of development, and could warrant further investigation.  The next study was conducted to evaluate the effects of different concentrations of NAC supplemented to the maturation medium on embryo development.  Comparisons of significant concentrations of NAC and NACA on embryo development were evaluated for nuclear maturation, fertilization success and embryo development.  Concentrations of NAC (0, 0.5, 1.0, 1.5, 2.0, 2.5, 5.0 mM) were supplemented to maturing oocytes and embryo development was analyzed at 48 h and 144 h post-fertilization.  There were no differences between cleavage rates for any of the treatment groups.  Blastocyst formation for 1.5 mM NAC (56.5 ± 9.2%) was significantly higher (P < 0.05) than all other supplementations.  There were no differences in nuclear maturation or fertilization when comparing 1.5 mM NAC and 1.5 mM NACA supplementation to the maturation media.  There was no difference between cleavage rates of 1.5 NAC and 1.5 mM NACA supplementation to the maturation media.  Blastocyst formation for 1.5 mM NAC (44.4 ± 4.7%) and 1.5 mM NACA (46.2 ± 3.4%) supplementation were significantly higher (P < 0.05) than the control (32.1 ± 6.2%) oocytes.  These results indicate that supplementing 1.5 mM of NAC or NACA to the oocyte maturation medium increased the percentage of viable embryos reaching the blastocyst stage of development and could be used during the oxidative stress experiments.  In the final study, the mechanisms of oxidative stress in maturing oocytes were studied in addition to evaluating the effects of antioxidant supplementation to the media.  This study focused on superoxide dismutase (SOD), GSH peroxidase, catalase and intracellular GSH concentrations with respect to DNA fragmentation evaluated using the single cell Comet assay.  Results indicate that when SOD was inhibited, the GSH peroxide levels and length of DNA migration significantly increased (P < 0.05).  Catalase levels significantly decreased (P < 0.05) and intracellular GSH remained unchanged.  When GSH peroxidase was inhibited, the SOD levels and catalase levels significantly decreased (P < 0.05) but the intracellular GSH and DNA migration length significantly increased (P < 0.05).  The supplementation of 1.5 mM NAC and 1.5 mM NACA had multiple effects on the enzyme levels.  Specifically, supplementation of 1.5 mM NAC or 1.5 mM NACA significantly decreased (P < 0.05) the length of DNA migration when other enzymes were inhibited compared to no antioxidant supplementation.  These results indicate that antioxidant supplementation may alleviate the free radicals associated with oxidative stress in the maturing porcine oocyte.  In conclusion, supplementing the antioxidants NAC or NACA to the oocyte maturation media does not have negative effects on IVF or embryo culture.  Supplementation of NACA increases the number of oocytes reaching the blastocyst stage of development.  Glutathione, SOD, catalase, and GSH peroxidase are all required to be functional during oocyte development to alleviate oxidative stress on the oocyte.  Antioxidants enhance the enzyme activity during oocyte maturation and may even contribute to protecting the oocyte when enzyme activity is impaired.",
  "description_provenance": [
    "Author Email: bwhitaker@ferrum.edu",
    "Advisor Email: mestienn@vt.edu",
    "Advisor Email: knight@vt.edu",
    "Advisor Email: ewong@vt.edu",
    "Advisor Email: laeng@vt.edu",
    "Advisor Email: guaz@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:22Z (GMT). No. of bitstreams: 1 BWhitaker.pdf: 339406 bytes, checksum: 9e180b7991f0313d61fabada7de02d67 (MD5)   Previous issue date: 2007-08-13"
  ],
  "handle": "29512",
  "identifier_other": "etd-11092007-124406",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11092007-124406/",
  "identifier_uri": "http://hdl.handle.net/10919/29512",
  "publisher": "Virginia Tech",
  "relation_haspart": "BWhitaker.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "antioxidants",
    "glutathione",
    "IVF",
    "oocyte",
    "pig"
  ],
  "title": "Oxidative stress mechanisms within the developing porcine oocyte and the effects of antioxidant supplementation",
  "type": "Dissertation"
}