{
  "contributor_author": "Bailey, John Allen",
  "contributor_committeecochair": [
    "Dr. Glen Earthman",
    "Dr. Travis Twiford"
  ],
  "contributor_committeemember": [
    "Dr. Linda Lemasters",
    "Cash, Carol S."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:18:22Z",
  "date_adate": "2009-11-20",
  "date_available": "2014-03-14T20:18:22Z",
  "date_issued": "2009-11-02",
  "date_rdate": "2013-05-20",
  "date_sdate": "2009-11-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The relationships between building condition and student achievement, student behavior, and student attitude were investigated by reviewing research. A synthesis of research studies from 1998 through 2008 was completed. A matrix was replicated from Lemastersâ   1997 study that identified the researchers used in each study. The matrix presented each author and the areas each author researched. \t<p> The first task was to determine if a substantial amount of research was available from the time period between 1998 through 2008. Current research through journals, research reports, briefs, and theses and dissertations supported this. The main research question examined if current relationships existed between building conditions and student achievement, student behavior, and student attitude by synthesizing several studies from 1998 through 2008. The results of the studies within this time period presented many new phenomena and also either substantiated or refuted findings in the previous syntheses conducted by Weinstein (1979), McGuffey (1982), and Lemasters (1997). \t<p>Over one hundred pieces of literature were reviewed that supported a preponderance of evidence, which broadened the field of focus to include certain variables that affect student achievement, student behavior, and student attitude. There were 54 studies to be synthesized and included some independent variables presented in Lemastersâ   study, as well as the variables of lighting, acoustics, school age, density, climate conditions, design features, teachers, attendance, attitudes, miscellaneous studies, and building conditions. \t<p>There were 35 dissertations reviewed that involved the dependent and independent variables mentioned above. Student academics, student perceptions and attitudes, and behavioral statistics were analyzed within each study. Each analysis of studies included the author of the study, the title of the document, the purpose of the study, the sample population used in the study, the statistical methodology used, the independent and dependent variables identified, and the findings and conclusions. The studies were formatted in a matrix and identified the number of studies in which the dependent variables of student achievement, student attitude, and student behavior. \t<p>The majority of all 54 studies involving building conditions and independent variables, from 1998 through 2008, had a direct influence on student achievement, student behavior, and student attitude. Newer, well maintained, schools had a positive influence on the dependent variables, while older, less cared for, and non-modernized schools had an adverse relationship to student achievement, student behavior, and student attitude. \t<p>The results of the previous three syntheses in 1979, 1982, and 1997, along with the results of the findings in this study supported and indicated that building condition was directly related to student achievement, student behavior, and student attitude.",
  "description_provenance": [
    "Author Email: bailey05@vt.edu",
    "Advisor Email: earthman@vt.edu",
    "Advisor Email: lindal@gwu.edu",
    "Advisor Email: ccash48@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:22Z (GMT). No. of bitstreams: 1 JohnA.Bailey.pdf: 1121096 bytes, checksum: ae159251dd04443e121d5b52bbd0f819 (MD5)   Previous issue date: 2009-11-02"
  ],
  "handle": "29514",
  "identifier_other": "etd-11092009-223330",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11092009-223330/",
  "identifier_uri": "http://hdl.handle.net/10919/29514",
  "publisher": "Virginia Tech",
  "relation_haspart": "JohnA.Bailey.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Building Conditions and Student Achievement",
    "Student Attitude",
    "Student Behavior",
    "School Facilities"
  ],
  "title": "A SYNTHESIS OF STUDIES PERTAINING TO BUILDING CONDITIONS, STUDENT ACHIEVEMENT, STUDENT BEHAVIOR, AND STUDENT ATTITUDE",
  "type": "Dissertation"
}