{
  "contributor_author": "Glass, Valerie Q",
  "contributor_committeechair": "Few-Demo, April L.",
  "contributor_committeemember": [
    "Dolbin-MacNab, Megan L.",
    "Allen, Katherine R.",
    "Piercy, Fred P."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:18:22Z",
  "date_adate": "2010-12-08",
  "date_available": "2014-03-14T20:18:22Z",
  "date_issued": "2010-10-26",
  "date_rdate": "2010-12-08",
  "date_sdate": "2010-11-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Twenty-two African American lesbians were interviewed in order to identify and examine the intersection of individual and family processes that African American lesbian couples engage in as a family with members of their families of origin. A qualitative research design based on grounded theory methods was used. Data were interpreted using an integrative framework of postmodern feminism, Black feminism, and symbolic interactionism. Findings revealed three major themes: a) Black lesbian couples go through a coming out process as a couple and as individuals, at times, simultaneously; b) Black lesbian families establish and enforce boundaries to protect their intentional, co-created families, and this boundary definition shapes lesbian family identity, and c) resources accessible from informal social supports by African American lesbian families are different from the types of social support and resources available to Black lesbian individuals.  These findings provide valuable insights into lesbian family processes that can assist family studies, feminist scholars, family therapists, and community practitioners in identifying future research directions and clinical practices appropriate for African American lesbian families.",
  "description_provenance": [
    "Author Email: vqglass@vt.edu",
    "Advisor Email: alfew@vt.edu",
    "Advisor Email: mdolbinm@vt.edu",
    "Advisor Email: kallen@vt.edu",
    "Advisor Email: piercy@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:22Z (GMT). No. of bitstreams: 1 Glass_VQ_D_2010.pdf: 925954 bytes, checksum: 8133e507b1f8861b08b621e92a8e504e (MD5)   Previous issue date: 2010-10-26"
  ],
  "handle": "29515",
  "identifier_other": "etd-11092010-124413",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11092010-124413/",
  "identifier_uri": "http://hdl.handle.net/10919/29515",
  "publisher": "Virginia Tech",
  "relation_haspart": "Glass_VQ_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Therapy",
    "African American",
    "Lesbian",
    "Feminist",
    "Family",
    "Lesbian Stepfamily"
  ],
  "title": "Black Lesbian Families and Their Relationships With Their Families of Origin",
  "type": "Dissertation"
}