{
  "contributor_author": "Pembridge, James Joseph",
  "contributor_committeechair": "Paretti, Marie C.",
  "contributor_committeemember": [
    "Terpenny, Janis P.",
    "Wells, John G.",
    "Williams, Christopher B."
  ],
  "contributor_department": "Engineering Education",
  "date_accessioned": "2014-03-14T20:18:22Z",
  "date_adate": "2011-12-06",
  "date_available": "2014-03-14T20:18:22Z",
  "date_issued": "2011-10-24",
  "date_rdate": "2011-12-06",
  "date_sdate": "2011-11-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Capstone courses provide senior students in engineering with a culminating experiential learning environment, allowing them to apply the knowledge they have developed throughout their undergraduate education. Through anecdotal descriptions of the course, faculty roles have been classified as mentoring. Yet, there have been few systematic and empirical studies that aid in the exploration of the pedagogy and its effectiveness. This study used Kram창  s model of mentoring as a lens to explore mentoring in the capstone course more systematically. In addition, the learning theories that support project-based learning provided additional understanding into the functions and practices that faculty mentors use to support the students창   career and psychosocial development.  This study used a sequential mixed methods design to explore the prominent mentoring functions seen in engineering capstone courses, identify the factors related to those mentoring functions, and analyze how the functions are related to perceived learning outcomes. Data collection included a survey of 491 capstone faculty, interviews of 25 survey respondents using the critical decision method, and a survey of 139 students of the interviewees. Quantitative data analysis included the calculation of descriptive statistics for the faculty and student survey item responses as well as a correlation analyses between the items representing mentoring functions and items representing factors of mentoring. Qualitative analysis involved a phenomenological analysis of the data through the coding of interview responses using Kram창  s mentoring functions as a framework.   Findings identified the mentoring practices associated with the career development and psychosocial functions. Additional findings indicated that: 1) challenging assignments, protection, and acceptance-and-confirmation are the dominant functions, 2) faculty background is a potential important factor of mentoring, whereas institutional and department demographics are negligible, and 3) most learning outcomes are associated with challenging assignments, with the exception of ethical understanding, which is developed through coaching, counseling, and role modeling.   The findings resulted in the development of a model of capstone mentoring. The model provides a holistic, research-based view of the role that faculty assume when mentoring capstone students.  While this study did not systematically prove the model창  s effect on student learning, positive effects are supported by both student self-reports and learning theories associated with project-based learning. As such, the model can be used as a general guide for the development of pedagogical skills and assessment of teaching practices in project-based capstone courses.",
  "description_provenance": [
    "Author Email: jpembrid@vt.edu",
    "Advisor Email: mparetti@vt.edu",
    "Advisor Email: terpenny@iastate.edu",
    "Advisor Email: jgwells@vt.edy",
    "Advisor Email: cbwilliams@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:22Z (GMT). No. of bitstreams: 2 Pembridge_JJ_D_2011.pdf: 3784516 bytes, checksum: db51347877555255cd3cd0940bab1df9 (MD5) approval+letter_08-465.pdf: 255587 bytes, checksum: 2159da0c28702f188346e85ee682f260 (MD5)   Previous issue date: 2011-10-24"
  ],
  "handle": "29516",
  "identifier_other": "etd-11092011-121154",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11092011-121154/",
  "identifier_uri": "http://hdl.handle.net/10919/29516",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Pembridge_JJ_D_2011.pdf",
    "approval+letter_08-465.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Engineering",
    "Pedagogy",
    "Design",
    "Mentoring"
  ],
  "title": "Mentoring in Engineering Capstone Design Courses: Beliefs and Practices across Disciplines",
  "type": "Dissertation"
}