{
  "contributor_author": "Liou, Chih-ling",
  "contributor_committeechair": "Jarrott, Shannon E.",
  "contributor_committeemember": [
    "Allen, Katherine R.",
    "Blieszner, Rosemary",
    "Calasanti, Toni M.",
    "Roberto, Karen A."
  ],
  "contributor_department": "Human Development",
  "date_accessioned": "2014-03-14T20:18:23Z",
  "date_adate": "2011-12-06",
  "date_available": "2014-03-14T20:18:23Z",
  "date_issued": "2011-11-01",
  "date_rdate": "2011-12-06",
  "date_sdate": "2011-11-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Some studies have demonstrated that Adult day services (ADS) benefit eldersâ   and caregiversâ   well-being; however, others indicated that infantilization exists in some ADS centers where staff ignore the lifetime of eldersâ   experiences. Many ADS environments in the United States are socially constructed as places for incompetent elders, and ADS clients may be labeled as child-like dependents. Most ADS research has been performed in Western society; little is known about ADS centers in Asian countries. Because ADS programs are promoted by the Taiwanese government to meet the needs of a growing aging population, it becomes essential to examine ADS centers and their practices in Taiwan in order to provide suggestions for future research and professional practice that supports respectful care of elders.   This dissertation examined how elders experienced their daily life within the physical and social environment of two different types of ADS centers in Taiwan. I utilized theories of environmental press, place rules, and the total institution to shape my research framework. Using ethnographic data from two ADS centers with 270 hours of observations and 23 interviews with staff and clients, I analyzed staff-client interactions and clientsâ   reactions toward staff behavior. The results are based on the analysis of clientsâ   competencies, each centerâ  s approach to care, and their physical and social environments. Staff-client interactions within the two centers occurred not only in the form of infantilization but also with age-appropriate treatment in which staff paid respect to clients.    I found two formats of staff-client interactions that reflected a culture of care uniquely Taiwanese yet also reminiscent of western programs: teacher-student format and nurse-patient interactions predominated. In one center, staff-client interactions were oriented toward a teacher-student relationship in which staff played the role of a teacher during activities by giving directions that controlled clientsâ   behavior. In the other center, staff-clients relationships were focused on physical care and therapeutic practices. Staff treated the clients as patients and had the power to rule over clientsâ   behavior by directing them how to eat and when to use the restroom. These patterns were neither inherently ageist nor absent of ageism. These differences stemmed from different models but each was supported within the context of Taiwanese culture derived from Confucianism and Japanese colonization, which emphasize hierarchical relationships.   The findings also reveal that clientsâ   individual differences influenced how they reacted toward both infantilizing and age-appropriate interactions. The differences were not only related to their competencies but also their different life experiences. These findings may inform a new approach to professional practice that incorporates a home-like environment that fosters autonomy and inhibits ageist treatment of differently-abled adults, thereby achieving a positive person-environment fit in the long-term care setting.",
  "description_provenance": [
    "Author Email: cliou@vt.edu",
    "Advisor Email: sjarrott@vt.edu",
    "Advisor Email: kallen@vt.edu",
    "Advisor Email: rmb@vt.edu",
    "Advisor Email: toni@vt.edu",
    "Advisor Email: kroberto@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:23Z (GMT). No. of bitstreams: 1 Liou_CL_D_2011.pdf: 4890687 bytes, checksum: 338a78f0ba294d25b262611061350cac (MD5)   Previous issue date: 2011-11-01"
  ],
  "handle": "29517",
  "identifier_other": "etd-11092011-204715",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11092011-204715/",
  "identifier_uri": "http://hdl.handle.net/10919/29517",
  "publisher": "Virginia Tech",
  "relation_haspart": "Liou_CL_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Adult Day Services",
    "Physical Environment",
    "Social Environment",
    "Taiwan",
    "Ethnographic study",
    "Infantilization"
  ],
  "title": "What is Going on in Adult Day Services (ADS) in Taiwan?: An Examination of Social and Physical Environments in Two Centers",
  "type": "Dissertation"
}