{
  "contributor_author": "Zheng, Jun",
  "contributor_committeechair": "Taylor, Larry T.",
  "contributor_committeemember": [
    "McNair, Harold M.",
    "Kingston, David G. I.",
    "Long, Gary L.",
    "Pinkston, J. David"
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:18:23Z",
  "date_adate": "2005-12-02",
  "date_available": "2014-03-14T20:18:23Z",
  "date_issued": "2005-10-27",
  "date_rdate": "2005-12-02",
  "date_sdate": "2005-11-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Addition of a small amount of polar solvent (i.e. modifier) which contains an ionic component (i.e. additive) to a CO2 mobile phase has shown major improvement in the elution of ionic analytes via packed column supercritical fluid chromatography (SFC).  Firstly, we focused on the elution of sodium arylsulfonate analytes by using various ionic additives, such as lithium acetate, ammonium acetate, tetramethylammonium acetate, tetrabutylammonium acetate, and ammonium chloride. The analytes were successfully eluted with all additives with good peak shape under isocratic/isobaric/isothermal conditions. Three stationary phases with different degrees of deactivation were considered. They were conventional Cyanopropyl, Deltabond Cyanopropyl, and non-chemically bonded silica. The effect of additive concentration and additive functionality on retention was also investigated. Secondly, solid state NMR of the silica packing material before and after being flushed with supercritical CO2 modified by methanol containing the ionic additives was performed to gain some insight into the retention mechanism(s). A fraction of silanol protons were undetected after being treated with the mobile phase which suggested replacement by the cationic component of the additive. CaChe calculations were carried out on several of the additives in an attempt to explain why different ionic additives produce different effects on chromatographic retention. Modification of the stationary phase and ion pairing with the analyte are two possible retention mechanisms being considered.  As ion-pair formation was considered to be one of the retention mechanisms, the use of sodium sulfonates as mobile phase additives to elute secondary and quaternary ammonium salts was then studied. Propranolol HCl, benzyltrimethylammonium chloride, and cetylpyridium chloride were chosen as the probe analytes. Sodium ethansulfonate, sodium 1-heptanesulfonate, and sodium 1-decanesulfonate were studied as mobile phase additives. The analytes were successfully eluted from Deltabond Cyano phase within 5 minutes, but were retained strongly without additive or with ammonium acetate as the additive. An Ethylpyridine column showed dramatic advantages on the elution of these ammonium analytes. No additive was required to elute these ionic compounds. Protonation of some fraction of the pyridine functional groups and the deactivation of active silanol sites were believed to be the major mechanisms responsible for this behavior. Lastly, we successfully eluted large peptides (up to 40 mers) containing a variety of acidic and basic residues in SFC. We used trifluoroacetic acid as additive in a CO2/methanol mobile phase to suppress deprotonation of peptide carboxylic acid groups and to protonate peptide amino groups. The Ethylpyridine column was used for the majority of this work. The relatively simple mobile phase was compatible with mass spectrometric (MS) detection. To our knowledge, this is the first report of the elution of peptides of this size with a simple, MS-compatible mobile phase. Fast analysis speed, the possibility of coupling multiple columns to achieve desired resolution, a normal-phase retention mechanism, and less use of organic solvents are the advantages of SFC approach for peptide separation.",
  "description_provenance": [
    "Author Email: juzheng1@vt.edu",
    "Advisor Email: ltaylor@vt.edu",
    "Advisor Email: hmcnair@vt.edu",
    "Advisor Email: dkingsto@vt.edu",
    "Advisor Email: long@vt.edu",
    "Advisor Email: pinkston.jd@pg.com",
    "Made available in DSpace on 2014-03-14T20:18:23Z (GMT). No. of bitstreams: 1 PhD-Dissertation-JSZ.pdf: 1986558 bytes, checksum: c213d1f25e8a206009551e23430a247f (MD5)   Previous issue date: 2005-10-27"
  ],
  "handle": "29519",
  "identifier_other": "etd-11102005-140731",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11102005-140731/",
  "identifier_uri": "http://hdl.handle.net/10919/29519",
  "publisher": "Virginia Tech",
  "relation_haspart": "PhD-Dissertation-JSZ.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Ionic additives",
    "Ultraviolet Detector",
    "Peptides",
    "Ionic analytes",
    "Mass Spectrometry",
    "Supercritical Fluid Chromatography"
  ],
  "title": "Supercritical Fluid Chromatography of Ionic Compounds",
  "type": "Dissertation"
}