{
  "contributor_author": "Taylor, Lawrence Clifford",
  "contributor_committeechair": "Cash, Carol S.",
  "contributor_committeemember": [
    "Tripp, Norman Wayne",
    "Twiford, Travis W.",
    "Smith, John",
    "Day-Vines, Norma L."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:18:22Z",
  "date_adate": "2009-12-08",
  "date_available": "2014-03-14T20:18:22Z",
  "date_issued": "2009-11-04",
  "date_rdate": "2009-12-08",
  "date_sdate": "2009-11-09",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study examines the effects of the Breakthrough to Literacy (BTL) reading program on first grade African American males in two urban elementary schools in southeastern Virginia.  The BTL computer enhanced reading program includes computer assisted instruction as a major component that research from the National Reading Panel (NRP) indicates is beneficial in the education of African American males (NRP, 2000).   \tThis is a comparative study utilizing quantitative methodology to report the reading outcomes of African American males in grade one and their teacherâ  s perceptions of the BTL program.  The study measures reading outcomes as well as teachersâ   perceptions of the BTL program.  The treatment group consisted of the first grade populations from schools A and B who received the BTL treatment in kindergarten (2006-2007) and first grade (2007-2008).  The treatment group was compared to schools C and D, the control group, who received the BTL treatment in kindergarten (2006-2007) only.  The data were gathered to determine if there were mean gains from the treatment and control groups through pre and posttests.  Frequency, mean, and standard deviation were calculated for each variable.  Inferential statistics were used to determine mean differences and comparisons among both groupsâ   reading results.  To determine if there was a difference in the reading outcomes of African American males who received the BTL treatment as compared to other racial/ethnic groups and gender, ANOVAs were utilized.        Overall results indicated higher level performance by the treatment group.  The study also incorporated survey methodology to determine the utility of the BTL program on first grade students in the year 2007-2008 from a teacherâ  s perspective.  The teachers in the BTL treatment group were administered the Childrenâ  s Software Evaluation Instrument Surveys (Children's Software Revue, 2008).  Out of a 5-point Likert scale, teachers rated the overall value of the BTL program as good (Overall rating 4.0).  The teachers also gave overall ratings of good (4.0) and excellent (5.0) in the following areas:  Childproof; Ease of Use; Entertaining; Design Feature; and Educational.",
  "description_provenance": [
    "Author Email: Taylor05@vt.edu",
    "Advisor Email: wtripp@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Advisor Email: ccash48@vt.edu",
    "Advisor Email: John.Smith@VBSchools.com",
    "Advisor Email: ndayvine@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:22Z (GMT). No. of bitstreams: 1 Taylor_LC_D_2009.pdf: 1614733 bytes, checksum: 37bae0c82b7c8b9dd06fd850ae3a1a88 (MD5)   Previous issue date: 2009-11-04"
  ],
  "handle": "29513",
  "identifier_other": "etd-11092009-213919",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11092009-213919/",
  "identifier_uri": "http://hdl.handle.net/10919/29513",
  "publisher": "Virginia Tech",
  "relation_haspart": "Taylor_LC_D_2009.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "urban school district",
    "multi-sensory",
    "Breakthrough to Literacy",
    "African American males",
    "reading outcomes",
    "computer enhanced reading programs",
    "achievement gap"
  ],
  "title": "A Comparative Study on the Impact of a Computer Enhanced Reading Program on First Grade African American Males in an Urban School District in Southeastern Virginia",
  "type": "Dissertation"
}