{
  "contributor_author": "Goodman, Elizabeth",
  "contributor_committeechair": "Alexander, David",
  "contributor_committeemember": [
    "Mallory, Walter D.",
    "Fortune, Jimmie C.",
    "Caldwell, M. Teressa"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:18:23Z",
  "date_adate": "2008-01-18",
  "date_available": "2014-03-14T20:18:23Z",
  "date_issued": "2007-10-08",
  "date_rdate": "2008-01-18",
  "date_sdate": "2007-11-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "There are local and national cries for high school reform, especially in our at-risk high schools; however, close examination of our at-risk high schools shows some are succeeding despite the odds against them. This is a case study of such a successful, at-risk high school. The National Association of Secondary Schools defines an at-risk school as one having a student population of at least 50% minority students, 50 % free and reduced lunch students, and 90 % or better graduating and being accepted into college. Bright Star High School was chosen because it fits these criteria and it was recognized by school officials inside and outside of the school district for its high student performance on a variety of other student achievement indicators. The collection of data took place over a twelve month period between June 2006 and June 2007. This case study answers two questions: (1) What makes Bright Star High School so successful? (2) How did it become this way? In response to the first question, the findings show that there is not one factor that makes the difference but multiple factors that interact with each other. These factors include: (1) common vision and mission; (2) a safe and secure, small, personalized environment; (3) strong, instructional leadership; (4) a faculty that functions as a learning community; (5) rigorous academic programs and intervention and support strategies (6) parent involvement. The factors identified in this case study are similar to those identified in other successful, at-risk schools and to those reported in related literature and research studies. In response to the second question, the findings show: (1) the Bright Star faculty nurtured a culture that supports and encourages the establishment and maintenance of a collaborative learning community; (2) changes at the district, state, and national levels in graduation requirements, accreditation requirements, and the No Child Left Behind Act had a powerful impact; (3) real change takes time, persistence, patience and an understanding that it is messy and not easy.",
  "description_provenance": [
    "Author Email: betsy.goodman@fcps.edu",
    "Advisor Email: mdavid@vt.edu",
    "Advisor Email: wmallory@vt.edu",
    "Advisor Email: fortunjc@vt.edu",
    "Advisor Email: teressa.caldwell@fcps.edu",
    "Made available in DSpace on 2014-03-14T20:18:23Z (GMT). No. of bitstreams: 1 CaseStudyUpload4.pdf: 770918 bytes, checksum: 00f231bc01410906cb59473f6bc5e0fb (MD5)   Previous issue date: 2007-10-08"
  ],
  "handle": "29522",
  "identifier_other": "etd-11102007-155156",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11102007-155156/",
  "identifier_uri": "http://hdl.handle.net/10919/29522",
  "publisher": "Virginia Tech",
  "relation_haspart": "CaseStudyUpload4.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "school improvement",
    "at-risk schools",
    "successful",
    "school reform"
  ],
  "title": "A Case Study of a Succesful, At-Risk High School",
  "type": "Dissertation"
}