{
  "contributor_author": "Cameron, Tracey LaShawne",
  "contributor_committeechair": "Hirt, Joan B.",
  "contributor_committeemember": [
    "Janosik, Steven M.",
    "Powell, Katrina M.",
    "Spencer, Edward F. D."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:18:24Z",
  "date_adate": "2011-11-30",
  "date_available": "2014-03-14T20:18:24Z",
  "date_issued": "2011-11-01",
  "date_rdate": "2011-11-30",
  "date_sdate": "2011-11-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The integration of work and family continues to be a challenge for women and men of the academy (Gatta & Roos, 2004). Much of the research on worklife balance in the post-secondary education setting focuses on the lives of instructional faculty (Bailyn, 2003; Bassett, 2005; Drago et al., 2006; Drago & Williams, 2000; Gatta & Roos, 2004; Massachusetts Institute of Technology, 1999; Ward & Wolf-Wendel, 2004). There is also a need to understand how university administrators juggle the demands of work and personal life. <p> The primary purpose of this phenomenological inquiry was to make meaning of the lived experiences of mid-level student affairs administrators by examining worklife balance. A secondary purpose was to gather administrator perceptions of their environment to gain insight into infrastructures that may promote or hinder worklife balance efforts. Respondents consisted of 30 mid-level student affairs administrators from an array of post-secondary institutions across the United States. Data were generated from semi-structured telephone interviews and two projection exercises. <p> Findings suggest that mid-level student affairs administrators describe their worklife experiences as driven by a shortage of time. Administrators maintain that time is a limited resource that causes difficulty when juggling competing worklife demands. Their involvement in multiple, interdependent roles is rewarding but presents ongoing personal and professional challenges. Administrators report that shortage of time, coupled with the demands of multiple roles impacts personal well-being and career satisfaction.  Mid-level student affairs administrators also identified environmental infrastructures that promote and/or hinder worklife efforts in the context of several cultural dynamics. Formal and informal support mechanisms such as policies, programs and resources, effective supervision and campus support networks assist administrators in mitigating worklife challenges. This is in contrast to expectations, behaviors, and values that reinforce unhealthy workplace norms. In addition, the lack of organizational policies and programs and poor supervision also hindered worklife efforts.",
  "description_provenance": [
    "Author Email: tcameron@vt.edu",
    "Advisor Email: jbhirt@vt.edu",
    "Advisor Email: sjanosik@vt.edu",
    "Advisor Email: kmpowell@vt.edu",
    "Advisor Email: espencer@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:24Z (GMT). No. of bitstreams: 1 Cameron_TL_D_2011.pdf: 1034639 bytes, checksum: 11d74846c9bf8c2967a30954df5a8d53 (MD5)   Previous issue date: 2011-11-01"
  ],
  "handle": "29528",
  "identifier_other": "etd-11102011-130519",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11102011-130519/",
  "identifier_uri": "http://hdl.handle.net/10919/29528",
  "publisher": "Virginia Tech",
  "relation_haspart": "Cameron_TL_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "worklife balance",
    "student affairs administrators",
    "academic personnel",
    "mid-level higher education professionals",
    "student affairs"
  ],
  "title": "The Professional & the Personal: Worklife Balance and Mid-Level Student Affairs Administrators",
  "type": "Dissertation"
}