{
  "contributor_author": "Hannah, Sabrina",
  "contributor_committeechair": "Duncan, Susan E.",
  "contributor_committeemember": [
    "Roman, Maren",
    "O'Keefe, Sean F.",
    "Marcy, Joseph E.",
    "Davis, Richey M."
  ],
  "contributor_department": "Food Science and Technology",
  "date_accessioned": "2014-03-14T20:18:24Z",
  "date_adate": "2009-11-30",
  "date_available": "2014-03-14T20:18:24Z",
  "date_issued": "2009-10-27",
  "date_rdate": "2013-10-31",
  "date_sdate": "2009-11-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Omega-3 polyunsaturated fatty acids (Ï 3 PUFAs) provide important health benefits, but dietary consumption is low. Supplementing foods with Ï 3 PUFAs is of interest, but intervention strategies are necessary to preserve the integrity of these unstable compounds. Microencapsulation of Ï 3 PUFA sources is one means of improving their stability. In this work, Ï 3 PUFA microcapsules were prepared by spray drying with chitosan and blends of chitosan, high-amylose starch, and pullulan as wall materials. The primary objectives of this research were (1) to evaluate the effect of chitosan type and oil:wall ratio on Ï 3 PUFA microcapsule properties, (2) to evaluate the effect of blending chitosan with high-amylose starch and pullulan on Ï 3 PUFA microcapsule properties, and (3) to evaluate the oxidative stability of Ï 3 PUFA microcapsules by monitoring primary and secondary oxidation products during storage. Microcapsule encapsulation efficiencies (EE) ranged from 63% to 79% with the highest EEs observed for microcapsules prepared from chitosan with higher degree of deacetylation (DD) and lower molecular weight (MW). Median microcapsule size ranged from 3Î¼m to 11Î¼m. Moisture contents were all below 7% and water activities (aw) were below 0.27. Microcapsules prepared from blends of chitosan with starch and/or pullulan had lower aw values than those prepared from chitosan alone. Oxidative stability was evaluated by measuring oxidation induction time (OIT) using pressure differential scanning calorimetry. OIT values ranged from 14 to 20 minutes. Microcapsules prepared from chitosan with lower DD and higher MW had longer OITs than those prepared from chitosan with higher DD and lower MW. Microcapsules prepared from blends of chitosan, starch, and pullulan had longer OITs than those prepared from chitosan alone. Oxidative stability of microcapsules during long term storage was evaluated on one microcapsule formulation by monitoring peroxide value (PV) and secondary oxidation products by HS-SPMEGC/ MS. Volatiles including propanal, 1-penten-3-ol, pentanal, hexanal, and 2,4-heptadienal were detected in the headspace of the microcapsules; however, PVs did not indicate substantial oxidation of the Ï 3-PUFA source during 5 weeks of storage. Chitosan, high-amylose starch, and pullulan are effective materials for microencapsulation of Ï 3 PUFA sources.",
  "description_provenance": [
    "Author Email: ssegnere@vt.edu",
    "Advisor Email: maren.roman@vt.edu",
    "Advisor Email: okeefes@vt.edu",
    "Advisor Email: jmarcy@vt.edu",
    "Advisor Email: rmdavis@vt.edu",
    "Advisor Email: duncans@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:24Z (GMT). No. of bitstreams: 1 Hannah_SabrinaM_D_2009.pdf: 3748018 bytes, checksum: a8fa2d27911a24ce8cc90d6386d2fe6e (MD5)   Previous issue date: 2009-10-27"
  ],
  "handle": "29525",
  "identifier_other": "etd-11102009-155653",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11102009-155653/",
  "identifier_uri": "http://hdl.handle.net/10919/29525",
  "publisher": "Virginia Tech",
  "relation_haspart": "Hannah_SabrinaM_D_2009.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "pullulan",
    "omega-3 fatty acid",
    "fish oil",
    "microencapsulation",
    "spray drying",
    "high-amylose starch",
    "chitosan"
  ],
  "title": "Microencapsulation of an omega-3 polyunsaturated fatty acid source with polysaccharides for food applications",
  "type": "Dissertation"
}