{
  "contributor_author": "Xiao, Yunxiang III",
  "contributor_committeechair": "Mullins, Donald E.",
  "contributor_committeemember": [
    "Mullins, Donald E.",
    "Berry, Duane F.",
    "Bloomquist, Jeffrey R.",
    "Hetzel, Glen H.",
    "Pfeiffer, Douglas G."
  ],
  "contributor_department": "Entomology",
  "date_accessioned": "2014-03-14T20:18:24Z",
  "date_adate": "1997-12-10",
  "date_available": "2014-03-14T20:18:24Z",
  "date_issued": "1997-11-17",
  "date_rdate": "1998-12-10",
  "date_sdate": "1997-11-17",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Dissipation and Leachability of Formulated Chlorpyrifos and Atrazine in Organically-amended Soils    Yunxiang Xiao  Dr. Donald E. Mullins, Chairperson  Department of Entomology    (ABSTRACT)    Bioremediation was studied in soils containing high concentrations of formulated chlorpyrifos (5 mg kg-1 Dursban® 4E) and atrazine (5 mg kg-1 AAtrex® 4L) using amendments including lignocellulosic sorbents, microbial nutrients (vegetable oil, corn meal and fertilizers), and microbial extracts from organic media previously exposed to these pesticides (chlorpyrifos and atrazine, respectively).  Radiolabeled atrazine was used to examine the various dissipation routes in contaminated soil, also amended with lignocellulosic sorbents and microbial nutrients.    Both chlorpyrifos and atrazine dissipation from contaminated soils was enhanced by organic-based material amendments.  The half-lives of chlorpyrifos based on extractability for soils unamended and amended with vegetable oil and peat moss were 87 and 52 days, respectively. The half-lives of atrazine in unamended and amended soil (vegetable oil, peat moss and fertilizers) were 175 and 40 days, respectively.  The leachability of chlorpyrifos from contaminated soil was dramatically reduced by 82% during the first 30 days of incubation in treatments amended with vegetable oil and peat moss while only a 28% of reduction in leachability occurred in the corresponding unamended controls.  Only a slight reduction of atrazine leachability was detected in amended treatments after 120 days of incubation.    Differences were found in the leachability of chlorpyrifos and atrazine when they were applied to soil either as technical grade or formulated material.  The presence of surfactants and other adjuvants in formulated chlorpyrifos (Dursban® 4E) reduced chlorpyrifos leachability in contaminated soil.  Chlorpyrifos leachability was reduced by 43% in the formulated chlorpyrifos treatments, whereas there was a negligible decrease in technical chlorpyrifos treated soil during the first 3 days after contamination.  Atrazine extractability and leachability was not affected by its formulation (AAtrex® 4L).    Amendments with lignocellulosic sorbents and nutrients decreased atrazine®s volatility from contaminated soils.  After 16 weeks of incubation, less than 1% of 14C-atrazine was volatilized from incubated soils. Overall, after 16 weeks of incubation less than 4% of 14C-atrazine was mineralized and more radioactivity was recovered from amended treatments than unamended treatments as 14CO2.  The major portion of radioactivity (62%) was associated with physisorbed atrazine represented by the ethylacetate extract I from unamended treatments while only 28% of initial applied radioactivity was recovered in the corresponding amended treatments.  Based on the sum of radioactivity in humic and fulvic acids, approximately 14% of radioactivity was incorporated or chemisorbed atrazine and its metabolites in both unamended and amended treatments.  Forty-five percent of the initially applied radioactivity was associated with alkali insoluble fraction in amended treatments but only 17% of the initially applied radioactivity was detected in the corresponding unamended treatments.  Less than 2 % of initial activity associated with physisorbed portions of fulvic acids and alkaline insoluble fraction indicated as the radioactivity in methylene chloride and ethylacetate extract II .  Over time, more radioactivity was associated with polar atrazine hydroxylated degradation products.",
  "description_provenance": [
    "Author Email: yunxiang@vt.edu",
    "Advisor Email: mullinsd@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:24Z (GMT). No. of bitstreams: 2 RW11.pdf: 252955 bytes, checksum: 9510f1608e3aa3a2de0342f9eb756da1 (MD5) RW21.pdf: 120954 bytes, checksum: f91ba01ad2e28b6b6312ed99d146d921 (MD5)   Previous issue date: 1997-11-17"
  ],
  "handle": "29529",
  "identifier_other": "etd-111097-103727",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-111097-103727/",
  "identifier_uri": "http://hdl.handle.net/10919/29529",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "RW11.pdf",
    "RW21.pdf"
  ],
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known. I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Extractability",
    "Bioremediation",
    "Chlorpyrifos",
    "Atrazine",
    "Leachability"
  ],
  "title": "Dissipation and Leachability of Formulated Chlorpyrifos and Atrazine in Organically-amended Soils",
  "type": "Dissertation"
}