{
  "contributor_author": "Sanders, Wesley Crowell",
  "contributor_committeechair": "Anderson, Mark R.",
  "contributor_committeecochair": "Morris, John R.",
  "contributor_committeemember": [
    "Brewer, Karen J.",
    "Long, Gary L.",
    "Tissue, Brian M."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:18:23Z",
  "date_adate": "2008-12-02",
  "date_available": "2014-03-14T20:18:23Z",
  "date_issued": "2008-11-04",
  "date_rdate": "2011-09-05",
  "date_sdate": "2008-11-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The focus of this dissertation research involves surface charge manipulation of functionalized monolayers.  Application of potential to acid or base terminated organic films immobilized on electrodes results in the ionization of the terminal groups.  The ionization of these groups using applied potential provides conditions favorable the control of polyelectrolyte deposition to the monolayer surface.<p>       Research is presented that asserts that the interfacial pH of acid or base terminated monolayers responds to applied potential as a result of the accumulation of phosphate counterions to the monolayer-solution interface.  Results obtained from applied potential modulation of surface charge endeavors strongly suggest that manipulation of terminal group ionization with applied potential 창  turns on창   or 창  turns off창   the charge of the monolayer.  Switching on the surface charge of functionalized monolayers using applied potential yields conditions that make it possible for the promotion or inhibition of electrostatic attachment of polyelectrolyte to the monolayer surface.  <p>       Electrostatic interactions between immobilized polyelectrolytes and redox probes result in changes in electron transfer that can be monitored with electrochemical impedance measurements.  Impedance measurements provide a qualitative assessment of the degree of potential-driven polyelectrolyte self assembly.  The electrostatic interactions between the redox probe in solution and the terminal region of monolayers directly affects the extent of charge-transfer between the electrode and the redox probe in solution.  For this reason, impedance measurements are able to provide an indication of whether or not potential drives to electrostatic deposition to the terminal region of a functionalized monolayer.<p>          Unlike impedance measurements, quartz crystal microbalance measurements provide quantitative mass assessments that confirm polyelectrolyte deposition of inhibition under the direction of applied potential.  Application of appropriate potentials is shown to induce variations in the electrostatic interactions between redox probes in solution and terminal groups of monolayers.  Variations in the electrostatic interactions between the modified electrode and the redox probe modulate electron transfer that produces varying current.   Since scanning electrochemical microscopy (SECM) relies on modulation of feedback current underneath a ten-micrometer platinum tip, SECM provides a means for monitoring of potential-driven surface charge modulation.  Experiments presented in this dissertation will show that in addition to monitoring the effect of applied potential on the charge of ionizable surface groups, SECM can also be used to selectively deposit a polyelectrolyte to the surface of a carboxylic acid terminated monolayer.  The SECM tip was rastered over the surface of a functionalized monolayer in the form of a simple pattern while the electrode was immersed in a dilute polyelectrolyte solution.  As the SECM tip was moved and potential stepped more positive than the PZC, ionization was confined ionization to one spot encouraging localized ionic self assembly.",
  "description_provenance": [
    "Author Email: wcsander@vt.edu",
    "Advisor Email: kbrewer@vt.edu",
    "Advisor Email: glong@vt.edu",
    "Advisor Email: tissue@vt.edu",
    "Advisor Email: maander6@vt.edu",
    "Advisor Email: morris@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:23Z (GMT). No. of bitstreams: 1 WCS_dissertation_revised.pdf: 3184211 bytes, checksum: 30ab26c3f121c8ac63d81fb71c963ec0 (MD5)   Previous issue date: 2008-11-04"
  ],
  "handle": "29523",
  "identifier_other": "etd-11102008-094806",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11102008-094806/",
  "identifier_uri": "http://hdl.handle.net/10919/29523",
  "publisher": "Virginia Tech",
  "relation_haspart": "WCS_dissertation_revised.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "redox probe",
    "scanning electrochemical microscopy",
    "Ionic self assembly",
    "polyelectrolytes",
    "electrochemical impedance",
    "quartz crystal microbalance"
  ],
  "title": "Examining the Effects of Applied Potential on the Surface Charge of Functionalized Monolayers for Site-Directed Ionic Self Assembly",
  "type": "Dissertation"
}