{
  "contributor_author": "Klinedinst, Derek Bryan",
  "contributor_committeechair": "Wilkes, Garth L.",
  "contributor_committeemember": [
    "Long, Timothy E.",
    "Moore, Robert B.",
    "Whittington, Abby R."
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-03-14T20:18:24Z",
  "date_adate": "2011-11-21",
  "date_available": "2014-03-14T20:18:24Z",
  "date_issued": "2011-11-02",
  "date_rdate": "2011-11-21",
  "date_sdate": "2011-11-10",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The foundational studies of this dissertation concern the characterization of segmented polyurethanes and polyureas synthesized without the use of chain extenders창  molecules that are typically used to promote a microphase separated morphology that gives these materials their useful characteristics. Polyurethanes in which a single asymmetric diisocyanate comprising the whole of the hard segment were found to display poor microphase separation. Conversely, polyurethanes in which a single symmetric diisocyanate composed the hard segment were found to display good microphase separation. The more efficient packing of the symmetric hard segments also led to an increase in hard segment connectivity and hence higher values of storage moduli in these systems. When hydroxyl-terminated diisocyanates were replaced with amine-terminated diisocyanates, polyureas were formed. Here too, diisocyanate symmetry was found to play a key role with symmetric diisocyanates leading to better microphase separation. In addition, the polyurea materials displayed broader service temperature windows than their polyurethane counterparts as the relatively stronger bidentate hydrogen bonding replaced monodentate hydrogen bonding in these materials. A thread-like, microphase separated morphology was visually confirmed using atomic force microscopy. Other techniques such as ambient temperature tensile testing, and wide and small angle x-ray scattering were employed to confirm the presence of the microphase separated structure. The investigation into the effects of diisocyanate chemistry and its symmetry was broadened to incorporate non-chain extended polyurethane materials with different soft segment molecular weights, as well as polyurethanes that did contain chain extenders. Once again the effect of using symmetric versus asymmetric diisocyanates was evident in the structure창  property behavior of these systems, with symmetric diisocyanates forming materials that displayed better microphase separation and more connectivity of their hard domains. Lastly, in a departure from the segmented copolymer area, a study was conducted into the influence of casting variables on the solid-state structure of synthetic polypeptide films based on glutamate chemistry. The effect of solvent evaporation was determined to play a key role in the morphology of these polypeptide films. Measured small angle light scattering patterns were compared to computer calculated patterns to reveal information about the structure, shape, and length scale of the polypeptide structure.",
  "description_provenance": [
    "Author Email: dklinedi@vt.edu",
    "Advisor Email: gwilkes@vt.edu",
    "Advisor Email: telong@vt.edu",
    "Advisor Email: rbmoore3@vt.edu",
    "Advisor Email: awhit@mse.vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:24Z (GMT). No. of bitstreams: 2 Klinedinst_DB_D_2011.pdf: 12677157 bytes, checksum: 637a096c1c163e3b6f63dc1b556aad68 (MD5) Klinedinst_DB_D_2011_Copyright.pdf: 1512752 bytes, checksum: 7552ef698a272cd9f5a2f19a231dde7b (MD5)   Previous issue date: 2011-11-02"
  ],
  "handle": "29527",
  "identifier_other": "etd-11102011-095049",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11102011-095049/",
  "identifier_uri": "http://hdl.handle.net/10919/29527",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Klinedinst_DB_D_2011.pdf",
    "Klinedinst_DB_D_2011_Copyright.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "segmented copolymer",
    "microphase separation",
    "hydrogen bonding",
    "structure창  property behavior",
    "polyurethane",
    "polyurea",
    "atomic force microscopy",
    "polypeptide",
    "glutamate"
  ],
  "title": "STRUCTURE창  PROPERTY RELATIONSHIPS OF: 1) NOVEL POLYURETHANE AND POLYUREA SEGMENTED COPOLYMERS AND 2) THE INFLUENCE OF SELECTED SOLUTION CASTING VARIABLES ON THE SOLID STATE STRUCTURE OF SYNTHETIC POLYPEPTIDE FILMS BASED ON GLUTAMATE CHEMISTRY",
  "type": "Dissertation"
}