{
  "contributor_author": "Diefenderfer, Stacey D.",
  "contributor_committeecochair": [
    "Flintsch, Gerardo W.",
    "Al-Qadi, Imadeddin L."
  ],
  "contributor_committeemember": [
    "Trani, Antoino A.",
    "Loulizi, Amara",
    "Case, Scott W."
  ],
  "contributor_department": "Civil Engineering",
  "date_accessioned": "2014-03-14T20:18:25Z",
  "date_adate": "2009-12-09",
  "date_available": "2014-03-14T20:18:25Z",
  "date_issued": "2009-10-12",
  "date_rdate": "2009-12-09",
  "date_sdate": "2009-11-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study investigated the influence of material properties on fatigue life through laboratory fatigue testing of eleven Superpave hot mix asphalt (HMA) mixtures in use at the Virginia Smart Road. Mixtures were sampled from the plant and produced in the laboratory to investigate the influence of production method. Specimens were cut from the in-situ pavement and compacted in the laboratory to evaluate the influence of compaction method. Third point beam fatigue testing was performed at 25ºC and 10Hz. Additional testing at frequencies of 1 Hz and 5Hz, and at 10 Hz including rest periods of 0.4sec and 0.9sec were performed for one mixture to explore the impact of frequency and rest periods. Analyses were performed on the strain-life relationships and predicted endurance strain limits for the mixtures.  Investigation of strain-life relationships for several mixtures indicated that small differences in mixture volumetrics due to the production  method have minimal impact on the laboratory fatigue performance of HMA. Comparisons of expected fatigue performance for one mixture indicated that shorter fatigue lives (under the same strain conditions) may be expected for laboratory-compacted specimens when compared to field-compacted specimens, despite visual  observation of damage (surface cracking) in the field-compacted specimens. Testing performed on one mixture to determine the influence of different loading frequencies showed that fatigue life was independent of the  requencies tested. Investigation of rest period inclusion indicated no differences in fatigue life for loading conducted at 10 Hz frequency and no rest period, 0.4sec rest period, or 0.9sec rest period. The evaluation of specimens cut from the in-situ pavement indicated that location within the lane and orientation did not significantly affect laboratory fatigue performance. The effect of aggregate size was considered; however, results were inconclusive. Using predictive strain-life fatigue equations, the benefits of polymer-modification of binders and use of SMA were shown for mixtures produced in the laboratory according to the job mix formula and to match the plant-produced volumetrics. Evaluation of the predicted fatigue strain endurance limit was performed using an energy-based and an empirical method. The energy method was shown to estimate significantly higher endurance limit strains for mixtures.",
  "description_provenance": [
    "Author Email: stacey.diefenderfer@vdot.virginia.gov",
    "Advisor Email: vuela@vt.edu",
    "Advisor Email: amlouliz@vt.edu",
    "Advisor Email: scase@exchange.vt.edu",
    "Advisor Email: flintsch@vt.edu",
    "Advisor Email: alqadi@uiuc.edu",
    "Made available in DSpace on 2014-03-14T20:18:25Z (GMT). No. of bitstreams: 1 Diefenderfer_SD_D_2009.pdf: 902557 bytes, checksum: a89df7aa08a08512f292dfbe02a8b43b (MD5)   Previous issue date: 2009-10-12"
  ],
  "handle": "29538",
  "identifier_other": "etd-11112009-213854",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11112009-213854/",
  "identifier_uri": "http://hdl.handle.net/10919/29538",
  "publisher": "Virginia Tech",
  "relation_haspart": "Diefenderfer_SD_D_2009.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Superpave",
    "hot mix asphalt",
    "fatigue"
  ],
  "title": "Investigation of Fatigue Properties of Superpave HMA at the Virginia Smart Road",
  "type": "Dissertation"
}