{
  "contributor_author": "Myers, Juliette  Burke",
  "contributor_committeechair": "Parks, David J.",
  "contributor_committeemember": [
    "Billingsley, Bonnie S.",
    "Tripp, Norman Wayne",
    "Margheim, Dale"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:18:25Z",
  "date_adate": "2008-12-11",
  "date_available": "2014-03-14T20:18:25Z",
  "date_issued": "2008-11-04",
  "date_rdate": "2008-12-11",
  "date_sdate": "2008-11-11",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The federal government has taken an increasingly active role in its involvement in public education since the turn of the twentieth century. Prior to World War II, federal intervention in public education was a result of war initiatives. Following World War II, the United States experienced a number of social and economic conditions that had implications for public education. Among these were a rapid increase in student enrollments resulting from the post World War II baby boom, continuing racial segregation, and chronic inferior education for African Americans and economically disadvantaged students of all races and ethnic groups. To combat the economic, social, and political implications associated with these conditions, the federal government worked with states and local departments of education to formulate plans for educational reform. During the 1960s, federal aid to public schools grew from half a billion dollars in 1960 to 3.5 billion in 1970 (Kantor & Lowe, 1995). Federal aid was increased to provide support for educational facilities and to provide compensatory educational programs for economically disadvantaged students through Head Start of the Economic Opportunity Act of 1964 and Title I of the Elementary and Secondary Education Act of 1965. Educators were encouraged to develop programs to meet the needs of the minority, disadvantaged, and special education populations through the provisions of these acts and subsequent appropriations. This is the report of a historical study of the federal response to the needs of the identified students as implemented through Roanoke County Public Schools.  The purpose of this study is to provide a historical account of the development of Head Start  and Title I programs in Roanoke County Public Schools within the national context of Head Start and Title I programs. The potential impact of this study includes a greater understanding of the influences that led to the development of Head Start and Title I at the national level and the subsequent educational services implemented through Head Start and Title I programs in Roanoke County Public Schools.",
  "description_provenance": [
    "Author Email: jbmyers@vt.edu",
    "Advisor Email: bbillingsley@vt.edu",
    "Advisor Email: wtripp@vt.edu",
    "Advisor Email: Dale_Margheim@leagueoftherapists.com",
    "Advisor Email: parks@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:25Z (GMT). No. of bitstreams: 1 JulietteMyersETD.pdf: 499916 bytes, checksum: 72f564386cc28bb3fbbb966c50226729 (MD5)   Previous issue date: 2008-11-04"
  ],
  "handle": "29537",
  "identifier_other": "etd-11112008-210148",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11112008-210148/",
  "identifier_uri": "http://hdl.handle.net/10919/29537",
  "publisher": "Virginia Tech",
  "relation_haspart": "JulietteMyersETD.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Federal Compensatory Programs",
    "Economic Opportunity Act",
    "Elementary and Secondary Education Act",
    "Title I",
    "Roanoke County",
    "Virginia",
    "Head Start"
  ],
  "title": "Federal Compensatory Education Programs of the 1960s: The Implementation of Head Start and Title I Services in Roanoke County Public Schools",
  "type": "Dissertation"
}