{
  "contributor_author": "Mondak, Michael Joseph",
  "contributor_committeechair": "Parson, Stephen R.",
  "contributor_committeemember": [
    "Twiford, Travis W.",
    "Ralston, Wayne A.",
    "Mallory, Walter D.",
    "Byers, Larry"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:18:26Z",
  "date_adate": "2004-12-08",
  "date_available": "2014-03-14T20:18:26Z",
  "date_issued": "2004-10-29",
  "date_rdate": "2004-12-08",
  "date_sdate": "2004-11-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "With increasing emphasis being placed on the selection of highly qualified teachers as mandated by the No Child Left Behind legislation (NCLB) of 2001, growing numbers of student populations, and the decreasing numbers of teachers entering the profession, it is evident that the teacher selection process must assume a more scientific path. In order to improve the selection process it is necessary to look at many aspects of this procedure. Specifically, what characteristics do teacher candidates possess that would qualify them for a particular position and, to what degree do the school identifiers play in this process? This is a study of the affects various school characteristics have on the selection process of elementary school teachers in one Virginia school district. Through a literature review conducted on the teacher selection process, a common group of thirty teacher characteristics grouped into four domains have been identified that if associated with teachers, have positive effects on instruction. The four domains that have been identified are Instruction, Personality, Orientation to Students, and Qualifications. A survey was utilized to determine the degree to which school administrators and teachers involved in the interview process place on the identified teacher characteristics and domains.  Descriptive factors that reflect the differences in the schools for this study have been identified and an impact challenge index has been developed for each school. Descriptive factors utilized to determine the impact challenge index included minority and special population percentages of students, mobility indexes, and free and reduced price lunch percentages. In addition, data distinctive to each school's accreditation status and Adequate Yearly Progress (AYP) have been determined.   ANOVAs were performed to determine if there were significance between variables presented in this study of challenge impact levels, AYP performance, and position. Results of this study are mixed and revealed only a few significant differences and/or substantive meaningful results between variables.",
  "description_provenance": [
    "Author Email: mmondak@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:26Z (GMT). No. of bitstreams: 1 MondakTeacherSelectionFinal.pdf: 785027 bytes, checksum: 3ce738bae34bab38aa969fee295daf46 (MD5)   Previous issue date: 2004-10-29"
  ],
  "handle": "29543",
  "identifier_other": "etd-11122004-192218",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11122004-192218/",
  "identifier_uri": "http://hdl.handle.net/10919/29543",
  "publisher": "Virginia Tech",
  "relation_haspart": "MondakTeacherSelectionFinal.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Teacher Interview",
    "Teacher Selection"
  ],
  "title": "Infuences on Teacher Selection",
  "type": "Dissertation"
}