{
  "contributor_author": "Olson, Katrina Marie",
  "contributor_committeechair": "Cassell, Bennet G.",
  "contributor_committeemember": [
    "Akers, Robert Michael",
    "Hanigan, Mark D.",
    "Notter, David R.",
    "Pearson, Ronald E."
  ],
  "contributor_department": "Dairy Science",
  "date_accessioned": "2014-03-14T20:18:27Z",
  "date_adate": "2008-11-19",
  "date_available": "2014-03-14T20:18:27Z",
  "date_issued": "2008-11-04",
  "date_rdate": "2009-11-19",
  "date_sdate": "2008-11-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The Virginia Tech crossbreeding program began in the fall of 2002 by mating Holstein and Jersey foundation females to Holstein and Jersey bulls to create HH, HJ, JH, and JJ breed groups (sire breed listed first).  Collection of daily dry matter intakes (DMI) began in the fall of 2005 and continued through spring of 2008. DMI were measured for two weeks out of every six week period in first lactation on 44, 32, 29, and 13 HH, HJ, JH, and JJ cows.  Daily milk and body weights and monthly milk components were collected.  The National Research Council (NRC) DMI prediction equation was used across breed groups to investigate breed differences.  DMI prediction equations were developed across breeds.  Random regression model were used to predict energy consumed (TEC), energy needed for production, maintenance, and growth at every week of lactation (WOL). Energy balance (EB) was calculated at every WOL by subtracting energy for production, maintenance, growth, and pregnancy from TEC.  Common health events were recorded if they occurred in the first 100 days of lactation.  Logistic regression was used to analyze health disorder. The HJ and JH were not different from each other in any analyses.  The NRC under-predicted DMI for HH and over-predicted DMI for HJ, JH, and JJ.  There were significant breed differences in the prediction equations developed.  Results indicated that breeds differ in DMI after accounting for production and body weights.   The HH cows consumed more energy than HJ and JJ cows.  The HH, HJ, and JJ were not different from each other for production but were different from JJ.  The JH allocated less energy to maintenance than the HH.  There were no breed differences for weeks required to reach positive EB, return to positive cumulative EB, or EB at week 21 of lactation. The HJ, JH, and JJ were more likely to have an incidence of mastitis than HH.  The HJ and JH were less likely to have an incidence of metritis than HH.  The results indicate breeds differ in DMI, and health diseases and evidence suggests differences in characterization of EB and warrants further investigation.",
  "description_provenance": [
    "Author Email: kmolson@vt.edu",
    "Advisor Email: bcassell@vt.edu",
    "Advisor Email: rma@vt.edu",
    "Advisor Email: mhanigan@vt.edu",
    "Advisor Email: drnotter@vt.edu",
    "Advisor Email: rep@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:27Z (GMT). No. of bitstreams: 1 OlsonDissertationRevis.pdf: 700960 bytes, checksum: e070f0277bfa5d8ae0f2f067e9cdb39e (MD5)   Previous issue date: 2008-11-04"
  ],
  "handle": "29549",
  "identifier_other": "etd-11122008-102354",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11122008-102354/",
  "identifier_uri": "http://hdl.handle.net/10919/29549",
  "publisher": "Virginia Tech",
  "relation_haspart": "OlsonDissertationRevis.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "dairy cattle",
    "energy balance",
    "crossbreeding"
  ],
  "title": "The role of energy balance in productivity, health, and fertility of first lactation Holsteins, Jerseys, and their reciprocal crosses",
  "type": "Dissertation"
}