{
  "contributor_author": "Embi, Roslani",
  "contributor_committeechair": "O'Reilly, Patrick A.",
  "contributor_committeemember": [
    "Eschenmann, Konrad Kurt",
    "Lockee, Barbara B.",
    "Stewart, Daisy L."
  ],
  "contributor_department": "Career and Technical Education",
  "date_accessioned": "2014-03-14T20:18:27Z",
  "date_adate": "2007-12-10",
  "date_available": "2014-03-14T20:18:27Z",
  "date_issued": "2007-10-29",
  "date_rdate": "2007-12-10",
  "date_sdate": "2007-11-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This study was designed to determine the levels of computer anxiety, computer self-efficacy, and computer applications usage among members of the Faculty of Accountancy at Universiti Teknologi MARA (UiTM), Malaysia. The importance of the role of technology and information systems in economic development has grown significantly throughout the globe, thus affecting how nations educate students in order to produce a more technologically literate workforce. With the implementation of the smart schools concept in Malaysia, whereby these facilities are equipped with multimedia technology and world-wide networking, educators in higher learning institutions have to prepare themselves for high school graduates who will be technologically literate. While there have been much research in this area conducted in the United States at many different levels, it has never been conducted in Malaysia, specifically with the accounting faculty at UiTM. Therefore, a total of 368 full-time accounting faculty members who were teaching in the 2006/2007 academic year were surveyed, using questionnaires. The questionnaires were focused on obtaining information with regard to participants and computer: (a) anxiety, (b) self-efficacy, (c) and software usage, as well as (d) general information. At the end of the data collection period, 262 responses were received from the population. A test of the nul1 hypothesis revealed no evidence to imply that the respondent groupâ  s gender and UiTM location distributions were significantly different from the population distributions based on the same attributes. Together with a high response rate (71%), these findings add credibility to the belief that the sample was representative of the population. This study showed that a majority of the faculty had low levels of computer anxiety and high levels of computer self-efficacy. Statistical analysis showed no significant mean differences between gender and age categories nor was there an interaction between the two said variables related to computer anxiety. However, pertaining to computer self-efficacy, the study found a statistically significant mean difference between age categories. Furthermore, the results from stepwise multiple regressions also indicated that the most efficient model for predicting the level of computer anxiety was composed of a single variable, computer self-efficacy.",
  "description_provenance": [
    "Author Email: rembi@vt.edu",
    "Advisor Email: oreilly@vt.edu",
    "Advisor Email: eschmann@vt.edu",
    "Advisor Email: lockeebb@vt.edu",
    "Advisor Email: daisys@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:27Z (GMT). No. of bitstreams: 1 Roslani_Dissertation.pdf: 1009252 bytes, checksum: 75edce4b989636b8e1acd958655d0bdd (MD5)   Previous issue date: 2007-10-29"
  ],
  "handle": "29546",
  "identifier_other": "etd-11122007-155104",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11122007-155104/",
  "identifier_uri": "http://hdl.handle.net/10919/29546",
  "publisher": "Virginia Tech",
  "relation_haspart": "Roslani_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Computer Self-Efficacy",
    "Anxiety",
    "Computer Anxiety",
    "Self-Efficacy"
  ],
  "title": "Computer Anxiety and Computer Self-Efficacy Among Accounting Educators at Universiti Teknologi MARA, Malaysia.",
  "type": "Dissertation"
}