{
  "contributor_author": "Stapleton, Rory Magdalene P.",
  "contributor_committeecochair": [
    "Earthman, Glen I.",
    "Twiford, Travis W."
  ],
  "contributor_committeemember": [
    "Martin, Rosalie Marie",
    "Eller, John F."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:18:27Z",
  "date_adate": "2007-11-29",
  "date_available": "2014-03-14T20:18:27Z",
  "date_issued": "2007-10-29",
  "date_rdate": "2007-11-29",
  "date_sdate": "2007-11-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p> The purpose of this study is to determine whether the City Public Schoolsâ   Leadership Academy has met its primary goal of preparing public school administrators to serve the school division.  This study is built on research that reveals that there are a number of principal preparation programs available for future school leaders that do not adequately prepare the applicants for leadership roles.  Collaborative partnerships between school divisions and colleges and universities are being formed in order to prepare public school leaders for the administrative demands of todayâ  s public schools, challenged by the mandates of the No Child Left Behind legislation.  In particular, school divisions are forming grow-your-own leadership academies in order to meet the need for filling positions that are being vacated by retiring administrators.  This study utilizes mixed-methodologies comprised of quantitative and qualitative data.  Eleven completers of the City Public Schoolsâ   Leadership Academy who obtained administrative positions in the division during the 2004-2006 school years were a part of the study.  In addition, their supervisors participated in the study.</p><p> The research highlights, in quantitative data, the survey responses of ten novice administrators who were completers of the City Public Schoolsâ   Leadership Academy.  Seminars that the novice administrators experienced were based on the six Interstate School Leaders Licensure Consortium (ISLLC) standards.  Thus, the survey and interview questions were  i adapted from the ISLLC standards.  Adding richness to the study is the data that was generated in the form of in-depth interviews with the eight principals and five supervisors of the novice administrators.  Findings revealed that the novice administrators had an overall perception that  the City Public Schoolsâ   Leadership Academy prepared them to be school leaders.  Although the  supervisors felt, that the novice administrators were prepared, there were a few areas where they felt the program was in need of improvement.  Additional findings gave school leaders a basis from which to make programmatic decisions that should result in a more effective leadership training program. </p>",
  "description_provenance": [
    "Author Email: rstapleton@sbo.hampton.k12.va.us",
    "Advisor Email: earthman@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Advisor Email: rosemartin@vt.edu",
    "Advisor Email: jeller@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:27Z (GMT). No. of bitstreams: 1 Dissertation.pdf: 2356695 bytes, checksum: ae33532df79026b495591bd74f2946e1 (MD5)   Previous issue date: 2007-10-29"
  ],
  "handle": "29545",
  "identifier_other": "etd-11122007-154307",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11122007-154307/",
  "identifier_uri": "http://hdl.handle.net/10919/29545",
  "publisher": "Virginia Tech",
  "relation_haspart": "Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Principal Preparation Programs",
    "Leadership Academy",
    "Program Evaluation",
    "ISLLC Standards"
  ],
  "title": "A Study of the City Public Schools' Leadership Academy for Aspiring School Leaders",
  "type": "Dissertation"
}