{
  "contributor_author": "Hall, Roderick Ashley",
  "contributor_committeechair": "Janosik, Steven M.",
  "contributor_committeemember": [
    "Morgan, George E.",
    "Chang, Mido",
    "Hyer, Patricia B."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:18:27Z",
  "date_adate": "2009-12-11",
  "date_available": "2014-03-14T20:18:27Z",
  "date_issued": "2009-11-03",
  "date_rdate": "2009-12-11",
  "date_sdate": "2009-11-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "EXPLORING THE RELATIONSHIP BETWEEN PERCEIVED COST OF ATTENDANCE AND COLLEGE MATRICULATION  Roderick Ashley Hall  ABSTRACT   Researchers have consistently found that students and their parents have a distorted view of the costs of college attendance (Grodsky & Jones, 2004; Horn, Chen, & Chapman, 2003; Ikenberry & Hartle, 1998; Mumper, 1996). Those who are able to give an estimate of the tuition for various higher education alternatives often overestimate the actual price. When asked to estimate the tuition that in-state undergraduates would pay at four-year colleges in a given year, most students and their parents thought that the price was twice the actual amount (Horn et al., 2003b). Seventy-one percent of all individuals, and 83% of African-Americans believed that college was unaffordable for most families. The majority of individuals over-estimated the price by several thousands of dollars (Hartle, 1998). This study examined the literature on perceived price and used the theoretical construct based on the work of Nobel Prize winner Gary Becker to develop a methodology for studying whether studentsâ   perceived price of has a statistically significant impact on their plan to attend college and their actual matriculation.  Applying Beckerâ  s theory, having faulty information on the price of attendance would result in people incorrectly weighting the cost-benefit equation and making what could be considered irrational decisions in the presence of complete information.   Highlighting the problem of misperceived price is the contribution this study makes to the literature. Further study is warranted to determine the extent to which individuals use misperceived prices to make decisions on whether to plan to attend higher education.",
  "description_provenance": [
    "Author Email: roderick.hall@vt.edu",
    "Advisor Email: gmorgan@vt.edu",
    "Advisor Email: sjanosik@vt.edu",
    "Advisor Email: mchang@vt.edu",
    "Advisor Email: hyerp@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:27Z (GMT). No. of bitstreams: 1 R_A_Hall_Final_Dissertation.pdf: 595381 bytes, checksum: 61d378bb1e259b96d8d9d8eb083c0b8c (MD5)   Previous issue date: 2009-11-03"
  ],
  "handle": "29550",
  "identifier_other": "etd-11122009-200643",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11122009-200643/",
  "identifier_uri": "http://hdl.handle.net/10919/29550",
  "publisher": "Virginia Tech",
  "relation_haspart": "R_A_Hall_Final_Dissertation.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "price",
    "tuition",
    "perception",
    "matriculation",
    "higher education",
    "cost"
  ],
  "title": "Exploring the Relationship Between Perceived Cost of Attendance and College Matriculation",
  "type": "Dissertation"
}