{
  "contributor_author": "Parvatareddy, Hari",
  "contributor_committeechair": "Dillard, David A.",
  "contributor_committeemember": [
    "Wilkes, Garth L.",
    "Ward, Thomas C.",
    "Kander, Ronald G.",
    "Dowling, Norman E.",
    "Dillard, John G."
  ],
  "contributor_department": "Materials Science and Engineering",
  "date_accessioned": "2014-03-14T20:18:28Z",
  "date_adate": "1997-12-15",
  "date_available": "2014-03-14T20:18:28Z",
  "date_issued": "1997-11-20",
  "date_rdate": "1997-12-15",
  "date_sdate": "1997-11-20",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "(Abstract) The objective of this study was to evaluate and develop an understanding of durability of an adhesive bonded system, for application in a future high speed civil transport (HSCT) aircraft structure.  The system under study was comprised of Ti-6Al-4V metal adherends and a thermosetting polyimide adhesive, designated as FM-5, supplied by Cytec Engineered Materials, Inc. An approach based on fracture mechanics was employed to assess Ti-6Al-4V/FM-5 bond durability. Initially, wedge tests were utilized to find a durable surface pretreatment for the titanium adherends. Based on an extensive screening study, chromic acid anodization (CAA) was chosen as the standard pretreament for this research project.  Double cantilever beam specimens (DCB) were then made and aged at 150° C, 177° C, and 204° C in three different environments; ambient atmospheric air (14.7 psia), and reduced air pressures of 2 psi air (13.8 KPa) and 0.2 psi air (1.38 KPa).  Joints were aged for up to 18 months (including several intermediate aging times) in the above environments.  The strain energy release rate (G) of the adhesive joints was monitored as a function of exposure time in the different environments.  A 40% drop in fracture toughness was noted over the 18 month period, with the greatest degradation observed in samples aged at 204° C in ambient atmospheric air pressure.  The loss in adhesive bond performance with time was attibutable to a combination of physical and chemical aging phenomena in the FM-5 resin, and possible degradation of the metal-adhesive interface(s).  Several mechanical and material tests, performed on the bonded joints and neat FM-5 resin specimens, confirmed the above statement.  It was also noted that physical aging could be \"erased\" by thermal rejuvenation, partially restoring the toughness of the FM-5 adhesive material. \tThe FM-5 adhesive material displayed good chemical resistance towards organic solvents and other aircraft fluids such as jet fuel and hydraulic fluid.  The results from the FM-5 adhesive and its bonded joints were compared and contrasted with VT Ultem and REGULUS polyimide adhesives.  The FM-5 adhesive showed the best performance among the three adhesive systems. \tThe effect of mode-mixity on the fracture toughness of the Ti-6Al-4V/FM-5 adhesive bonded system was also evaluated.  DCB tests in conjunction with end-notched flexure (ENF) and mixed-mode flexure (MMF) tests, were used to fracture the bonded joints under pure mode I, pure mode II, and a combination of mode I and II loadings.  The results showed that the mode I fracture toughness was twice as large as the mode II toughness.  This was a rather surprising find, in sharp contrast to what several researchers have observed in the past.  Our current understanding is that the crack path selection during the failure process plays a significant role in explaining this anomalous behavior.  Finally, failure envelopes were generated for the titanium/FM-5 bonded system, both prior to and following thermal aging.  These envelopes could serve as useful tools for engineers designing with Ti-6Al-4V/FM-5 bonds.",
  "description_provenance": [
    "Author Email: hparvata@vt.edu",
    "Advisor Email: dillard@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:28Z (GMT). No. of bitstreams: 1 ETD.pdf: 6183626 bytes, checksum: 47ed1f1b04518b8a91418ed8ecca763e (MD5)   Previous issue date: 1997-11-20"
  ],
  "handle": "29554",
  "identifier_other": "etd-111297-125413",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-111297-125413/",
  "identifier_uri": "http://hdl.handle.net/10919/29554",
  "publisher": "Virginia Tech",
  "relation_haspart": "ETD.pdf",
  "rights": "I hereby grant to Virginia Tech or its agents the right to archive and to make available my thesis or dissertation in whole or in part in the University Libraries in all forms of media, now or hereafter known.  I retain all proprietary rights, such as patent rights. I also retain the right to use in future works (such as articles or books) all or part of this thesis or dissertation.",
  "subject": [
    "Double Cantilever Beam",
    "Durability",
    "Physical Aging",
    "Chemical Aging",
    "Strain Energy Release Rate",
    "Fracture Toughness",
    "Solvent Sensitivity",
    "Mode-Mix",
    "Adhesive Bond",
    "Titanium Bonds",
    "Wedge Test",
    "FM-5 Adhesive"
  ],
  "title": "Durability of Polyimide Adhesives and Their Bonded Joints for High Temperature Applications",
  "type": "Dissertation"
}