{
  "contributor_author": "Holt, Brent D.",
  "contributor_committeechair": "Sanders, Mark E.",
  "contributor_committeemember": [
    "Williams, Thomas O. Jr.",
    "Brand, Brenda R.",
    "Wells, John G."
  ],
  "contributor_department": "Teaching and Learning",
  "date_accessioned": "2014-03-14T20:18:27Z",
  "date_adate": "2011-12-06",
  "date_available": "2014-03-14T20:18:27Z",
  "date_issued": "2011-10-24",
  "date_rdate": "2011-12-06",
  "date_sdate": "2011-11-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Researchers find that teacher self-efficacy influences student performance and student academic interest (Anderson, Green & Loewen, 1988; Ross, 1992; Ashton & Webb, 1986; Woolfolk & Hoy, 1990; and Muijs & Reynolds, 2001) and that prior teaching and teacher preparation experiences influence teacher self-efficacy (Preito & Altmaier, 1994). Since the late 1990s, a significant number of teachers have been drafted to teach engineering content in secondary schools across America (NAE & NRC, 2009). Given that none of those teachers were specifically prepared for that task in pre-service secondary engineering teaching licensure programs, someâ  or perhaps even manyâ  of these new secondary engineering educators might be experiencing low teacher self-efficacy, which research suggests would lead to relatively ineffective secondary engineering teaching. Thus, the purpose of this study was to investigate experiences/factors that might influence secondary engineering teachersâ   self-efficacy, to inform those who are developing new pre- and in-service secondary engineering teacher preparation programs, and educational administrators / policy-makers. The population of Project Lead the Way (PLTW) secondary engineering teachers across the U.S. was invited to participate in this study. PLTW offers the best-known secondary engineering curriculum in the U.S. It features robust linkages/articulation agreements with post-secondary engineering programs (McVearry, 2003). The data for this study were obtained by administering the Teachersâ   Self- Efficacy Belief System-Self (TEBS-S) instrument (Dellinger, Bobbett, Oliver, & Ellett, 2008) and a demographic instrument developed by the researcher. The following factors had a statistically significant influence on teacher self-efficacy: pre-PLTW teaching experience, PLTW teaching experience, post-secondary course hours completed, teacher licensure process, and current and past teaching schedules. Implications of these findings may be used by administrators and educators who are actively involved in recruiting, selecting and preparing secondary engineering educators.",
  "description_provenance": [
    "Author Email: bholt1@vt.edu",
    "Advisor Email: msanders@vt.edu",
    "Advisor Email: thwilli1@vt.edu",
    "Advisor Email: bbrand@vt.edu",
    "Advisor Email: jgwells@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:27Z (GMT). No. of bitstreams: 1 Holt_BD_D_2011.pdf: 3949349 bytes, checksum: 34aae4b3e3af4d273dfc594f536cbbbb (MD5)   Previous issue date: 2011-10-24"
  ],
  "handle": "29552",
  "identifier_other": "etd-11122011-090513",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11122011-090513/",
  "identifier_uri": "http://hdl.handle.net/10919/29552",
  "publisher": "Virginia Tech",
  "relation_haspart": "Holt_BD_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": "Teacher self-efficacy; PLTW; Engineering education",
  "title": "An Exploratory Study of Project Lead the Way Secondary Engineering Educatorsâ   Self-Efficacy",
  "type": "Dissertation"
}