{
  "contributor_author": "Farmer, Laura Boyd",
  "contributor_committeechair": "Welfare, Laura E.",
  "contributor_committeecochair": "Burge, Penny L.",
  "contributor_committeemember": [
    "Slusher, Jennifer J.",
    "Bodenhorn, Nancy E."
  ],
  "contributor_department": "Counselor Education",
  "date_accessioned": "2014-03-14T20:18:28Z",
  "date_adate": "2011-11-30",
  "date_available": "2014-03-14T20:18:28Z",
  "date_issued": "2011-10-17",
  "date_rdate": "2011-11-30",
  "date_sdate": "2011-11-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The American Counseling Association recently adopted standards of competency for counselors working with lesbian, gay, and bisexual (LGB) clients (Logan & Barret, 2005).  Concurrently, the Council for Accreditation of Counseling and Related Educational Programs (CACREP) revised standards to require social and cultural diversity competencies, including LGB counseling competency, to be interwoven throughout counselor education curriculum (CACREP, 2009).  Yet the ways that counselor educators are including these initiatives are unknown. Additionally, the factors that improve counselor competency with LGB clients are also unknown. Therefore, the purpose of the study was to examine counselors창   self-perceived competency when counseling lesbian, gay, and bisexual clients and identify variables that are related to and predictive of LGB counseling competence.  The quantitative study included 479 members of a southeastern state창  s professional counseling association including school counselors, community-based counselors, counselor educators, and counseling students.  The assessment included an Information Questionnaire to collect data regarding personal and professional background, a Religiosity Index (Lippman et al., 2005; Statistics Canada, 2006), Spiritual Transcendence Index 창   Modified (adapted from Seidlitz et al., 2002), the Marlowe-Crowne Social Desirability Scale - Short Form C (Reynolds, 1982), and the Sexual Orientation Counselor Competency Scale (Bidell, 2005).  Among results, counselors felt least competent in their skills with LGB clients, compared to knowledge and attitudes subscales.  An ANOVA revealed that counselor educators perceived themselves as significantly more LGB-competent than counselors in other practice settings did.  School counselors also reported significantly lower levels of LGB counseling competence than community counselors.  Multiple regression analysis revealed that religiosity inversely predicted LGB competence whereas spirituality had a positive predictive relationship with LGB competence.  Finally, there was a marked deficit in training experiences involving LGB issues for counselors in the sample. Implications of the findings suggest a need to increase experiential components of counselor training to strengthen counselors창   skills with LGB clients, as well as improve the self-efficacy of school counselors in their work with LGB students.  A unique finding to the study involved counselor spirituality as a positive predictor of LGB competence, perhaps indicating higher levels of compassion and connectedness to others despite differences; future studies should investigate this relationship further.",
  "description_provenance": [
    "Author Email: lbfarmer@vt.edu",
    "Advisor Email: welfare@vt.edu",
    "Advisor Email: burge@vt.edu",
    "Advisor Email: salvy9@verizon.net",
    "Advisor Email: nanboden@exchange.vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:28Z (GMT). No. of bitstreams: 1 Farmer_LB_D_2011.pdf: 1318975 bytes, checksum: 521ee65f65d1b53b69a81d8681fedab7 (MD5)   Previous issue date: 2011-10-17"
  ],
  "handle": "29553",
  "identifier_other": "etd-11122011-113347",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11122011-113347/",
  "identifier_uri": "http://hdl.handle.net/10919/29553",
  "publisher": "Virginia Tech",
  "relation_haspart": "Farmer_LB_D_2011.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "counselor training",
    "sexual orientation",
    "competence",
    "LGB",
    "counseling"
  ],
  "title": "Counselors' self-perceived competency with lesbian, gay, and bisexual clients",
  "type": "Dissertation"
}