{
  "contributor_author": "Thayer, Amy Nichole",
  "contributor_committeechair": "Estabrooks, Paul A.",
  "contributor_committeemember": [
    "Allen, Katherine R.",
    "Hosig, Kathryn Wright",
    "Kiecolt, K. Jill",
    "Serrano, Elena L."
  ],
  "contributor_department": "Human Nutrition, Foods, and Exercise",
  "date_accessioned": "2014-03-14T20:18:27Z",
  "date_adate": "2010-12-08",
  "date_available": "2014-03-14T20:18:27Z",
  "date_issued": "2010-10-29",
  "date_rdate": "2010-12-08",
  "date_sdate": "2010-11-12",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Obesity in the United States has increased dramatically during the past 40 years. Women are more at risk than men to be obese; and, a lesbian sexual identity further increases a womanâ  s likelihood of being overweight or obese. This dissertation includes the following components: 1) a review of factors influencing overweight and obesity in lesbians, 2) an ethnographic inquiry examining how lesbian culture and a lesbian sexual identity contribute to a womanâ  s body weight, and 3) the development of a lesbian-specific tool based on factors identified during the ethnography that predicts eating, physical activity, and weight status.  The literature review, informed by the Social Ecological Model, investigated potentially contributing factors of overweight and obesity in lesbians. This review revealed a small body of literature dedicated to lesbiansâ   physical activity and eating behaviors; additionally, weight-influencing social-cultural elements of lesbian communities were identified. This body of literature suggests that specific personal, social, and environmental factors negatively influence lesbiansâ   weight, although there is not much known about this communityâ  s PA and eating behaviors, as overall behavior-specific findings, were equivocal. However, the following gaps in the literature were identified: lesbiansâ   self-efficacy in PA and healthy eating, and effects on these behaviors as determined by their membership in lesbian subcultures.  An ethnographic inquiry examined how a lesbian sexual identity contributes to body weight, attempted to fill a need in the current literature, and was driven by the following questions: 1) How does this lesbian social community serve as a context for its lesbian members to understand body weight? 2) What is the relationship between womenâ  s lesbian identities and their body weight? 3) What sub-cultural customs exist that permit or prohibit healthy eating and physical activity by women in this lesbian community? Participant observation, the primary method of data collection, uncovered the following themes: 1) Valuing Weight, 2) Coping and Socializing Behavior, and 3) Living within an Inconsistent Environment. Social Cognitive Theory assisted in interpreting how and why lesbians create innovative ways to appreciate diverse body weights and provided directives for measurement domains when investigating overweight in this community.   Informed by the previous projects, the Lesbian Overweight and Obesity Questionnaire (The LOOQ) was developed as a tool to measure potential influences on PA, fat intake, and dietary consumption, which assist in predicting body mass index (BMI) within the lesbian community. Internal consistency, test-retest reliability, and predictive validity demonstrated encouraging results; all but two (i.e., 2/27) subscales demonstrated adequate to high internal consistency (Cronbachâ  s Alphas= 0.61-0.97) and reliable test-retest scores (r=0.61-0.92). The LOOQ displayed predictive validity with subscale scores predicting outcome behaviors, which predicted BMI scores.",
  "description_provenance": [
    "Author Email: athayer5@vt.edu",
    "Advisor Email: estabrkp@vt.edu",
    "Advisor Email: kallen@vt.edu",
    "Advisor Email: khosig@vt.edu",
    "Advisor Email: kiecolt@vt.edu",
    "Advisor Email: serrano@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:27Z (GMT). No. of bitstreams: 1 Thayer_AN_D_2010.pdf: 2138137 bytes, checksum: e4825c36043ab5c892f9ce7d6998e208 (MD5)   Previous issue date: 2010-10-29"
  ],
  "handle": "29551",
  "identifier_other": "etd-11122010-100001",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11122010-100001/",
  "identifier_uri": "http://hdl.handle.net/10919/29551",
  "publisher": "Virginia Tech",
  "relation_haspart": "Thayer_AN_D_2010.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Lesbian",
    "Overweight",
    "Obesity",
    "Physical Activity",
    "Nutrition"
  ],
  "title": "Community Matters: The Exploration of Overweight and Obesity within the Lesbian Population",
  "type": "Dissertation"
}