{
  "contributor_author": "Hitchner, Erin Marie",
  "contributor_committeechair": "Kuhar, Thomas P.",
  "contributor_committeecochair": "Youngman, Roger R.",
  "contributor_committeemember": [
    "Dickens, Joseph C.",
    "Pfeiffer, Douglas G.",
    "Schultz, Peter B."
  ],
  "contributor_department": "Entomology",
  "date_accessioned": "2014-03-14T20:18:29Z",
  "date_adate": "2007-11-29",
  "date_available": "2014-03-14T20:18:29Z",
  "date_issued": "2007-11-02",
  "date_rdate": "2007-11-29",
  "date_sdate": "2007-11-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Exploiting the chemical ecology of an insect can unveil novel strategies for its pest management.  Though much has been learned about the chemical ecology of Colorado potato beetle (CPB), Leptinotarsa decemlineata (Say) (Coleoptera: Chrysomelidae), a major pest of solanaceous crops in the U.S., there has been little use of this knowledge in pest management.  To better understand host plant selection by CPB, field and laboratory-choice experiments were conducted in Virginia.  In laboratory studies, CPB preferred potato over both tomato and eggplant foliage and eggplant over tomato foliage.  However, field studies using counts of live beetles on untreated paired plants and counts of dead beetles on insecticide-treated plants revealed no significant preference for potato over eggplant.  Additional studies showed that the presence of adult male CPB on foliage greatly impacted host plant selection, with significantly more adults being attracted to eggplant with male beetles than any other treatment combination.    <p>Adult CPB have been shown to be attracted to (S)-3,7-dimethyl-2-oxo-oct-6-ene-1,3-diol [(S)-CPB I], a male-produced aggregation pheromone.  Field studies were conducted to determine if the opposite enantiomer of the pheromone, (R)-CPB I had an effect on CPB in the field.  Results revealed no differences in counts of all CPB life stages between untreated potato plots with and without rows inundated with (R)-CPB I lures.  In addition, the relative attraction of CPB adults to various racemic forms of the (S)- and (R)-enantiomers was also investigated and showed that racemic blends that were less than 97%(S) were not attractive to CPB adults.    <p>Combinations of the (S)-CPB I pheromone with synthetic plant volatiles consisting of (Z)-3-hexenyl acetate, (+)-linalool, and methyl salicylate were investigated in a trap crop strategy in potatoes, but failed to reduce CPB numbers in untreated middle rows of potatoes.  Combinations of the (S)-CPB I pheromone with synthetic plant volatiles were also used in a novel CPB trap designed to catch colonizing adults in the field.  Although the traps caught CPB adults, no differences were observed in traps baited with and without the attractant.       <p>Metaflumizone, a novel semicarbazone insecticide, was recently shown to be highly efficacious on CPB.  Laboratory studies found the combination of metaflumizone and a low concentration (0.39 ppm) of the pyrethroid esfenvalerate was slightly synergistic on CPB adults and early (1st-2nd) instar larvae.  Field trials combining a low rate of esfenvalerate and metaflumizone at one tenth the field rate controlled beetles as well as the full rate of metaflumizone.",
  "description_provenance": [
    "Author Email: hitchner@vt.edu",
    "Advisor Email: tkuhar@vt.edu",
    "Advisor Email: youngman@vt.edu",
    "Advisor Email: Joseph.Dickens@ARS.USDA.GOV",
    "Advisor Email: dgpfeiff@vt.edu",
    "Advisor Email: schultzp@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:29Z (GMT). No. of bitstreams: 1 Hitchner.pdf: 527215 bytes, checksum: f883c31b185e2ba52f80a5991842c7f9 (MD5)   Previous issue date: 2007-11-02"
  ],
  "handle": "29562",
  "identifier_other": "etd-11132007-144000",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11132007-144000/",
  "identifier_uri": "http://hdl.handle.net/10919/29562",
  "publisher": "Virginia Tech",
  "relation_haspart": "Hitchner.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "metaflumizone",
    "eggplant",
    "potato",
    "kairomone",
    "pheromone",
    "synergism"
  ],
  "title": "Investigations of the integrated pest management of Colorado potato beetle, Leptinotarsa decemlineata (Say): Host plant preference, development of semiochemical-based strategies, and evaluation of a novel insecticide",
  "type": "Dissertation"
}