{
  "contributor_author": "Overbay, Andrew Edward",
  "contributor_committeechair": "Stewart, Daisy L.",
  "contributor_committeemember": [
    "Sutphin, Cathy M.",
    "Akers, Robert Michael",
    "Broyles, Thomas W."
  ],
  "contributor_department": "Career and Technical Education",
  "date_accessioned": "2014-03-14T20:18:29Z",
  "date_adate": "2006-11-21",
  "date_available": "2014-03-14T20:18:29Z",
  "date_issued": "2006-10-18",
  "date_rdate": "2006-11-21",
  "date_sdate": "2006-11-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "<p> Career choice is governed by what individuals value and their perception of the realities that exist in a given field. Agriculture career education of gifted and talented students, therefore, must begin with an assessment of the values of the students, their assumptions regarding fields within the agriculture industry, and factors that influence their career decisions. This descriptive study summarized values and perceptions held by participants in the 2006 Virginia Governor's School for Agriculture (VGSA). Originally, the VGSA hosted 98 students; one student withdrew from the program. The results of the study confirmed that there is still much controversy and misunderstanding about agriculture and careers in the agriculture arena.   </p><p> The testing process included a survey of career values called the Values Scale. This instrument was developed by Dorothy Nevill and Donald Super and last updated in 1989. The 106-question survey measured 21 personal career values of participants. Follow-up data were collected gauging the students' thoughts on agriculture careers, agriculture companies, their individual career goals, and the influences that shaped their career decisions. </p><p>\t The career values of the VGSA Class of 2006 were surprisingly similar to high school student data collected in 1989. There were slight decreases in the value placed on economic rewards and security, but many of the other values mirrored past national data. Most students (n=73) were able to name five agriculture careers with \"farmer\" garnering most of the responses; however, 29 students did not name a single agriculture company. </p><p> A majority of the students (n=56) stated that they had made a career decision; however, most of these (n=32) also stated their career was not in the field of agriculture. Half of those having a career goal made their decision </p><p>prior to their sophomore year in high school.  Parents were named by the students as the greatest single influence on career decision among ten choices. School experiences, work experiences, and people who work in the field were also high among influences. Suggestions for further research include identifying effective methods of agricultural career exploration within VGSA and value comparisons between gifted students and the general student population.</p>",
  "description_provenance": [
    "Author Email: aoverbay@vt.edu",
    "Advisor Email: cmsutph@vt.edu",
    "Advisor Email: rma@vt.edu",
    "Advisor Email: tbroyles@vt.edu",
    "Advisor Email: daisys@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:29Z (GMT). No. of bitstreams: 1 Overbay_PhD_Dissertation_Fall_2006.pdf: 1218186 bytes, checksum: 535cd057242cbef0920dfbc60d02462a (MD5)   Previous issue date: 2006-10-18"
  ],
  "handle": "29560",
  "identifier_other": "etd-11132006-165917",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11132006-165917/",
  "identifier_uri": "http://hdl.handle.net/10919/29560",
  "publisher": "Virginia Tech",
  "relation_haspart": "Overbay_PhD_Dissertation_Fall_2006.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Career values",
    "Governor's School for Agriculture",
    "Influences on career decisions",
    "Agricultural careers",
    "Perceptions of agriculture"
  ],
  "title": "Career Values and Perceptions of Agricultural Careers of Gifted and Talented Students in the Virginia Governor's School for Agriculture",
  "type": "Dissertation"
}