{
  "contributor_author": "White, Dwana P.",
  "contributor_committeechair": "Twiford, Travis",
  "contributor_committeemember": [
    "Dillard, Patricia",
    "Cash, Carol S.",
    "Earthman, Glen"
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:18:30Z",
  "date_adate": "2009-12-10",
  "date_available": "2014-03-14T20:18:30Z",
  "date_issued": "2009-11-02",
  "date_rdate": "2013-05-20",
  "date_sdate": "2009-11-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "The purpose of this study was to examine the difference in the effects of teacher efficacy on student achievement in Title I and Non-Title I schools.  With the exception of teacher efficacy, there have been few studies reporting a consistent and significant relationship between teacher characteristics, student behavior, and student achievement (Woolfolk and Hoy, 1990).   Utilizing the Teacher Sense of Efficacy Scale, formerly known as the Ohio State Teacher Efficacy Scale, the researcher determined the teacher efficacy levels in Title I and Non-Title I schools within an urban district. <p>  A two-way ANOVA was used to examine whether there is a statistically significant main effect between teacher efficacy and student achievement within an urban school district.  The main effect of teacher efficacy on student achievement was examined by comparing the student achievement of schools on the Fourth Grade Virginia Standards of Learning Reading and Mathematic Assessment to determine if there was a significant difference in the mean score between these two groups. A t-test was used as a follow-up test of simple significant main effect and interaction effect. \t<p>The correlation between all schools and overall teacher efficacy indicated a positive relationship between teacher efficacy and math scores and efficacy of instructional strategies and math scores.  Moreover, the results indicated a positive relationship between overall teacher efficacy, efficacy of student engagement, and efficacy of instructional strategies and math scores.  There was no relationship between efficacy levels and student achievement when just examining Non-title I Schools.<p> The first ANOVA indicated no statistically significant interaction between efficacy level and school type, but significant main effects for efficacy level, and school type. This test indicated the presence of significant differences in reading achievement in Title I schools.  The second ANOVA indicated no significant interaction between efficacy level and school type, but significant main effect for efficacy level, and no significant main effect for school type.  The t-test revealed no significant differences in top quartile and bottom quartile schools in math achievement for Title I and Non-Title I schools.<p> An independent sample t-test was used in order to determine whether there was a significant difference between the overall efficacy levels and efficacy levels in the three dimensions of teachers in Title I schools and Non-Title I schools.  The test indicated there was no significant difference in the mean scores of Title I and Non-Title I teachers on the overall efficacy scale, nor in the three dimensions.   <p>   Descriptive statistics and pair sample t-test were used to answer questions four and five.  The test indicated that Title I and Non-title I teachers scored highest in the dimension labeled efficacy for instructional strategies. There was a statistically significant difference in the mean scores of student engagement / instructional strategies and student engagement / classroom management in both Title I and Non-Title I teachers.<p> High levels of teaching efficacy may serve as a necessary component for teaching students who are difficult â  to reachâ  . Therefore it is imperative that teacher efficacy levels be considered before placing teachers in schools.  It may become increasingly important for human resource to gauge a teacherâ  s efficacy level during the hiring process and the placement of new teachers.  <p> Principals must be dedicated to finding ways to increase efficacy levels in their teachers.  Longitudinal studies that examine teacher efficacy levels in various teaching environments such as urban, suburban, rural, high SES, low SES, and other similar classifications would be useful.",
  "description_provenance": [
    "Author Email: dpwhite@vt.edu",
    "Advisor Email: pdillard@vt.edu",
    "Advisor Email: ccash48@vt.edu",
    "Advisor Email: earthman@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:30Z (GMT). No. of bitstreams: 1 White_DP_D_2009.pdf: 631968 bytes, checksum: 3c03285094afb18e8c4a6f2ff26edb0f (MD5)   Previous issue date: 2009-11-02"
  ],
  "handle": "29569",
  "identifier_other": "etd-11132009-124502",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11132009-124502/",
  "identifier_uri": "http://hdl.handle.net/10919/29569",
  "publisher": "Virginia Tech",
  "relation_haspart": "White_DP_D_2009.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "instructional practices",
    "student achievement",
    "at-risk",
    "teacher efficacy"
  ],
  "title": "Differences: The Effects of Teacher Efficacy on Student Achievement in an Urban District",
  "type": "Dissertation"
}