{
  "contributor_author": "Atkins, Rosa Stocks",
  "contributor_committeecochair": [
    "Craig, James R.",
    "Parks, David J."
  ],
  "contributor_committeemember": [
    "Salmon, Richard G.",
    "Twiford, Travis W."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:18:29Z",
  "date_adate": "2008-12-08",
  "date_available": "2014-03-14T20:18:29Z",
  "date_issued": "2008-10-30",
  "date_rdate": "2008-12-08",
  "date_sdate": "2008-11-13",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "ABSTRACT After implementing a statewide standardized testing program in 1998, the Virginia Department of Education realized that some schools were making great gains in student achievement while other schools continued to struggle. The Department conducted a study to identify the practices used by schools showing improvement. Six effective practice domains were identified. The current study was a follow-up to the research conducted by the Virginia Department of Education.  \tA questionnaire measuring the six effective practice domains: (a) curriculum alignment, (b) time and scheduling, (c) use of data, (d) professional development, (e) school culture, and (f) leadership was administered to teachers in 148 schools in Virginia; 80 schools participated. Two questions guided the study: (1) How frequently do schools use the Virginia Department of Education effective practices, and (2) what is the relationship between the use of the effective practices and school pass rates on the 3rd grade 2005 Standards of Learning (SOL) reading test?  \tDescriptive statistics, linear regression, and discriminant function analysis were applied to explore the relationships between the predictor variables (percentage of students receiving free or reduced-price lunch and the use of the effective practices) and the criterion variable (school pass rate on the 2005 SOL 3rd grade reading test). Academic culture and the percentage of students receiving free or reduced-price lunch accounted for significant amounts of the variance in school pass rates. The remaining five effective practice measures were not related to school pass rates. The measures may have affected the results. In most cases, one person was used as the proxy for the school, and this person may have provided a biased assessment of what was happening in the school.",
  "description_provenance": [
    "Author Email: ratkins@vt.edu",
    "Advisor Email: rgsalmon@vt.edu",
    "Advisor Email: jcraig44@vt.edu",
    "Advisor Email: ttwiford@vt.edu",
    "Advisor Email: parks@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:29Z (GMT). No. of bitstreams: 1 RosaAtkinsDissertationpdf.pdf: 1285924 bytes, checksum: 08c70722bf7b34f46ee98f3a3c4575ac (MD5)   Previous issue date: 2008-10-30"
  ],
  "handle": "29565",
  "identifier_other": "etd-11132008-170425",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11132008-170425/",
  "identifier_uri": "http://hdl.handle.net/10919/29565",
  "publisher": "Virginia Tech",
  "relation_haspart": "RosaAtkinsDissertationpdf.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "student achievement",
    "school improvement",
    "professional development",
    "opportunity to learn",
    "leadership",
    "accountability",
    "data driven decisions",
    "curriculum alignment",
    "school culture"
  ],
  "title": "School Practices and Student Achievement",
  "type": "Dissertation"
}