{
  "contributor_author": "Lee, Eunsil",
  "contributor_committeechair": "Shrum, Judith L.",
  "contributor_committeemember": [
    "Song, Han K.",
    "Lockee, Barbara B.",
    "Billingsley, Bonnie S.",
    "Nespor, Jan K."
  ],
  "contributor_department": "Curriculum and Instruction",
  "date_accessioned": "2014-03-14T20:18:31Z",
  "date_adate": "2005-11-21",
  "date_available": "2014-03-14T20:18:31Z",
  "date_issued": "2005-11-07",
  "date_rdate": "2005-11-21",
  "date_sdate": "2005-11-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "This qualitative study examined seven Korean students' language and culture learning experiences in a study abroad context. The purpose of this study is to gain insight about the processes of students' social interactions and development of communicative competence outside the classroom. My understanding and learning was guided by the framework of various communicative competence models, interactional practices, sociocultural theory, and cultural learning processes.<p>  The findings of the study show that participation in outside-the-classroom interactions enhances students' language and culture learning in study abroad situations. However, living or working with native speakers did not necessarily mean that there were meaningful interactions. Social interaction with native speakers was challenging for language learners because of the cultural distances, discontinuity, and conflicts between them. Despite the difficulties in social and cultural interactions in the target culture, active participation in social interactions was still an important factor in language and culture learning. Verbalizing cultural issues such as cultural differences, misunderstandings, and observations of the target culture was an indication of the learners' cultural awareness and development.<p> Students believed that knowledge of grammar was an important factor for successful communication. At the same time, students were anxious about misunderstandings and miscommunication. I found that students easily engaged in interactions with their international peers, and these were less stressful than interactions with native speakers. This peer interaction eventually created opportunities for language learning. Students expected native speakers to correct their errors and to take roles as teachers of the target language even outside the classroom, but they also learned to initiate self-repairs and to ask for help. Engagement is the key to making a good conversation. The underlying condition for engagement is negotiation between two interlocutors to understand meanings.",
  "description_provenance": [
    "Author Email: eulee1@vt.edu, eulee1@korea.com",
    "Advisor Email: hksong@aol.com",
    "Advisor Email: lockeebb@vt.edu",
    "Advisor Email: billingsley@vt.edu",
    "Advisor Email: nespor@vt.edu",
    "Advisor Email: jshrum@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:31Z (GMT). No. of bitstreams: 3 LeeBodyMatters.pdf: 458452 bytes, checksum: 3e5a62db30b012e8bc6f83d4f80a4555 (MD5) LeeFrontMatters.pdf: 43801 bytes, checksum: c2b74be0d0b4630b0a716b9cf88c502a (MD5) LeeBackMatters.pdf: 180075 bytes, checksum: 6d1b1b57f139b5ec417606f6f49ed4d3 (MD5)   Previous issue date: 2005-11-07"
  ],
  "handle": "29577",
  "identifier_other": "etd-11142005-112228",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11142005-112228/",
  "identifier_uri": "http://hdl.handle.net/10919/29577",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "LeeBodyMatters.pdf",
    "LeeFrontMatters.pdf",
    "LeeBackMatters.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "second culture acquisition",
    "second language acquisition",
    "short-term study abroad",
    "sociocultural theory",
    "communication",
    "interaction",
    "qualitative study"
  ],
  "title": "Learning Language and Culture outside the Classroom: Korean Study Abroad Students' Experience",
  "type": "Dissertation"
}