{
  "contributor_author": "Knefel, Ann Margaret Callender",
  "contributor_committeechair": "Fuhrman, Ellsworth R.",
  "contributor_committeemember": [
    "Luke, Timothy W.",
    "Bailey, Carol A.",
    "Wimberley, Dale W.",
    "Ryan, John W."
  ],
  "contributor_department": "Sociology",
  "date_accessioned": "2014-03-14T20:18:31Z",
  "date_adate": "2004-12-01",
  "date_available": "2014-03-14T20:18:31Z",
  "date_issued": "2004-11-12",
  "date_rdate": "2004-12-01",
  "date_sdate": "2004-11-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Nanotechnology has captured the attention of governments and corporations around the globe. It has become the subject and context for numerous conferences, media articles, websites and scientific research papers. Nano enthusiasts and government officials claim that it is an area that promises new understandings of nature, and use of that understanding to build technologies that might change our lives. Despite the growing hype surrounding this new science, what appears to be lacking is scholarly literature that examines its growth and expansion from a social science perspective. This study addressed this limitation through a sociological analysis of the network of actors, events, rhetorical strategies, practices and instrumentation that went into the construction and growth of nanotechnology. Relying heavily on actor-network theory (ANT), this study focused on a small part of the total network referred to as the knowledge education production process, which involved the enrolment of high school teachers into the nanotechnology network through a series of collaborative workshops -- the Nanotechnology Curriculum Development Project (NCDP) -- with Virginia Polytechnic and State University (Virginia Tech) scientists over a period of two years. By investigating how the nanotechnology network was constructed and maintained, this case study examined the relevance of ANT as nanotechnology moved beyond the laboratory into the public domain of high school education. It looked at the intermediary role of high school science and math teachers and revealed the function of conflict, power, authority, hierarchy, interests, motivations, gender and race in the construction and expansion of scientific networks.",
  "description_provenance": [
    "Author Email: acallend@vt.edu",
    "Advisor Email: twluke@vt.edu",
    "Advisor Email: baileyc@vt.edu",
    "Advisor Email: fuhrman@vt.edu",
    "Advisor Email: wimberly@vt.edu",
    "Advisor Email: johnryan@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:31Z (GMT). No. of bitstreams: 3 Title.pdf: 59604 bytes, checksum: 366d07a54e2331c24529e690a3b7a97f (MD5) VITA.pdf: 109888 bytes, checksum: 5f9812fa254403159510e89e26c02305 (MD5) Dissertation.pdf: 1281083 bytes, checksum: 1b2d3d7c38dbf3782a5592259ac51e46 (MD5)   Previous issue date: 2004-11-12"
  ],
  "handle": "29575",
  "identifier_other": "etd-11142004-122015",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11142004-122015/",
  "identifier_uri": "http://hdl.handle.net/10919/29575",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "Title.pdf",
    "VITA.pdf",
    "Dissertation.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "actor network theory",
    "nanoscience",
    "nanotechnology",
    "conflict",
    "collaboration",
    "sociology of scientific knowledge"
  ],
  "title": "Exploring Educational Initiatives in Nanotechnology Networks",
  "type": "Dissertation"
}