{
  "contributor_author": "Wang, Jianli",
  "contributor_committeechair": "Ward, Thomas C.",
  "contributor_committeemember": [
    "Shultz, Allan R.",
    "Ducker, William A.",
    "McGrath, James E.",
    "Dorn, Harry C."
  ],
  "contributor_department": "Chemistry",
  "date_accessioned": "2014-03-14T20:18:31Z",
  "date_adate": "2001-11-28",
  "date_available": "2014-03-14T20:18:31Z",
  "date_issued": "2001-10-30",
  "date_rdate": "2002-11-28",
  "date_sdate": "2001-11-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "PhD",
  "description_abstract": "Well-defined central functionalized asymmetric tri-block copolymers (CFABC)  were designed as a new type of polymer brush surface modifier, with a short central functionalized block that can form chemical bonds with a suitable substrate surface. A combination of sequential living anionic polymerization and polymer modification reactions were used for the synthesis of two CFABCs: PS-b-poly(4-hydroxystyrene)-b-PMMA and PS-b-poly(4-urethanopropyl triethoxysilylstyrene)-b-PMMA. GPC and NMR characterization indicated that the block copolymers possessed controlled molecular weights and narrow molecular weight distributions.   CFABC polymer brushes were successfully prepared by chemically grafting PS-b-poly(4-urethanopropyl triethoxysilylstyrene)-b-PMMA onto silicon wafer surfaces.  AFM, XPS and ellipsometry were used to confirm the CFABC polymer brush structures and thickness. The surface properties of CFABC polymer brush modified silicon wafer substrates subjected to different environmental parameters were studied.  Reversibly switchable surface energies were observed when the polymer brush modified surfaces were exposed to solvents with different polarities.  The phenomenon was attributed to the chain configuration auto-adjustment in the polymer brush systems.  The same mechanism was also used to explain the enhanced adhesion capability between the modified surfaces and different polymer materials (PS and PMMA). Phase behaviors of polymer thin films on unmodified and CFABC polymer brush modified silicon wafer surfaces were also studied.  For thin films of polymer blends, PS blend PS-co-PMMA, the effects of film thickness, chemical composition and temperature on the phase separation mechanism were investigated.  The phase behavior in thin films of triblock copolymers with or without central functionalities were compared to reveal the role of the central functionalized groups in controlling film structures.  Finally, the presence of CFABC polymer brush at the interface between PS-b-PMMA diblock copolymer thin film and silicon wafer substrate was found to decrease the characteristic lamellar thickness in the thin film.  A mechanism of tilted chain configurations in the thin film due to the interactions with the CFABC polymer brushes was proposed.",
  "description_provenance": [
    "Author Email: jiwang4@vt.edu",
    "Advisor Email: ashultz@vt.edu",
    "Advisor Email: tward@vt.edu",
    "Advisor Email: wducker@vt.edu",
    "Advisor Email: jmcgrath@vt.edu",
    "Advisor Email: hdorn@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:31Z (GMT). No. of bitstreams: 2 jianliwangETD9.pdf: 9728736 bytes, checksum: 9f7bb64d5a62a5f19058e6547729678d (MD5) wangETDfinal.pdf: 9729539 bytes, checksum: 1156a56e9844918cfc840d178bb2bd3b (MD5)   Previous issue date: 2001-10-30"
  ],
  "handle": "29574",
  "identifier_other": "etd-11142001-160849",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11142001-160849/",
  "identifier_uri": "http://hdl.handle.net/10919/29574",
  "publisher": "Virginia Tech",
  "relation_haspart": [
    "jianliwangETD9.pdf",
    "wangETDfinal.pdf"
  ],
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "Surface Energy",
    "Thin Film",
    "Interface",
    "Polymer Brush",
    "Block Copolymer"
  ],
  "title": "Design and Characterization of Central Functionalized Asymmetric tri-Block Copolymer Modified Surfaces",
  "type": "Dissertation"
}