{
  "contributor_author": "Shelton, Janice R.",
  "contributor_committeecochair": [
    "Salmon, Richard G.",
    "Driscoll, Lisa G."
  ],
  "contributor_committeemember": [
    "Dawson, Christina M.",
    "Sughrue, Jennifer A.",
    "Geide, Cherie A."
  ],
  "contributor_department": "Educational Leadership and Policy Studies",
  "date_accessioned": "2014-03-14T20:18:30Z",
  "date_adate": "2001-11-14",
  "date_available": "2014-03-14T20:18:30Z",
  "date_issued": "2001-10-25",
  "date_rdate": "2002-11-14",
  "date_sdate": "2001-11-14",
  "degree_grantor": "Virginia Polytechnic Institute and State University",
  "degree_level": "doctoral",
  "degree_name": "Doctor of Education",
  "description_abstract": "Protestant Christian schools have become a noticeable educational entity. The factors influencing parents to enroll their children in these schools are of interest to the Protestant Christian schools themselves and to the public and nonpublic sectors. A study examining enrollment in Virginia's Association of Christian Schools International (ACSI) schools indicates that certain factors that tend to lead parents to initially enroll their children in Protestant Christian schools and then to maintain enrollment in Protestant Christian schools. The study also gives a demographic landscape of the principals and parents who are part of ACSI in Virginia.  \tParents cite certain factors as being specifically important as they initially enroll. When they re-enroll their children in Protestant Christian schools, those factors may remain constant or change. This study looks at the reasons parents state as the initial factors leading them to place their children in Protestant Christian schools and the factors that lead them to continue to enroll their children in Protestant Christian schools.  \tThe study also includes perceptions of principals of Protestant Christian Schools of reasons parents enroll their children in these schools. From their experience and position, principals can offer their perspectives of why families enroll their children in Christian schools and keep their children enrolled in the Protestant Christian schools.  Parents and principals were asked to rank what they perceived to be the top five factors leading to enrollment of students in Protestant Christian schools. Ranking the various factors isolated the most prevalent factors determining parents' decisions. Isolating the most-often chosen of the various factors aids the Protestant Christian, other nonpublic, and public schools better to evaluate how each attracts, maintains, and services their respective clientele",
  "description_provenance": [
    "Author Email: jshelton@vt.edu",
    "Advisor Email: tdawson@antiochsea.edu",
    "Advisor Email: jsugh@vt.edu",
    "Advisor Email: rgsalmon@vt.edu",
    "Advisor Email: cgeide@fbiacademy.edu",
    "Advisor Email: ldriscol@vt.edu",
    "Made available in DSpace on 2014-03-14T20:18:30Z (GMT). No. of bitstreams: 1 Shelton.pdf: 539657 bytes, checksum: 6913163053f8d2f211d773f023699831 (MD5)   Previous issue date: 2001-10-25"
  ],
  "handle": "29573",
  "identifier_other": "etd-11142001-082000",
  "identifier_sourceurl": "http://scholar.lib.vt.edu/theses/available/etd-11142001-082000/",
  "identifier_uri": "http://hdl.handle.net/10919/29573",
  "publisher": "Virginia Tech",
  "relation_haspart": "Shelton.pdf",
  "rights": "I hereby certify that, if appropriate, I have obtained and attached hereto a written permission statement from the owner(s) of each third party copyrighted matter to be included in my thesis, dissertation, or project report, allowing distribution as specified below.  I certify that the version I submitted is the same as that approved by my advisory committee.  I hereby grant to Virginia Tech or its agents the non-exclusive license to archive and make accessible, under the conditions specified below, my thesis, dissertation, or project report in whole or in part in all forms of media, now or hereafter known.  I retain all other ownership rights to the copyright of the thesis, dissertation or project report.  I also retain the right to use in future works (such as articles or books) all or part of this thesis, dissertation, or project report.",
  "subject": [
    "enrollment",
    "Protestant Christian schools"
  ],
  "title": "Factors Influencing Enrollment in Virginia's Protestant Christian Schools",
  "type": "Dissertation"
}